[
  {
    "id": 1,
    "theory": "Theory of Planned Behavior (TPB)",
    "constructs_full": "Attitude; Subjective Norms; Perceived Behavioral Control; Behavioral Intention",
    "constructs_code": "ATT; SN; PBC; BI",
    "note_vi": "Lý thuyết dự định hành vi: giải thích ý định & hành vi người tiêu dùng.",
    "group": "Hành vi",
    "domain": "Consumer Behavior, Marketing",
    "dependent_variable": "Purchase Intention (PI)",
    "reference": "Ajzen (1991)",
    "application_vi": "Khảo sát thái độ, ảnh hưởng xã hội và cảm nhận dễ dàng để dự đoán ý định mua sản phẩm hữu cơ của người tiêu dùng.",
    "definition_long": "Lý thuyết Hành vi có Kế hoạch (TPB) là một lý thuyết tâm lý học xã hội giải thích và dự đoán hành vi của con người. Nó cho rằng ý định hành vi là yếu tố dự báo trực tiếp nhất của hành vi, và ý định này được quyết định bởi ba yếu tố cốt lõi: Thái độ đối với hành vi, Chuẩn chủ quan, và Nhận thức kiểm soát hành vi.",
    "constructs_detailed": [
      { "name": "Attitude (Thái độ)", "desc": "Đánh giá tích cực hay tiêu cực của cá nhân về việc thực hiện hành vi." },
      { "name": "Subjective Norms (Chuẩn chủ quan)", "desc": "Áp lực xã hội cảm nhận được để thực hiện hoặc không thực hiện hành vi." },
      { "name": "Perceived Behavioral Control (Nhận thức kiểm soát hành vi)", "desc": "Cảm nhận về mức độ dễ dàng hay khó khăn khi thực hiện hành vi." }
    ],
    "sample_scales": [
      "Đối với tôi, việc mua sản phẩm X là một ý tưởng hay.",
      "Hầu hết những người quan trọng với tôi đều nghĩ rằng tôi nên mua sản phẩm X.",
      "Tôi hoàn toàn có đủ nguồn lực và cơ hội để mua sản phẩm X."
    ],
    "related_theories": ["Theory of Reasoned Action (TRA)"],
    "limitations": "Lý thuyết này đôi khi không giải thích được khoảng cách giữa 'ý định' và 'hành vi' thực tế, đặc biệt với các hành vi phức tạp hoặc theo thói quen."
  },
  {
    "id": 2,
    "theory": "Technology Acceptance Model (TAM)",
    "constructs_full": "Perceived Usefulness; Perceived Ease of Use; Behavioral Intention",
    "constructs_code": "PU; PEOU; BI",
    "note_vi": "Mô hình chấp nhận công nghệ: áp dụng cho nghiên cứu chuyển đổi số.",
    "group": "Công nghệ",
    "domain": "IS/IT, Digital Marketing",
    "dependent_variable": "Adoption, Use (AD)",
    "reference": "Davis (1989)",
    "application_vi": "Ngân hàng đơn giản hóa giao diện app (dễ sử dụng) và quảng bá tính năng thanh toán QR tiện lợi (hữu ích) để khuyến khích người dùng.",
    "definition_long": "Mô hình Chấp nhận Công nghệ (TAM) là một trong những lý thuyết có ảnh hưởng nhất để giải thích việc người dùng chấp nhận và sử dụng một công nghệ mới. TAM cho rằng hai yếu tố chính quyết định ý định sử dụng là Nhận thức về sự hữu ích (Perceived Usefulness) và Nhận thức về tính dễ sử dụng (Perceived Ease of Use).",
    "constructs_detailed": [
      { "name": "Perceived Usefulness (Nhận thức về sự hữu ích)", "desc": "Mức độ mà một người tin rằng việc sử dụng một hệ thống cụ thể sẽ nâng cao hiệu suất công việc của họ." },
      { "name": "Perceived Ease of Use (Nhận thức về tính dễ sử dụng)", "desc": "Mức độ mà một người tin rằng việc sử dụng một hệ thống cụ thể sẽ không đòi hỏi nhiều nỗ lực." }
    ],
    "sample_scales": [
      "Sử dụng hệ thống này giúp tôi hoàn thành công việc nhanh hơn.",
      "Tôi thấy hệ thống này rất dễ sử dụng."
    ],
    "related_theories": ["UTAUT", "TPB"],
    "limitations": "TAM có thể quá đơn giản và bỏ qua các yếu tố xã hội, văn hóa hoặc bối cảnh tổ chức có thể ảnh hưởng đến việc chấp nhận công nghệ."
  },
  {
    "id": 3,
    "theory": "SERVQUAL",
    "constructs_full": "Reliability; Assurance; Tangibles; Empathy; Responsiveness",
    "constructs_code": "REL; ASS; TAN; EMP; RES",
    "note_vi": "Thang đo chất lượng dịch vụ 5 chiều.",
    "group": "Chất lượng dịch vụ",
    "domain": "Service Marketing",
    "dependent_variable": "Customer Satisfaction (CS)",
    "reference": "Parasuraman et al. (1988)",
    "application_vi": "Bệnh viện sử dụng thang đo 5 chiều để đánh giá sự hài lòng của bệnh nhân về cơ sở vật chất, thái độ bác sĩ và quy trình khám chữa bệnh.",
    "definition_long": "SERVQUAL là một mô hình đa chiều được sử dụng để đo lường chất lượng dịch vụ. Nó đo lường khoảng cách giữa kỳ vọng của khách hàng và cảm nhận của họ về dịch vụ thực tế nhận được qua năm khía cạnh chính.",
    "constructs_detailed": [
      { "name": "Tangibles (Hữu hình)", "desc": "Cơ sở vật chất, trang thiết bị, nhân viên và tài liệu truyền thông." },
      { "name": "Reliability (Tin cậy)", "desc": "Khả năng thực hiện dịch vụ đã hứa một cách đáng tin cậy và chính xác." },
      { "name": "Responsiveness (Đáp ứng)", "desc": "Sự sẵn lòng giúp đỡ khách hàng và cung cấp dịch vụ nhanh chóng." },
      { "name": "Assurance (Đảm bảo)", "desc": "Kiến thức, sự lịch sự của nhân viên và khả năng truyền tải sự tin tưởng và tự tin." },
      { "name": "Empathy (Thấu cảm)", "desc": "Sự quan tâm, chăm sóc cá nhân hóa mà công ty dành cho khách hàng." }
    ],
    "sample_scales": [
      "Công ty có trang thiết bị trông rất hiện đại (Tangibles).",
      "Khi công ty hứa sẽ làm điều gì đó vào một thời điểm nhất định, họ đã làm (Reliability)."
    ],
    "related_theories": ["SERVPERF", "Expectation-Disconfirmation Model"],
    "limitations": "Việc đo lường 'kỳ vọng' có thể khó khăn và không ổn định. Một số nhà nghiên cứu cho rằng chỉ cần đo lường 'cảm nhận' (performance) là đủ (như trong mô hình SERVPERF)."
  },
  {
    "id": 4,
    "theory": "Resource-Based View (RBV)",
    "constructs_full": "Valuable Resources; Rare; Inimitable; Organizational Capabilities",
    "constructs_code": "VR; RR; IR; OC",
    "note_vi": "Tài nguyên & năng lực nội bộ tạo lợi thế cạnh tranh.",
    "group": "Chiến lược",
    "domain": "Strategic Management",
    "dependent_variable": "Firm Performance (FP)",
    "reference": "Barney (1991)",
    "application_vi": "Công thức bí mật của Coca-Cola và thuật toán tìm kiếm của Google là những nguồn lực cốt lõi tạo ra lợi thế cạnh tranh bền vững.",
    "definition_long": "Lý thuyết Dựa trên Nguồn lực (RBV) cho rằng lợi thế cạnh tranh bền vững của một công ty đến từ các nguồn lực và năng lực nội tại của nó. Để tạo ra lợi thế, các nguồn lực này phải có giá trị, hiếm, khó bắt chước và được tổ chức khai thác hiệu quả (VRIO).",
    "constructs_detailed": [
      { "name": "Valuable (Có giá trị)", "desc": "Nguồn lực giúp công ty khai thác cơ hội hoặc vô hiệu hóa các mối đe dọa từ môi trường." },
      { "name": "Rare (Hiếm)", "desc": "Nguồn lực không được sở hữu bởi số đông các đối thủ cạnh tranh." },
      { "name": "Inimitable (Khó bắt chước)", "desc": "Các công ty khác không thể dễ dàng có được hoặc sao chép nguồn lực này." },
      { "name": "Organization (Tổ chức)", "desc": "Công ty có cấu trúc, quy trình và văn hóa để khai thác tối đa các nguồn lực trên." }
    ],
    "sample_scales": [
      "Năng lực A của chúng tôi cho phép chúng tôi đáp ứng nhu cầu khách hàng tốt hơn đối thủ.",
      "Rất ít công ty trong ngành có được công nghệ B như chúng tôi."
    ],
    "related_theories": ["VRIO Framework", "Dynamic Capabilities"],
    "limitations": "RBV có xu hướng tĩnh và ít chú trọng đến việc làm thế nào các nguồn lực được phát triển và thay đổi theo thời gian trong một môi trường biến động."
  },
  {
    "id": 5,
    "theory": "Stakeholder Theory",
    "constructs_full": "Stakeholder Identification; Engagement; CSR Practices; Satisfaction",
    "constructs_code": "SI; SE; CSR; SS",
    "note_vi": "Lý thuyết về vai trò các bên liên quan trong doanh nghiệp.",
    "group": "Chiến lược/CSR",
    "domain": "Corporate Governance, Marketing",
    "dependent_variable": "Firm Performance (FP)",
    "reference": "Freeman (1984)",
    "application_vi": "Doanh nghiệp xây dựng chính sách phúc lợi tốt cho nhân viên, sản phẩm chất lượng cho khách hàng và báo cáo minh bạch cho cổ đông.",
    "definition_long": "Lý thuyết Các bên liên quan cho rằng một doanh nghiệp nên tạo ra giá trị cho tất cả các bên liên quan, chứ không chỉ riêng cổ đông. Các bên liên quan bao gồm bất kỳ nhóm hoặc cá nhân nào có thể ảnh hưởng hoặc bị ảnh hưởng bởi các hoạt động của công ty, chẳng hạn như nhân viên, khách hàng, nhà cung cấp, và cộng đồng.",
    "constructs_detailed": [
        { "name": "Stakeholder Identification (Nhận diện)", "desc": "Quá trình xác định các bên liên quan và mức độ quan trọng của họ." },
        { "name": "Stakeholder Engagement (Tương tác)", "desc": "Mức độ công ty giao tiếp và hợp tác với các bên liên quan." }
    ],
    "sample_scales": [
      "Công ty chúng tôi thường xuyên đối thoại với các nhóm cộng đồng địa phương.",
      "Chúng tôi luôn xem xét tác động của quyết định kinh doanh lên nhân viên."
    ],
    "related_theories": ["Corporate Social Responsibility (CSR)"],
    "limitations": "Việc xác định và cân bằng lợi ích của các bên liên quan khác nhau, vốn thường mâu thuẫn với nhau, là một thách thức lớn trong thực tế."
  },
  {
    "id": 6,
    "theory": "Social Exchange Theory",
    "constructs_full": "Trust; Commitment; Satisfaction; Reciprocity; Loyalty",
    "constructs_code": "TRU; COM; SAT; REC; LOY",
    "note_vi": "Trao đổi xã hội: niềm tin & cam kết dẫn tới trung thành.",
    "group": "Hành vi",
    "domain": "Relationship Marketing",
    "dependent_variable": "Loyalty (LOY)",
    "reference": "Blau (1964)",
    "application_vi": "Chương trình khách hàng thân thiết của các hãng hàng không: khách hàng bay thường xuyên (cam kết) và nhận lại dặm bay, nâng hạng (tương hỗ).",
    "definition_long": "Lý thuyết Trao đổi Xã hội cho rằng các mối quan hệ xã hội được hình thành và duy trì dựa trên một quá trình phân tích chi phí-lợi ích. Các cá nhân sẽ tiếp tục một mối quan hệ khi họ cảm nhận rằng lợi ích nhận được lớn hơn chi phí bỏ ra. Niềm tin và sự cam kết là những yếu tố trung tâm để các cuộc trao đổi này diễn ra lâu dài.",
    "constructs_detailed": [
      { "name": "Trust (Tin tưởng)", "desc": "Niềm tin vào sự đáng tin cậy và chính trực của đối tác." },
      { "name": "Commitment (Cam kết)", "desc": "Mong muốn duy trì một mối quan hệ có giá trị." },
      { "name": "Reciprocity (Tương hỗ)", "desc": "Cảm giác nghĩa vụ phải đáp lại những lợi ích nhận được từ người khác." }
    ],
    "sample_scales": [
      "Tôi tin tưởng rằng thương hiệu này luôn đặt lợi ích của tôi lên hàng đầu.",
      "Tôi cảm thấy gắn bó và cam kết với thương hiệu này."
    ],
    "related_theories": ["Relationship Marketing", "Equity Theory"],
    "limitations": "Lý thuyết này đôi khi bị chỉ trích là quá tính toán và bỏ qua các khía cạnh tình cảm, phi lý trí trong các mối quan hệ."
  },
  {
    "id": 7,
    "theory": "Unified Theory of Acceptance and Use of Technology (UTAUT)",
    "constructs_full": "Performance Expectancy; Effort Expectancy; Social Influence; Facilitating Conditions",
    "constructs_code": "PE; EE; SI; FC",
    "note_vi": "Mô hình hợp nhất mở rộng TAM cho môi trường tổ chức.",
    "group": "Công nghệ",
    "domain": "IS/IT, Digital Adoption",
    "dependent_variable": "Use Behavior (UB)",
    "reference": "Venkatesh et al. (2003)",
    "application_vi": "Công ty triển khai phần mềm quản lý mới và tổ chức các buổi đào tạo (điều kiện thuận lợi) để nhân viên chấp nhận sử dụng.",
    "definition_long": "Lý thuyết Hợp nhất về Chấp nhận và Sử dụng Công nghệ (UTAUT) là một mô hình mở rộng, tổng hợp từ tám lý thuyết trước đó (bao gồm cả TAM). Nó xác định bốn yếu tố chính ảnh hưởng đến ý định và hành vi sử dụng công nghệ trong môi trường tổ chức: Kỳ vọng hiệu suất, Kỳ vọng nỗ lực, Ảnh hưởng xã hội, và Điều kiện thuận lợi.",
    "constructs_detailed": [
      { "name": "Performance Expectancy (Kỳ vọng hiệu suất)", "desc": "Mức độ một cá nhân tin rằng việc sử dụng hệ thống sẽ giúp họ đạt được lợi ích trong hiệu suất công việc." },
      { "name": "Effort Expectancy (Kỳ vọng nỗ lực)", "desc": "Mức độ dễ dàng liên quan đến việc sử dụng hệ thống." },
      { "name": "Social Influence (Ảnh hưởng xã hội)", "desc": "Mức độ một cá nhân nhận thấy những người quan trọng tin rằng họ nên sử dụng hệ thống mới." },
      { "name": "Facilitating Conditions (Điều kiện thuận lợi)", "desc": "Mức độ một cá nhân tin rằng cơ sở hạ tầng kỹ thuật và tổ chức tồn tại để hỗ trợ việc sử dụng hệ thống." }
    ],
    "sample_scales": [
      "Sử dụng hệ thống này cải thiện hiệu suất công việc của tôi.",
      "Những người có ảnh hưởng đến tôi nghĩ rằng tôi nên sử dụng hệ thống này."
    ],
    "related_theories": ["TAM", "TPB"],
    "limitations": "UTAUT khá phức tạp với nhiều biến điều tiết (moderators) như tuổi, giới tính, kinh nghiệm, làm cho việc áp dụng và kiểm định trở nên khó khăn hơn so với TAM."
  },
  {
    "id": 8,
    "theory": "AIDA Model",
    "constructs_full": "Attention; Interest; Desire; Action",
    "constructs_code": "ATTN; INT; DES; ACT",
    "note_vi": "Mô hình hành vi khách hàng qua các giai đoạn quảng cáo.",
    "group": "Marketing",
    "domain": "Advertising, Sales",
    "dependent_variable": "Purchase/Action (ACT)",
    "reference": "St. Elmo Lewis (1898)",
    "application_vi": "Quảng cáo trên YouTube: video ngắn gây tò mò (Attention), giới thiệu sản phẩm (Interest), đưa ra ưu đãi (Desire), và kêu gọi 'Mua ngay' (Action).",
    "definition_long": "AIDA là một mô hình phễu marketing cổ điển mô tả các giai đoạn nhận thức mà một cá nhân trải qua trong quá trình mua một sản phẩm hoặc dịch vụ. Nhà tiếp thị cần phải thu hút sự chú ý của khách hàng, tạo ra sự quan tâm, khơi dậy mong muốn và cuối cùng là thúc đẩy hành động.",
    "constructs_detailed": [
      { "name": "Attention (Chú ý)", "desc": "Thu hút sự chú ý của người tiêu dùng." },
      { "name": "Interest (Thích thú)", "desc": "Tạo ra sự quan tâm đến lợi ích của sản phẩm hoặc dịch vụ." },
      { "name": "Desire (Mong muốn)", "desc": "Xây dựng mong muốn sở hữu sản phẩm, chuyển từ 'thích' sang 'muốn'." },
      { "name": "Action (Hành động)", "desc": "Thúc đẩy người tiêu dùng thực hiện hành động mua hàng." }
    ],
    "sample_scales": [ "Đây là một khung phân tích định tính, không sử dụng thang đo Likert. Hiệu quả được đo bằng tỷ lệ chuyển đổi ở mỗi giai đoạn." ],
    "related_theories": ["Hierarchy of Effects", "Sales Funnel"],
    "limitations": "Mô hình này có tính tuyến tính và đơn giản, có thể không phản ánh đúng hành trình mua hàng phức tạp và phi tuyến tính của khách hàng trong thời đại số."
  },
  {
    "id": 9,
    "theory": "Hierarchy of Effects",
    "constructs_full": "Awareness; Knowledge; Liking; Preference; Conviction; Purchase",
    "constructs_code": "AWA; KNW; LIK; PREF; CONV; PUR",
    "note_vi": "Chuỗi hiệu ứng từ nhận biết đến hành động mua.",
    "group": "Marketing",
    "domain": "Branding, Advertising",
    "dependent_variable": "Purchase (PUR)",
    "reference": "Lavidge & Steiner (1961)",
    "application_vi": "Một thương hiệu ô tô mới ra mắt chiến dịch từ TVC (nhận biết), bài PR (kiến thức) đến sự kiện lái thử (tin tưởng) để thuyết phục khách hàng.",
    "definition_long": "Mô hình Phân cấp Hiệu ứng cho rằng quảng cáo có tác động theo một chuỗi các bước. Khách hàng không mua ngay lập tức mà trải qua một loạt các giai đoạn nhận thức (cognitive), cảm xúc (affective) và hành vi (behavioral), từ việc chỉ biết đến sản phẩm cho đến khi tin tưởng và mua hàng.",
    "constructs_detailed": [
      { "name": "Awareness/Knowledge (Nhận thức/Kiến thức)", "desc": "Giai đoạn khách hàng biết đến sự tồn tại và thông tin cơ bản về sản phẩm." },
      { "name": "Liking/Preference (Yêu thích/Ưa chuộng)", "desc": "Giai đoạn hình thành cảm xúc tích cực và sự ưu tiên cho thương hiệu so với đối thủ." },
      { "name": "Conviction/Purchase (Tin tưởng/Mua hàng)", "desc": "Giai đoạn tin chắc rằng mua sản phẩm là quyết định đúng đắn và thực hiện hành vi mua." }
    ],
    "sample_scales": [
      "Tôi nhận biết rất rõ về thương hiệu X.",
      "Tôi thích thương hiệu X hơn các thương hiệu cạnh tranh khác."
    ],
    "related_theories": ["AIDA Model"],
    "limitations": "Giống như AIDA, mô hình này giả định một quá trình tuyến tính và không phải lúc nào các giai đoạn cũng diễn ra theo đúng thứ tự này. Cảm xúc và hành vi có thể xảy ra đồng thời."
  },
  {
    "id": 10,
    "theory": "Brand Equity (Keller)",
    "constructs_full": "Brand Awareness; Brand Associations; Perceived Quality; Brand Loyalty",
    "constructs_code": "BAW; BAS; PQ; BL",
    "note_vi": "Mô hình giá trị thương hiệu (CBBE).",
    "group": "Thương hiệu",
    "domain": "Marketing, Branding",
    "dependent_variable": "Brand Equity (BE)",
    "reference": "Keller (1993)",
    "application_vi": "Apple xây dựng giá trị thương hiệu thông qua thiết kế (liên tưởng), chất lượng sản phẩm (cảm nhận) và cộng đồng fan trung thành.",
    "definition_long": "Mô hình Tài sản Thương hiệu Dựa trên Khách hàng (CBBE) của Keller định nghĩa tài sản thương hiệu là hiệu ứng khác biệt mà kiến thức về thương hiệu có đối với phản ứng của người tiêu dùng đối với hoạt động marketing của thương hiệu đó. Nó được xây dựng qua bốn cấp độ: Nhận diện, Ý nghĩa, Phản ứng, và Quan hệ.",
    "constructs_detailed": [
      { "name": "Brand Awareness (Nhận biết thương hiệu)", "desc": "Khả năng khách hàng nhận ra và nhớ lại thương hiệu." },
      { "name": "Brand Associations (Liên tưởng thương hiệu)", "desc": "Tất cả những gì được liên kết với thương hiệu trong tâm trí khách hàng (thuộc tính, lợi ích, hình ảnh)." },
      { "name": "Perceived Quality (Chất lượng cảm nhận)", "desc": "Nhận thức của khách hàng về chất lượng tổng thể của sản phẩm/dịch vụ so với các lựa chọn thay thế." },
      { "name": "Brand Loyalty (Lòng trung thành)", "desc": "Mức độ gắn bó của khách hàng với thương hiệu, thể hiện qua việc mua lặp lại và sự ủng hộ." }
    ],
    "sample_scales": [
      "Thương hiệu X là thương hiệu đầu tiên tôi nghĩ đến khi mua sản phẩm này.",
      "Tôi sẵn sàng trả giá cao hơn cho thương hiệu X.",
      "Tôi sẽ tiếp tục mua thương hiệu X trong tương lai."
    ],
    "related_theories": ["Brand Resonance Model", "Brand Personality Framework"],
    "limitations": "Việc đo lường các khái niệm trừu tượng như 'liên tưởng thương hiệu' hoặc 'cảm xúc' có thể phức tạp và đòi hỏi các phương pháp nghiên cứu đa dạng."
  },
  {
    "id": 11,
    "theory": "Maslow's Hierarchy of Needs",
    "constructs_full": "Physiological; Safety; Social; Esteem; Self-actualization",
    "constructs_code": "PHYS; SAFE; SOC; EST; SA",
    "note_vi": "Tháp nhu cầu ứng dụng trong phân tích động cơ mua sắm.",
    "group": "Hành vi",
    "domain": "Consumer Psychology",
    "dependent_variable": "Motivation (MOT)",
    "reference": "Maslow (1943)",
    "application_vi": "Quảng cáo xe hơi sang trọng không chỉ nhấn mạnh tính năng an toàn (Safety) mà còn là biểu tượng của sự thành đạt (Esteem).",
    "definition_long": "Tháp nhu cầu của Maslow là một lý thuyết động lực trong tâm lý học, bao gồm một mô hình năm bậc của các nhu cầu con người. Các nhu cầu ở bậc thấp hơn phải được thỏa mãn trước khi các nhu cầu ở bậc cao hơn trở thành động lực chính.",
    "constructs_detailed": [
      { "name": "Physiological (Sinh lý)", "desc": "Các nhu cầu cơ bản để tồn tại như thức ăn, nước uống, không khí." },
      { "name": "Safety (An toàn)", "desc": "Nhu cầu về an ninh, sự ổn định, an toàn về thể chất và tài chính." },
      { "name": "Social (Xã hội)", "desc": "Nhu cầu về tình yêu, tình bạn, sự thuộc về một nhóm." },
      { "name": "Esteem (Được tôn trọng)", "desc": "Nhu cầu về lòng tự trọng, sự công nhận, địa vị và sự tôn trọng từ người khác." },
      { "name": "Self-actualization (Thể hiện bản thân)", "desc": "Nhu cầu phát huy hết tiềm năng của bản thân, theo đuổi sự phát triển cá nhân và những trải nghiệm đỉnh cao." }
    ],
    "sample_scales": [ "Đây là một khung lý thuyết khái niệm, thường được dùng để phân tích định tính hơn là đo lường bằng thang đo." ],
    "related_theories": ["Herzberg Two-Factor Theory"],
    "limitations": "Lý thuyết này bị chỉ trích vì sự phân cấp cứng nhắc và thiếu bằng chứng thực nghiệm mạnh mẽ. Trong thực tế, các nhu cầu có thể được theo đuổi đồng thời."
  },
  {
    "id": 12,
    "theory": "Herzberg Two-Factor Theory",
    "constructs_full": "Hygiene Factors; Motivators",
    "constructs_code": "HY; MOT",
    "note_vi": "Hai nhóm yếu tố ảnh hưởng đến hài lòng nghề nghiệp.",
    "group": "HR/Organizational",
    "domain": "Workplace Motivation",
    "dependent_variable": "Job Satisfaction (JS)",
    "reference": "Herzberg (1959)",
    "application_vi": "Lương và điều kiện làm việc (Hygiene) chỉ giúp nhân viên không nghỉ việc, trong khi sự công nhận và cơ hội thăng tiến (Motivators) mới thực sự tạo ra động lực.",
    "definition_long": "Lý thuyết Hai Yếu tố (còn gọi là lý thuyết Động viên-Duy trì) cho rằng có hai nhóm yếu tố riêng biệt ảnh hưởng đến sự hài lòng trong công việc. Yếu tố Duy trì (Hygiene factors) nếu không được đáp ứng sẽ gây ra sự bất mãn, nhưng không tạo ra động lực. Yếu tố Động viên (Motivators) mới thực sự thúc đẩy sự hài lòng và hiệu suất.",
    "constructs_detailed": [
      { "name": "Hygiene Factors (Yếu tố duy trì)", "desc": "Các yếu tố liên quan đến bối cảnh công việc như lương, chính sách công ty, điều kiện làm việc, sự giám sát. Sự thiếu hụt gây bất mãn, nhưng sự hiện diện không tạo ra sự hài lòng." },
      { "name": "Motivators (Yếu tố động viên)", "desc": "Các yếu tố liên quan đến nội dung công việc như sự công nhận, thành tích, trách nhiệm, sự thăng tiến, sự phát triển cá nhân. Sự hiện diện của chúng tạo ra sự hài lòng và động lực." }
    ],
    "sample_scales": [
      "Chính sách của công ty là công bằng và rõ ràng.",
      "Tôi cảm thấy được công nhận khi hoàn thành tốt công việc."
    ],
    "related_theories": ["Maslow's Hierarchy of Needs", "Self-Determination Theory"],
    "limitations": "Phương pháp luận ban đầu của Herzberg bị chỉ trích và lý thuyết này có thể đơn giản hóa quá mức mối quan hệ phức tạp giữa động lực và sự hài lòng."
  },
  {
    "id": 13,
    "theory": "Expectancy Theory",
    "constructs_full": "Expectancy; Instrumentality; Valence",
    "constructs_code": "EXP; INS; VAL",
    "note_vi": "Hành vi dựa trên kỳ vọng và giá trị kết quả.",
    "group": "Hành vi",
    "domain": "Motivation, HR",
    "dependent_variable": "Performance (PERF)",
    "reference": "Vroom (1964)",
    "application_vi": "Nhân viên bán hàng sẽ nỗ lực hơn nếu tin rằng việc đạt KPI (kỳ vọng) chắc chắn sẽ dẫn đến một khoản thưởng lớn và có giá trị (hóa trị).",
    "definition_long": "Lý thuyết Kỳ vọng của Vroom cho rằng một cá nhân sẽ hành động theo một cách nhất định dựa trên kỳ vọng rằng hành động đó sẽ dẫn đến một kết quả mong muốn và giá trị của kết quả đó đối với cá nhân. Động lực là sản phẩm của ba yếu tố: Kỳ vọng, Tính công cụ, và Hóa trị. (Motivation = E * I * V)",
    "constructs_detailed": [
      { "name": "Expectancy (Kỳ vọng)", "desc": "Niềm tin rằng nỗ lực sẽ dẫn đến hiệu suất mong muốn (Effort -> Performance)." },
      { "name": "Instrumentality (Tính công cụ)", "desc": "Niềm tin rằng hiệu suất sẽ dẫn đến một kết quả/phần thưởng cụ thể (Performance -> Outcome)." },
      { "name": "Valence (Hóa trị)", "desc": "Giá trị hoặc tầm quan trọng mà một cá nhân đặt vào kết quả hoặc phần thưởng đó." }
    ],
    "sample_scales": [
      "Nếu tôi nỗ lực hơn, tôi tin rằng tôi sẽ đạt được mục tiêu công việc.",
      "Việc đạt được mục tiêu công việc chắc chắn sẽ giúp tôi được thưởng.",
      "Phần thưởng đó rất quan trọng đối với tôi."
    ],
    "related_theories": ["Goal-Setting Theory"],
    "limitations": "Lý thuyết này giả định con người luôn hành động một cách lý trí và tính toán, điều này có thể không đúng trong mọi tình huống."
  },
  {
    "id": 14,
    "theory": "Equity Theory",
    "constructs_full": "Inputs; Outcomes; Perceived Fairness",
    "constructs_code": "INP; OUT; PF",
    "note_vi": "Ảnh hưởng cảm nhận công bằng tới thái độ lao động.",
    "group": "HR/Organizational",
    "domain": "Workplace",
    "dependent_variable": "Job Satisfaction (JS)",
    "reference": "Adams (1963)",
    "application_vi": "Một nhân viên có thể giảm năng suất nếu cảm thấy mức lương của mình không công bằng so với đồng nghiệp có cùng đóng góp và kinh nghiệm.",
    "definition_long": "Lý thuyết Công bằng cho rằng nhân viên tìm kiếm sự công bằng trong các mối quan hệ xã hội tại nơi làm việc. Họ so sánh tỷ lệ giữa đóng góp (inputs) và kết quả (outcomes) của mình với tỷ lệ của người khác (referent). Sự bất công cảm nhận được sẽ tạo ra căng thẳng và thúc đẩy họ hành động để khôi phục lại sự công bằng.",
    "constructs_detailed": [
      { "name": "Inputs (Đóng góp)", "desc": "Những gì một cá nhân đóng góp cho công việc, ví dụ: nỗ lực, kỹ năng, kinh nghiệm, thời gian." },
      { "name": "Outcomes (Kết quả)", "desc": "Những gì một cá nhân nhận được từ công việc, ví dụ: lương, thưởng, sự công nhận, phúc lợi." },
      { "name": "Perceived Fairness (Cảm nhận công bằng)", "desc": "Sự so sánh chủ quan về tỷ lệ Outcomes/Inputs của bản thân so với người khác." }
    ],
    "sample_scales": [
      "Tôi được trả lương công bằng cho những đóng góp của mình.",
      "So với các đồng nghiệp có cùng trách nhiệm, tôi tin rằng kết quả tôi nhận được là thỏa đáng."
    ],
    "related_theories": ["Organizational Justice"],
    "limitations": "Việc xác định 'người so sánh' (referent other) và các 'đóng góp', 'kết quả' là rất chủ quan và khác nhau ở mỗi người."
  },
  {
    "id": 15,
    "theory": "Diffusion of Innovation",
    "constructs_full": "Relative Advantage; Compatibility; Complexity; Trialability; Observability",
    "constructs_code": "RA; COMP; COMPL; TRI; OBS",
    "note_vi": "Yếu tố ảnh hưởng đến tốc độ lan tỏa đổi mới.",
    "group": "Innovation",
    "domain": "Marketing, Technology",
    "dependent_variable": "Adoption Rate (AR)",
    "reference": "Rogers (1962)",
    "application_vi": "Tốc độ phổ cập của ví điện tử phụ thuộc vào việc nó có tiện lợi hơn tiền mặt (lợi thế), tương thích với nhiều cửa hàng và dễ sử dụng (ít phức tạp).",
    "definition_long": "Lý thuyết Khuếch tán Đổi mới giải thích cách thức, lý do và tốc độ mà các ý tưởng và công nghệ mới lan truyền qua các nền văn hóa. Lý thuyết xác định năm thuộc tính của đổi mới ảnh hưởng đến tỷ lệ chấp nhận: Lợi thế tương đối, Tương thích, Phức tạp, Khả năng dùng thử, và Khả năng quan sát.",
    "constructs_detailed": [
      { "name": "Relative Advantage (Lợi thế tương đối)", "desc": "Mức độ một đổi mới được coi là tốt hơn so với sản phẩm/ý tưởng mà nó thay thế." },
      { "name": "Compatibility (Tương thích)", "desc": "Mức độ một đổi mới phù hợp với các giá trị, kinh nghiệm và nhu cầu của người dùng tiềm năng." },
      { "name": "Complexity (Phức tạp)", "desc": "Mức độ một đổi mới được coi là khó hiểu và khó sử dụng." },
      { "name": "Trialability (Khả năng dùng thử)", "desc": "Mức độ một đổi mới có thể được thử nghiệm trên cơ sở hạn chế." },
      { "name": "Observability (Khả năng quan sát)", "desc": "Mức độ kết quả của một đổi mới có thể được nhìn thấy bởi những người khác." }
    ],
    "sample_scales": [
      "Sản phẩm mới này mang lại nhiều lợi ích hơn so với sản phẩm tôi đang dùng.",
      "Việc sử dụng sản phẩm mới này hoàn toàn phù hợp với lối sống của tôi."
    ],
    "related_theories": ["The Chasm"],
    "limitations": "Lý thuyết này thường tập trung vào bản thân sự đổi mới mà đôi khi xem nhẹ vai trò của các mạng lưới xã hội và các yếu tố môi trường khác."
  },
  {
    "id": 16,
    "theory": "Knowledge-Based View (KBV)",
    "constructs_full": "Knowledge Creation; Sharing; Integration; Absorptive Capacity",
    "constructs_code": "KC; KS; KI; AC",
    "note_vi": "Tri thức là nguồn lực chiến lược của doanh nghiệp.",
    "group": "Organizational",
    "domain": "Knowledge Management",
    "dependent_variable": "Innovation Performance (IP)",
    "reference": "Grant (1996)",
    "application_vi": "Các công ty tư vấn coi tri thức của chuyên gia là tài sản cốt lõi và xây dựng hệ thống quản trị tri thức để tạo lợi thế cạnh tranh.",
    "definition_long": "Lý thuyết Dựa trên Tri thức (KBV) là một nhánh của Lý thuyết Dựa trên Nguồn lực (RBV), cho rằng tri thức là nguồn lực chiến lược quan trọng nhất của một công ty. Lợi thế cạnh tranh đến từ khả năng của công ty trong việc tạo ra, chia sẻ, tích hợp và áp dụng tri thức hiệu quả hơn đối thủ.",
    "constructs_detailed": [
        { "name": "Knowledge Creation (Tạo tri thức)", "desc": "Quá trình hình thành tri thức mới trong tổ chức." },
        { "name": "Knowledge Sharing (Chia sẻ tri thức)", "desc": "Quá trình phổ biến tri thức giữa các cá nhân và bộ phận." },
        { "name": "Knowledge Integration (Tích hợp tri thức)", "desc": "Khả năng kết hợp các mảng tri thức chuyên môn khác nhau để giải quyết vấn đề." },
        { "name": "Absorptive Capacity (Năng lực hấp thụ)", "desc": "Khả năng nhận biết, tiếp thu và áp dụng tri thức mới từ bên ngoài." }
    ],
    "sample_scales": [
        "Công ty chúng tôi khuyến khích nhân viên chia sẻ ý tưởng và kinh nghiệm.",
        "Các nhóm dự án của chúng tôi rất giỏi trong việc kết hợp chuyên môn từ nhiều lĩnh vực."
    ],
    "related_theories": ["Resource-Based View (RBV)", "Absorptive Capacity"],
    "limitations": "KBV có thể khó áp dụng thực tế vì tri thức, đặc biệt là tri thức ẩn (tacit knowledge), rất khó để đo lường và quản lý."
  },
  {
    "id": 17,
    "theory": "Dynamic Capabilities",
    "constructs_full": "Sensing; Seizing; Reconfiguring",
    "constructs_code": "SEN; SEI; REC",
    "note_vi": "Khả năng thích ứng và đổi mới của doanh nghiệp.",
    "group": "Chiến lược",
    "domain": "Strategic Management",
    "dependent_variable": "Competitive Advantage (CA)",
    "reference": "Teece et al. (1997)",
    "application_vi": "Netflix liên tục tái cấu trúc từ cho thuê DVD (sensing) sang streaming (seizing) rồi tự sản xuất nội dung (reconfiguring) để thích ứng thị trường.",
    "definition_long": "Năng lực Động là một lý thuyết mở rộng từ RBV, tập trung vào khả năng của một công ty trong việc tích hợp, xây dựng và tái cấu trúc các năng lực nội bộ và bên ngoài để đối phó với môi trường kinh doanh thay đổi nhanh chóng. Nó không chỉ là 'có' nguồn lực, mà là 'khả năng thay đổi' nguồn lực.",
    "constructs_detailed": [
        { "name": "Sensing (Cảm nhận)", "desc": "Khả năng xác định và định hình các cơ hội và mối đe dọa từ thị trường." },
        { "name": "Seizing (Nắm bắt)", "desc": "Khả năng huy động nguồn lực để nắm bắt các cơ hội đã xác định." },
        { "name": "Reconfiguring (Tái cấu trúc)", "desc": "Khả năng liên tục chuyển đổi và tái cấu trúc các tài sản hữu hình và vô hình của công ty." }
    ],
    "sample_scales": [
        "Công ty chúng tôi rất nhanh nhạy trong việc phát hiện các xu hướng mới trên thị trường.",
        "Chúng tôi có khả năng nhanh chóng phân bổ lại nguồn lực để theo đuổi một cơ hội mới."
    ],
    "related_theories": ["Resource-Based View (RBV)"],
    "limitations": "Các khái niệm của Năng lực Động khá trừu tượng và khó định nghĩa một cách cụ thể, gây khó khăn cho việc đo lường và kiểm định thực nghiệm."
  },
  {
    "id": 18,
    "theory": "Transaction Cost Economics (TCE)",
    "constructs_full": "Asset Specificity; Uncertainty; Frequency",
    "constructs_code": "AS; UNC; FREQ",
    "note_vi": "Chi phí giao dịch ảnh hưởng tới cấu trúc hợp tác và quản trị.",
    "group": "Governance",
    "domain": "Strategy, Operations",
    "dependent_variable": "Governance Choice (GC)",
    "reference": "Williamson (1979)",
    "application_vi": "Hãng xe hơi có thể quyết định tự sản xuất động cơ (đặc thù cao) thay vì thuê ngoài để giảm rủi ro và chi phí giao dịch dài hạn.",
    "definition_long": "Kinh tế học Chi phí Giao dịch (TCE) giải thích tại sao các công ty tồn tại và quyết định giữa việc 'tự làm' (hierarchy) hay 'thuê ngoài' (market). Lý thuyết này cho rằng các công ty sẽ chọn hình thức quản trị nào giúp giảm thiểu chi phí giao dịch (chi phí tìm kiếm, đàm phán, thực thi hợp đồng).",
    "constructs_detailed": [
        { "name": "Asset Specificity (Tính đặc thù của tài sản)", "desc": "Mức độ mà một tài sản có thể được tái triển khai cho các mục đích thay thế mà không mất đi giá trị sản xuất." },
        { "name": "Uncertainty (Bất định)", "desc": "Sự không chắc chắn về môi trường và hành vi của đối tác, làm tăng rủi ro và chi phí giám sát." },
        { "name": "Frequency (Tần suất)", "desc": "Số lần giao dịch diễn ra. Giao dịch thường xuyên có thể biện minh cho việc xây dựng một cấu trúc quản trị phức tạp hơn." }
    ],
    "sample_scales": [ "TCE thường được áp dụng trong các phân tích định tính về quyết định chiến lược (make-or-buy) hơn là các khảo sát định lượng." ],
    "related_theories": ["Agency Theory"],
    "limitations": "TCE bị chỉ trích vì tập trung quá nhiều vào chi phí và hiệu quả, bỏ qua các yếu tố như niềm tin, quyền lực và các mối quan hệ xã hội trong các quyết định kinh doanh."
  },
  {
    "id": 19,
    "theory": "Agency Theory",
    "constructs_full": "Principal-Agent Conflict; Incentive Alignment; Monitoring",
    "constructs_code": "PAC; IA; MON",
    "note_vi": "Vấn đề đại diện và cơ chế khuyến khích/giám sát.",
    "group": "Corporate Governance",
    "domain": "Management",
    "dependent_variable": "Agency Costs (AC)",
    "reference": "Jensen & Meckling (1976)",
    "application_vi": "Thưởng cổ phiếu (ESOP) cho ban lãnh đạo là một cách để gắn kết lợi ích của nhà quản lý (agent) với cổ đông (principal).",
    "definition_long": "Lý thuyết Đại diện giải quyết các vấn đề phát sinh khi một bên (người chủ - principal) ủy quyền công việc cho một bên khác (người đại diện - agent). Vấn đề xảy ra khi lợi ích của người đại diện và người chủ không đồng nhất và người chủ không thể giám sát hoàn toàn hành động của người đại diện. Điều này dẫn đến chi phí đại diện (agency costs).",
    "constructs_detailed": [
        { "name": "Principal-Agent Conflict (Xung đột Chủ-Đại diện)", "desc": "Sự khác biệt về mục tiêu và mức độ chấp nhận rủi ro giữa người chủ và người đại diện." },
        { "name": "Incentive Alignment (Thống nhất lợi ích)", "desc": "Các cơ chế (như thưởng, cổ phiếu) được thiết kế để làm cho lợi ích của người đại diện gần hơn với lợi ích của người chủ." },
        { "name": "Monitoring (Giám sát)", "desc": "Các hoạt động mà người chủ thực hiện để theo dõi và kiểm soát hành vi của người đại diện." }
    ],
    "sample_scales": [ "Lý thuyết này thường được kiểm định bằng dữ liệu tài chính của công ty (ví dụ: cấu trúc sở hữu, chính sách thưởng) chứ không phải qua khảo sát." ],
    "related_theories": ["Transaction Cost Economics (TCE)"],
    "limitations": "Lý thuyết này có một cái nhìn khá tiêu cực về bản chất con người, cho rằng các cá nhân luôn hành động vì tư lợi. Nó cũng bỏ qua các yếu tố động lực nội tại."
  },
  {
    "id": 20,
    "theory": "Signaling Theory",
    "constructs_full": "Signal Strength; Credibility; Information Asymmetry",
    "constructs_code": "SS; SC; IA",
    "note_vi": "Tín hiệu giảm bất cân xứng thông tin.",
    "group": "Market",
    "domain": "Marketing, HR",
    "dependent_variable": "Market Response (MR)",
    "reference": "Spence (1973)",
    "application_vi": "Một thương hiệu đầu tư lớn vào quảng cáo trên truyền hình quốc gia là một tín hiệu cho người tiêu dùng về sức mạnh và sự cam kết của họ.",
    "definition_long": "Lý thuyết Tín hiệu giải quyết vấn đề bất đối xứng thông tin giữa hai bên. Bên có nhiều thông tin hơn (ví dụ: người bán) có thể gửi các 'tín hiệu' (signals) cho bên có ít thông tin hơn (ví dụ: người mua) để truyền đạt một cách đáng tin cậy về chất lượng hoặc ý định của mình. Để hiệu quả, tín hiệu phải tốn kém để bắt chước.",
    "constructs_detailed": [
        { "name": "Signal Strength (Sức mạnh tín hiệu)", "desc": "Mức độ rõ ràng và dễ nhận biết của tín hiệu." },
        { "name": "Credibility (Độ tin cậy)", "desc": "Mức độ mà người nhận tin rằng tín hiệu phản ánh đúng sự thật." },
        { "name": "Information Asymmetry (Bất đối xứng thông tin)", "desc": "Sự chênh lệch về thông tin giữa người gửi và người nhận tín hiệu." }
    ],
    "sample_scales": [
        "Việc công ty này được chứng nhận ISO 9001 làm tôi tin tưởng hơn vào chất lượng của họ.",
        "Tôi tin rằng một công ty quảng cáo nhiều là một công ty có tiềm lực tài chính mạnh."
    ],
    "related_theories": ["Agency Theory"],
    "limitations": "Việc diễn giải tín hiệu có thể phụ thuộc vào văn hóa và bối cảnh. Đôi khi, tín hiệu có thể bị làm giả hoặc gây hiểu lầm."
  },
  {
    "id": 21,
    "theory": "Prospect Theory",
    "constructs_full": "Reference Point; Loss Aversion; Probability Weighting",
    "constructs_code": "RP; LA; PW",
    "note_vi": "Người tiêu dùng cảm nhận mất mát mạnh hơn lợi ích tương đương.",
    "group": "Hành vi",
    "domain": "Behavioral Economics",
    "dependent_variable": "Choice (CHO)",
    "reference": "Kahneman & Tversky (1979)",
    "application_vi": "Thông điệp 'Bạn sẽ mất 500.000đ mỗi tháng nếu không dùng gói tiết kiệm' thường hiệu quả hơn 'Bạn sẽ tiết kiệm được 500.000đ'.",
    "definition_long": "Lý thuyết Triển vọng mô tả cách mọi người đưa ra quyết định giữa các lựa chọn có rủi ro (triển vọng). Nó cho thấy rằng mọi người đánh giá các khoản lợi và lỗ một cách khác nhau, và các quyết định của họ thường không hợp lý. Con người có xu hướng 'ác cảm với mất mát' (loss averse) - nỗi đau mất mát mạnh hơn niềm vui khi có được một khoản tương đương.",
    "constructs_detailed": [
        { "name": "Reference Point (Điểm tham chiếu)", "desc": "Trạng thái ban đầu mà các kết quả được đánh giá dựa trên đó (ví dụ: tài sản hiện tại)." },
        { "name": "Loss Aversion (Ác cảm mất mát)", "desc": "Xu hướng tâm lý coi trọng việc tránh mất mát hơn là đạt được lợi ích tương đương." },
        { "name": "Probability Weighting (Trọng số xác suất)", "desc": "Con người có xu hướng đánh giá quá cao các xác suất nhỏ và đánh giá quá thấp các xác suất lớn." }
    ],
    "sample_scales": [ "Lý thuyết này thường được kiểm chứng qua các thí nghiệm lựa chọn (choice experiments) hơn là thang đo Likert." ],
    "related_theories": ["Framing Effect", "Mental Accounting"],
    "limitations": "Lý thuyết này mang tính mô tả hơn là giải thích; nó cho biết con người hành xử như thế nào nhưng không giải thích tại sao lại có những xu hướng nhận thức đó."
  },
  {
    "id": 22,
    "theory": "Elaboration Likelihood Model (ELM)",
    "constructs_full": "Central Route; Peripheral Route; Argument Quality; Source Credibility",
    "constructs_code": "CR; PR; AQ; SC",
    "note_vi": "Xử lý thông tin trung tâm hoặc ngoại biên ảnh hưởng thái độ.",
    "group": "Thuyết phục",
    "domain": "Advertising, Communication",
    "dependent_variable": "Attitude Change (AC)",
    "reference": "Petty & Cacioppo (1986)",
    "application_vi": "Quảng cáo xe hơi dùng thông số kỹ thuật (central route), trong khi quảng cáo nước hoa dùng hình ảnh người nổi tiếng (peripheral route).",
    "definition_long": "Mô hình Khả năng Xử lý Chi tiết (ELM) là một lý thuyết về sự thuyết phục, cho rằng có hai con đường chính để thay đổi thái độ: con đường trung tâm và con đường ngoại vi. Lựa chọn con đường nào phụ thuộc vào động lực và khả năng xử lý thông tin của người nhận.",
    "constructs_detailed": [
        { "name": "Central Route (Con đường trung tâm)", "desc": "Xảy ra khi người nhận có động lực và khả năng suy nghĩ cẩn thận về nội dung thông điệp. Thái độ hình thành qua con đường này thường bền vững và có khả năng dự báo hành vi tốt hơn." },
        { "name": "Peripheral Route (Con đường ngoại vi)", "desc": "Xảy ra khi người nhận không có động lực hoặc khả năng xử lý thông tin. Họ bị ảnh hưởng bởi các tín hiệu bề ngoài như sự hấp dẫn của người nói, âm nhạc, hoặc số lượng các lập luận." },
        { "name": "Argument Quality (Chất lượng lập luận)", "desc": "Yếu tố quan trọng trong con đường trung tâm." },
        { "name": "Source Credibility (Uy tín nguồn tin)", "desc": "Một tín hiệu ngoại vi quan trọng." }
    ],
    "sample_scales": [
        "Tôi đã suy nghĩ rất kỹ về các lập luận trong thông điệp quảng cáo này.",
        "Tôi bị thuyết phục bởi vì người đại diện cho thương hiệu này rất đáng tin cậy."
    ],
    "related_theories": ["Signaling Theory"],
    "limitations": "Mô hình này không phải lúc nào cũng phân biệt rõ ràng giữa hai con đường; một yếu tố có thể hoạt động như một tín hiệu ngoại vi trong một tình huống nhưng lại là một lập luận trong tình huống khác."
  },
  {
    "id": 23,
    "theory": "Cognitive Dissonance Theory",
    "constructs_full": "Dissonance Level; Attitude Change; Justification",
    "constructs_code": "DIS; AC; JUST",
    "note_vi": "Xung đột nhận thức dẫn tới thay đổi thái độ/hành vi.",
    "group": "Hành vi",
    "domain": "Consumer Psychology",
    "dependent_variable": "Post-purchase Satisfaction (PPS)",
    "reference": "Festinger (1957)",
    "application_vi": "Sau khi mua một chiếc điện thoại đắt tiền, khách hàng thường tìm đọc các bài đánh giá tích cực để tự trấn an rằng quyết định của mình là đúng đắn.",
    "definition_long": "Lý thuyết Bất hòa Nhận thức cho rằng con người có xu hướng tìm kiếm sự nhất quán giữa các niềm tin và hành vi của mình. Khi có sự mâu thuẫn (bất hòa), một trạng thái căng thẳng tâm lý khó chịu sẽ xảy ra, thúc đẩy cá nhân thay đổi thái độ hoặc hành vi để giảm bớt sự bất hòa đó.",
    "constructs_detailed": [
        { "name": "Dissonance Level (Mức độ bất hòa)", "desc": "Cường độ của sự khó chịu tâm lý, phụ thuộc vào tầm quan trọng của các yếu tố mâu thuẫn." },
        { "name": "Attitude Change (Thay đổi thái độ)", "desc": "Một cách để giảm bớt sự bất hòa bằng cách thay đổi niềm tin để phù hợp với hành vi." },
        { "name": "Justification (Biện minh)", "desc": "Tìm kiếm lý do hoặc thông tin mới để biện minh cho hành vi, làm giảm sự mâu thuẫn." }
    ],
    "sample_scales": [
        "Sau khi mua sản phẩm này, tôi cảm thấy hơi lo lắng về quyết định của mình.",
        "Tôi đã tích cực tìm kiếm thông tin xác nhận rằng mình đã lựa chọn đúng."
    ],
    "related_theories": ["Attribution Theory"],
    "limitations": "Mức độ bất hòa và cách giải quyết nó rất khác nhau ở mỗi cá nhân và khó đo lường một cách khách quan."
  },
  {
    "id": 24,
    "theory": "Attribution Theory",
    "constructs_full": "Locus; Stability; Controllability",
    "constructs_code": "LOC; STAB; CON",
    "note_vi": "Cách người tiêu dùng gán nguyên nhân cho sự kiện ảnh hưởng phản ứng.",
    "group": "Psychology",
    "domain": "Consumer Behavior",
    "dependent_variable": "Complaint Behavior (CB)",
    "reference": "Heider (1958)",
    "application_vi": "Khi sản phẩm bị lỗi, khách hàng sẽ ít tức giận hơn nếu họ tin rằng đó là sự cố ngẫu nhiên (không ổn định) thay vì do sự cẩu thả của công ty (có thể kiểm soát).",
    "definition_long": "Lý thuyết Quy kết giải thích cách mọi người gán nguyên nhân cho các sự kiện và hành vi (của bản thân và của người khác). Các quy kết này ảnh hưởng đến cảm xúc, động lực và hành vi trong tương lai của họ. Ví dụ, việc quy kết một thất bại sản phẩm là do lỗi của công ty hay do lỗi của người dùng sẽ dẫn đến những phản ứng rất khác nhau.",
    "constructs_detailed": [
        { "name": "Locus (Vị trí nguyên nhân)", "desc": "Nguyên nhân là do yếu tố bên trong (internal) cá nhân hay bên ngoài (external) môi trường?" },
        { "name": "Stability (Tính ổn định)", "desc": "Nguyên nhân có ổn định theo thời gian hay chỉ là tạm thời?" },
        { "name": "Controllability (Tính kiểm soát)", "desc": "Nguyên nhân có nằm trong tầm kiểm soát của ai đó hay không?" }
    ],
    "sample_scales": [
        "Tôi nghĩ rằng sự cố này xảy ra là do lỗi của công ty.",
        "Tôi tin rằng sự cố này có thể sẽ không xảy ra lần nữa.",
        "Công ty hoàn toàn có thể ngăn chặn sự cố này xảy ra."
    ],
    "related_theories": ["Cognitive Dissonance Theory"],
    "limitations": "Lý thuyết này giả định một quá trình suy luận logic, nhưng trong thực tế, các quy kết thường bị ảnh hưởng bởi các thiên kiến nhận thức (cognitive biases)."
  },
  {
    "id": 25,
    "theory": "Social Identity Theory",
    "constructs_full": "Group Identification; In-group Favoritism; Out-group Bias",
    "constructs_code": "GI; IGF; OGB",
    "note_vi": "Nhận dạng nhóm ảnh hưởng tới sự ủng hộ thương hiệu.",
    "group": "Xã hội",
    "domain": "Brand Community, Marketing",
    "dependent_variable": "Brand Loyalty (BL)",
    "reference": "Tajfel & Turner (1979)",
    "application_vi": "Các 'fan' của Apple thường cảm thấy gắn kết với nhau và có xu hướng đánh giá các thương hiệu khác (như Samsung) một cách tiêu cực hơn.",
    "definition_long": "Lý thuyết Bản sắc Xã hội cho rằng một phần quan trọng trong khái niệm bản thân của một người đến từ việc họ là thành viên của các nhóm xã hội. Con người có xu hướng phân loại mình và người khác vào các nhóm (ví dụ: fan club, dân tộc, nghề nghiệp), thiên vị nhóm của mình (in-group) và phân biệt đối xử với các nhóm khác (out-group) để nâng cao lòng tự trọng.",
    "constructs_detailed": [
        { "name": "Group Identification (Nhận dạng nhóm)", "desc": "Mức độ một cá nhân cảm thấy mình thuộc về và có ý nghĩa tâm lý với một nhóm." },
        { "name": "In-group Favoritism (Thiên vị nhóm nội bộ)", "desc": "Xu hướng đánh giá và đối xử với các thành viên trong nhóm của mình một cách tích cực hơn so với các thành viên nhóm khác." },
        { "name": "Out-group Bias (Thành kiến nhóm bên ngoài)", "desc": "Xu hướng có thái độ và hành vi tiêu cực đối với các thành viên của nhóm khác." }
    ],
    "sample_scales": [
        "Tôi cảm thấy mình là một phần của cộng đồng những người yêu thích thương hiệu X.",
        "Tôi tự hào khi nói với người khác rằng tôi sử dụng thương hiệu X."
    ],
    "related_theories": ["Brand Community Model"],
    "limitations": "Lý thuyết này có thể không giải thích đầy đủ sự phức tạp của các mối quan hệ liên nhóm, đặc biệt khi các cá nhân có nhiều bản sắc xã hội khác nhau."
  },
  {
    "id": 26,
    "theory": "Social Cognitive Theory",
    "constructs_full": "Self-efficacy; Observational Learning; Outcome Expectations",
    "constructs_code": "SE; OL; OE",
    "note_vi": "Học tập xã hội & vai trò tự hiệu quả trong thay đổi hành vi.",
    "group": "Hành vi",
    "domain": "Consumer Learning",
    "dependent_variable": "Behavior Change (BC)",
    "reference": "Bandura (1986)",
    "application_vi": "Một người xem video hướng dẫn (học tập quan sát) và tin rằng mình có thể nấu được một món ăn ngon (tự hiệu quả) sẽ có khả năng mua nguyên liệu để thử.",
    "definition_long": "Lý thuyết Nhận thức Xã hội cho rằng việc học tập xảy ra trong một bối cảnh xã hội với sự tương tác năng động và qua lại giữa con người, môi trường và hành vi. Lý thuyết nhấn mạnh vai trò của học tập qua quan sát (observational learning) và tự hiệu quả (self-efficacy) trong việc định hình hành vi.",
    "constructs_detailed": [
      { "name": "Self-efficacy (Tự hiệu quả)", "desc": "Niềm tin của một cá nhân vào khả năng của chính mình để thực hiện thành công một hành vi cụ thể." },
      { "name": "Observational Learning (Học tập qua quan sát)", "desc": "Quá trình học hỏi bằng cách quan sát hành vi của người khác và kết quả của những hành vi đó." },
      { "name": "Outcome Expectations (Kỳ vọng kết quả)", "desc": "Niềm tin của một người về những kết quả có thể xảy ra từ việc thực hiện một hành vi." }
    ],
    "sample_scales": [
      "Tôi tự tin rằng mình có thể sử dụng thành thạo sản phẩm này.",
      "Tôi tin rằng việc sử dụng sản phẩm này sẽ mang lại cho tôi kết quả tốt."
    ],
    "related_theories": ["Social Learning Theory"],
    "limitations": "Lý thuyết này khá rộng và phức tạp, đôi khi khó để vận hành và đo lường tất cả các khái niệm của nó trong một nghiên cứu duy nhất."
  },
  {
    "id": 27,
    "theory": "Self-Determination Theory (SDT)",
    "constructs_full": "Autonomy; Competence; Relatedness; Intrinsic Motivation",
    "constructs_code": "AUT; COM; REL; IM",
    "note_vi": "Động lực nội tại/ngoại tại ảnh hưởng đến hành vi và trải nghiệm.",
    "group": "Động lực",
    "domain": "HR, Consumer Behavior",
    "dependent_variable": "Intrinsic Motivation (IM)",
    "reference": "Deci & Ryan (1985)",
    "application_vi": "Nhân viên được trao quyền tự quyết định cách thực hiện công việc (tự chủ) sẽ có động lực nội tại cao hơn.",
    "definition_long": "Lý thuyết Tự quyết là một lý thuyết vĩ mô về động lực và nhân cách con người. SDT cho rằng con người có ba nhu cầu tâm lý cơ bản bẩm sinh: Tự chủ (Autonomy), Năng lực (Competence), và Quan hệ (Relatedness). Môi trường xã hội hỗ trợ các nhu cầu này sẽ thúc đẩy động lực nội tại, sự phát triển và hạnh phúc.",
    "constructs_detailed": [
      { "name": "Autonomy (Tự chủ)", "desc": "Nhu cầu cảm thấy mình là người khởi xướng và kiểm soát hành động của chính mình." },
      { "name": "Competence (Năng lực)", "desc": "Nhu cầu cảm thấy mình có khả năng và hiệu quả trong việc tương tác với môi trường." },
      { "name": "Relatedness (Quan hệ)", "desc": "Nhu cầu cảm thấy được kết nối, quan tâm và thuộc về những người khác." },
      { "name": "Intrinsic Motivation (Động lực nội tại)", "desc": "Thực hiện một hoạt động vì sự hứng thú và hài lòng vốn có của nó, chứ không phải vì một kết quả bên ngoài." }
    ],
    "sample_scales": [
      "Tôi cảm thấy có quyền tự do lựa chọn cách thực hiện công việc của mình.",
      "Tôi cảm thấy mình rất có năng lực trong các hoạt động của mình."
    ],
    "related_theories": ["Herzberg Two-Factor Theory"],
    "limitations": "Lý thuyết này nhấn mạnh các nhu cầu phổ quát, nhưng tầm quan trọng tương đối của mỗi nhu cầu có thể khác nhau giữa các nền văn hóa."
  },
  {
    "id": 28,
    "theory": "CRM Framework",
    "constructs_full": "Customer Satisfaction; Trust; Commitment; Switching Costs",
    "constructs_code": "CS; TR; COM; SC",
    "note_vi": "Quản trị quan hệ khách hàng để tối ưu giá trị trọn đời.",
    "group": "Quan hệ khách hàng",
    "domain": "Marketing, Sales",
    "dependent_variable": "Customer Lifetime Value (CLV)",
    "reference": "CRM literature",
    "application_vi": "Các công ty viễn thông tạo ra các rào cản chuyển đổi (chi phí cao, thủ tục phức tạp) để giữ chân khách hàng.",
    "definition_long": "Quản trị Quan hệ Khách hàng (CRM) là một phương pháp tiếp cận chiến lược để quản lý tương tác của công ty với khách hàng hiện tại và tiềm năng. Khung CRM tập trung vào việc sử dụng dữ liệu để hiểu nhu cầu của khách hàng, từ đó xây dựng lòng trung thành, tăng sự hài lòng và tối đa hóa giá trị vòng đời của khách hàng.",
    "constructs_detailed": [
      { "name": "Customer Satisfaction (Sự hài lòng của khách hàng)", "desc": "Đánh giá của khách hàng về mức độ sản phẩm/dịch vụ đáp ứng kỳ vọng của họ." },
      { "name": "Trust (Niềm tin)", "desc": "Sự tin tưởng của khách hàng vào khả năng và sự chính trực của công ty." },
      { "name": "Commitment (Cam kết)", "desc": "Mong muốn của khách hàng trong việc duy trì mối quan hệ lâu dài với công ty." },
      { "name": "Switching Costs (Chi phí chuyển đổi)", "desc": "Các chi phí (tài chính, thời gian, tâm lý) mà khách hàng phải chịu khi chuyển sang một nhà cung cấp khác." }
    ],
    "sample_scales": [
      "Nhìn chung, tôi rất hài lòng với công ty này.",
      "Tôi tin tưởng vào những gì công ty này cung cấp.",
      "Việc chuyển sang một nhà cung cấp khác sẽ rất phiền phức cho tôi."
    ],
    "related_theories": ["Relationship Marketing", "Customer Lifetime Value (CLV)"],
    "limitations": "Việc triển khai CRM thành công đòi hỏi sự thay đổi lớn về văn hóa và quy trình trong toàn tổ chức, không chỉ đơn thuần là mua một phần mềm."
  },
  {
    "id": 29,
    "theory": "Service-Profit Chain",
    "constructs_full": "Internal Service Quality; Employee Satisfaction; Customer Satisfaction; Profitability",
    "constructs_code": "ISQ; ES; CS; PF",
    "note_vi": "Chuỗi logic từ chất lượng nội bộ tới lợi nhuận.",
    "group": "Dịch vụ",
    "domain": "Service Management",
    "dependent_variable": "Profitability (PF)",
    "reference": "Heskett et al. (1994)",
    "application_vi": "Chuỗi cà phê đầu tư vào đào tạo và phúc lợi cho nhân viên (chất lượng nội bộ), nhân viên vui vẻ phục vụ tốt hơn, làm khách hàng hài lòng và quay lại.",
    "definition_long": "Chuỗi Dịch vụ-Lợi nhuận thiết lập một mối quan hệ nhân quả trực tiếp giữa lợi nhuận, sự tăng trưởng, lòng trung thành của khách hàng, sự hài lòng của khách hàng, giá trị của dịch vụ, và sự hài lòng, lòng trung thành và năng suất của nhân viên. Lý thuyết này cho rằng lợi nhuận và tăng trưởng được kích thích chủ yếu bởi lòng trung thành của khách hàng, và lòng trung thành là kết quả trực tiếp của sự hài lòng của khách hàng.",
    "constructs_detailed": [
      { "name": "Internal Service Quality (Chất lượng dịch vụ nội bộ)", "desc": "Môi trường làm việc, công cụ, và sự hỗ trợ mà nhân viên nhận được." },
      { "name": "Employee Satisfaction (Sự hài lòng của nhân viên)", "desc": "Cảm nhận tích cực của nhân viên về công việc và công ty." },
      { "name": "Customer Satisfaction (Sự hài lòng của khách hàng)", "desc": "Cảm nhận tích cực của khách hàng về dịch vụ nhận được." }
    ],
    "sample_scales": [
      "Công ty cung cấp cho tôi đủ công cụ và nguồn lực để làm tốt công việc.",
      "Nhìn chung, tôi hài lòng khi làm việc tại đây.",
      "Nhìn chung, tôi hài lòng với dịch vụ của công ty này."
    ],
    "related_theories": ["SERVQUAL", "Employee Engagement Model"],
    "limitations": "Mối quan hệ nhân quả có thể không phải lúc nào cũng mạnh mẽ và đơn chiều như mô hình đề xuất. Các yếu tố bên ngoài (ví dụ: cạnh tranh, kinh tế) cũng có ảnh hưởng lớn đến lợi nhuận."
  },
  {
    "id": 30,
    "theory": "Kano Model",
    "constructs_full": "Basic Needs; Performance Needs; Excitement Needs",
    "constructs_code": "BN; PN; EN",
    "note_vi": "Phân loại tính năng theo ảnh hưởng tới hài lòng.",
    "group": "Sản phẩm",
    "domain": "Product Management",
    "dependent_variable": "Customer Satisfaction (CS)",
    "reference": "Kano (1984)",
    "application_vi": "Với một khách sạn, wifi miễn phí là nhu cầu cơ bản, tốc độ wifi nhanh là nhu cầu hiệu suất, nhưng một món quà chào mừng bất ngờ là nhu cầu phấn khích.",
    "definition_long": "Mô hình Kano là một lý thuyết về phát triển sản phẩm và sự hài lòng của khách hàng. Nó phân loại các thuộc tính của sản phẩm/dịch vụ thành năm loại dựa trên cách chúng ảnh hưởng đến sự hài lòng của khách hàng. Ba loại chính là Nhu cầu cơ bản, Nhu cầu hiệu suất và Nhu cầu phấn khích.",
    "constructs_detailed": [
      { "name": "Basic Needs (Nhu cầu cơ bản / Must-be)", "desc": "Các thuộc tính mà khách hàng mặc định phải có. Nếu thiếu, họ sẽ rất không hài lòng, nhưng nếu có, họ cũng không cảm thấy hài lòng hơn." },
      { "name": "Performance Needs (Nhu cầu hiệu suất / One-dimensional)", "desc": "Các thuộc tính mà sự hài lòng của khách hàng tỷ lệ thuận với mức độ đáp ứng. Càng tốt thì càng hài lòng." },
      { "name": "Excitement Needs (Nhu cầu phấn khích / Attractive)", "desc": "Các thuộc tính bất ngờ, thú vị. Nếu thiếu, khách hàng không bận tâm, nhưng nếu có, họ sẽ rất hài lòng và thích thú." }
    ],
    "sample_scales": [ "Mô hình Kano sử dụng một cặp câu hỏi chức năng/phi chức năng đặc biệt để phân loại, ví dụ: 'Bạn cảm thấy thế nào nếu xe có camera lùi?' và 'Bạn cảm thấy thế nào nếu xe KHÔNG có camera lùi?'" ],
    "related_theories": ["Herzberg Two-Factor Theory"],
    "limitations": "Các thuộc tính có thể thay đổi loại theo thời gian. Một tính năng 'phấn khích' hôm nay có thể trở thành 'cơ bản' vào ngày mai (ví dụ: camera trên điện thoại)."
  },
  {
    "id": 31,
    "theory": "Net Promoter Score (NPS)",
    "constructs_full": "Likelihood to Recommend; Promoter/Detractor",
    "constructs_code": "LTR; PROM; DET",
    "note_vi": "Đo lường khả năng khách hàng giới thiệu.",
    "group": "Customer",
    "domain": "Marketing, CX",
    "dependent_variable": "Advocacy (ADV)",
    "reference": "Reichheld (2003)",
    "application_vi": "Các công ty công nghệ thường gửi khảo sát 'Bạn có sẵn lòng giới thiệu sản phẩm của chúng tôi cho bạn bè không?' để đo lường lòng trung thành.",
    "definition_long": "Net Promoter Score (NPS) là một chỉ số đo lường lòng trung thành của khách hàng. Nó được tính toán dựa trên câu trả lời cho một câu hỏi duy nhất: 'Trên thang điểm từ 0 đến 10, khả năng bạn giới thiệu công ty/sản phẩm/dịch vụ này cho bạn bè hoặc đồng nghiệp là bao nhiêu?'. NPS = % Người ủng hộ (Promoters) - % Người gièm pha (Detractors).",
    "constructs_detailed": [
      { "name": "Promoters (Người ủng hộ)", "desc": "Khách hàng trả lời 9 hoặc 10. Họ là những khách hàng trung thành và nhiệt tình." },
      { "name": "Passives (Người thụ động)", "desc": "Khách hàng trả lời 7 hoặc 8. Họ hài lòng nhưng không nhiệt tình và có thể chuyển sang đối thủ." },
      { "name": "Detractors (Người gièm pha)", "desc": "Khách hàng trả lời từ 0 đến 6. Họ là những khách hàng không hài lòng và có thể làm tổn hại đến thương hiệu." }
    ],
    "sample_scales": [ "Trên thang điểm từ 0 đến 10, khả năng bạn giới thiệu công ty X cho bạn bè là bao nhiêu?" ],
    "related_theories": ["Customer Loyalty"],
    "limitations": "NPS bị chỉ trích vì quá đơn giản và không cho biết 'tại sao' khách hàng lại cho điểm như vậy. Nó nên được sử dụng kết hợp với các câu hỏi mở để có được cái nhìn sâu sắc hơn."
  },
  {
    "id": 32,
    "theory": "Price-Quality Inference",
    "constructs_full": "Price; Perceived Quality; Willingness to Pay",
    "constructs_code": "PR; PQ; WTP",
    "note_vi": "Người tiêu dùng suy luận chất lượng từ giá cả.",
    "group": "Tiêu dùng",
    "domain": "Pricing, Branding",
    "dependent_variable": "Purchase Intention (PI)",
    "reference": "Marketing literature",
    "application_vi": "Người tiêu dùng thường cho rằng rượu vang đắt tiền hơn thì sẽ ngon hơn, ngay cả khi không có nhiều khác biệt trong một bài kiểm tra mù.",
    "definition_long": "Suy luận Giá cả-Chất lượng là một lối tắt nhận thức (heuristic) mà người tiêu dùng sử dụng để đánh giá chất lượng của một sản phẩm khi họ thiếu thông tin hoặc chuyên môn. Trong những trường hợp này, giá cả thường được dùng như một tín hiệu bên ngoài để suy ra chất lượng bên trong của sản phẩm.",
    "constructs_detailed": [
        { "name": "Price (Giá cả)", "desc": "Mức giá của sản phẩm, đóng vai trò là một tín hiệu." },
        { "name": "Perceived Quality (Chất lượng cảm nhận)", "desc": "Đánh giá chủ quan của người tiêu dùng về chất lượng của sản phẩm." }
    ],
    "sample_scales": [
        "Tôi tin rằng các sản phẩm đắt tiền hơn thường có chất lượng tốt hơn.",
        "Giá cao của thương hiệu này làm tôi tin rằng nó là một sản phẩm cao cấp."
    ],
    "related_theories": ["Signaling Theory", "Psychological Pricing"],
    "limitations": "Mối quan hệ này không phải lúc nào cũng đúng và có thể bị ảnh hưởng bởi các yếu tố khác như thương hiệu, quốc gia xuất xứ, và kinh nghiệm cá nhân của người tiêu dùng."
  },
  {
    "id": 33,
    "theory": "Perceived Risk Theory",
    "constructs_full": "Performance Risk; Financial Risk; Social Risk; Psychological Risk",
    "constructs_code": "PRF; FR; SR; PSR",
    "note_vi": "Các loại rủi ro ảnh hưởng quyết định mua.",
    "group": "Tiêu dùng",
    "domain": "Consumer Behavior",
    "dependent_variable": "Purchase Intention (PI)",
    "reference": "Bauer (1960)",
    "application_vi": "Chính sách 'hoàn tiền trong 30 ngày' của các trang thương mại điện tử giúp giảm thiểu rủi ro tài chính và hiệu suất cho người mua.",
    "definition_long": "Lý thuyết Rủi ro Cảm nhận cho rằng hành vi của người tiêu dùng liên quan đến rủi ro ở chỗ bất kỳ hành động nào của họ cũng có thể tạo ra những hậu quả mà họ không thể lường trước một cách chắc chắn, và một số trong số đó có thể không mong muốn. Người tiêu dùng có xu hướng phát triển các chiến lược để giảm thiểu rủi ro này.",
    "constructs_detailed": [
        { "name": "Performance Risk (Rủi ro hiệu suất)", "desc": "Sản phẩm có hoạt động như mong đợi không?" },
        { "name": "Financial Risk (Rủi ro tài chính)", "desc": "Sản phẩm có đáng tiền không? Có bị mất tiền nếu nó không hoạt động không?" },
        { "name": "Social Risk (Rủi ro xã hội)", "desc": "Người khác sẽ nghĩ gì về quyết định mua hàng của mình?" },
        { "name": "Psychological Risk (Rủi ro tâm lý)", "desc": "Sản phẩm có phù hợp với hình ảnh bản thân không? Có cảm thấy tội lỗi sau khi mua không?" }
    ],
    "sample_scales": [
        "Tôi lo lắng rằng sản phẩm này sẽ không bền như quảng cáo.",
        "Tôi e rằng bạn bè sẽ chê cười nếu tôi mua sản phẩm này."
    ],
    "related_theories": ["Prospect Theory"],
    "limitations": "Mức độ và loại rủi ro cảm nhận được rất khác nhau tùy thuộc vào cá nhân, loại sản phẩm và tình huống mua hàng."
  },
  {
    "id": 34,
    "theory": "Expectation-Disconfirmation Model",
    "constructs_full": "Expectations; Perceived Performance; Disconfirmation; Satisfaction",
    "constructs_code": "EXP; PP; DIS; SAT",
    "note_vi": "Sự khác biệt giữa mong đợi và trải nghiệm quy định hài lòng.",
    "group": "Customer",
    "domain": "Service Marketing",
    "dependent_variable": "Satisfaction (SAT)",
    "reference": "Oliver (1980)",
    "application_vi": "Nếu một nhà hàng được quảng cáo quá mức (kỳ vọng cao) nhưng chất lượng món ăn chỉ ở mức trung bình (hiệu suất thấp), khách hàng sẽ rất thất vọng.",
    "definition_long": "Mô hình Kỳ vọng-Bất xác nhận giải thích sự hài lòng của khách hàng như một kết quả của việc so sánh giữa kỳ vọng trước khi mua và hiệu suất cảm nhận sau khi mua. Nếu hiệu suất vượt kỳ vọng (bất xác nhận tích cực), khách hàng sẽ hài lòng. Nếu hiệu suất kém hơn kỳ vọng (bất xác nhận tiêu cực), họ sẽ không hài lòng.",
    "constructs_detailed": [
        { "name": "Expectations (Kỳ vọng)", "desc": "Niềm tin của khách hàng về hiệu suất của sản phẩm/dịch vụ trước khi sử dụng." },
        { "name": "Perceived Performance (Hiệu suất cảm nhận)", "desc": "Cảm nhận của khách hàng về hiệu suất thực tế của sản phẩm/dịch vụ." },
        { "name": "Disconfirmation (Bất xác nhận)", "desc": "Sự khác biệt giữa hiệu suất cảm nhận và kỳ vọng." }
    ],
    "sample_scales": [
        "Trước khi sử dụng, tôi mong đợi sản phẩm này sẽ có chất lượng cao.",
        "Trải nghiệm của tôi với sản phẩm này tốt hơn mong đợi."
    ],
    "related_theories": ["Expectation Confirmation Theory (ECT)", "SERVQUAL"],
    "limitations": "Mô hình này không phải lúc nào cũng giải thích được sự hài lòng trong các tình huống mua hàng ít cân nhắc hoặc các yếu tố ảnh hưởng khác như cảm xúc và sự công bằng."
  },
  {
    "id": 35,
    "theory": "Switching Costs Theory",
    "constructs_full": "Switching Costs; Dependency; Perceived Benefit",
    "constructs_code": "SC; DEP; PB",
    "note_vi": "Rào cản chuyển đổi ảnh hưởng tới trung thành khách hàng.",
    "group": "Customer",
    "domain": "CRM, Marketing",
    "dependent_variable": "Retention (RET)",
    "reference": "Burnham et al. (2003)",
    "application_vi": "Người dùng ngần ngại chuyển từ hệ điều hành iOS sang Android vì chi phí chuyển đổi dữ liệu, học cách sử dụng và mua lại ứng dụng.",
    "definition_long": "Lý thuyết Chi phí Chuyển đổi cho rằng khách hàng có thể tiếp tục sử dụng một sản phẩm hoặc dịch vụ ngay cả khi họ không hoàn toàn hài lòng, bởi vì chi phí liên quan đến việc chuyển sang một nhà cung cấp khác là quá cao. Những chi phí này có thể là tài chính, thủ tục hoặc tâm lý.",
    "constructs_detailed": [
        { "name": "Procedural Switching Costs (Chi phí thủ tục)", "desc": "Nỗ lực, thời gian và sự không chắc chắn liên quan đến việc tìm kiếm, thiết lập và sử dụng một nhà cung cấp mới." },
        { "name": "Financial Switching Costs (Chi phí tài chính)", "desc": "Các chi phí bằng tiền có thể mất đi, chẳng hạn như mất điểm thưởng, phí phạt, hoặc chi phí cho thiết bị mới." },
        { "name": "Relational Switching Costs (Chi phí quan hệ)", "desc": "Các mất mát về tâm lý hoặc tình cảm do phá vỡ mối quan hệ và sự quen thuộc với nhà cung cấp hiện tại." }
    ],
    "sample_scales": [
        "Sẽ rất tốn thời gian và công sức nếu tôi chuyển sang nhà cung cấp khác.",
        "Tôi sẽ mất đi nhiều lợi ích nếu tôi ngừng sử dụng dịch vụ của công ty này."
    ],
    "related_theories": ["Relationship Marketing"],
    "limitations": "Chi phí chuyển đổi cao có thể tạo ra 'lòng trung thành giả tạo' (spurious loyalty) và khiến công ty tự mãn, không nỗ lực cải thiện chất lượng dịch vụ."
  },
  {
    "id": 36,
    "theory": "Relationship Marketing",
    "constructs_full": "Trust; Commitment; Communication; Satisfaction",
    "constructs_code": "TR; COM; COMU; SAT",
    "note_vi": "Xây dựng mối quan hệ bền vững với khách hàng.",
    "group": "Quan hệ",
    "domain": "Marketing",
    "dependent_variable": "Loyalty (LOY)",
    "reference": "Morgan & Hunt (1994)",
    "application_vi": "Một nhân viên ngân hàng cá nhân xây dựng mối quan hệ tin cậy với khách hàng VIP thông qua giao tiếp thường xuyên và tư vấn tận tâm.",
    "definition_long": "Tiếp thị Quan hệ là một triết lý marketing tập trung vào việc xây dựng mối quan hệ lâu dài và đôi bên cùng có lợi với khách hàng, thay vì chỉ tập trung vào các giao dịch riêng lẻ. Mục tiêu là tạo ra lòng trung thành của khách hàng bằng cách cung cấp giá trị vượt trội và xây dựng niềm tin, sự cam kết.",
    "constructs_detailed": [
        { "name": "Trust (Niềm tin)", "desc": "Yếu tố cốt lõi, là sự tin tưởng vào sự đáng tin cậy và chính trực của đối tác." },
        { "name": "Commitment (Cam kết)", "desc": "Mong muốn duy trì mối quan hệ và sẵn sàng nỗ lực vì nó." },
        { "name": "Communication (Giao tiếp)", "desc": "Việc chia sẻ thông tin kịp thời và có ý nghĩa giữa các bên." }
    ],
    "sample_scales": [
        "Thương hiệu này luôn trung thực trong các giao dịch với tôi.",
        "Mối quan hệ của tôi với thương hiệu này rất quan trọng đối với tôi."
    ],
    "related_theories": ["Social Exchange Theory", "CRM Framework"],
    "limitations": "Việc xây dựng mối quan hệ đòi hỏi đầu tư thời gian và nguồn lực đáng kể, và không phải tất cả khách hàng đều mong muốn có một mối quan hệ sâu sắc với mọi thương hiệu."
  },
  {
    "id": 37,
    "theory": "Market Orientation",
    "constructs_full": "Customer Orientation; Competitor Orientation; Interfunctional Coordination",
    "constructs_code": "CO; COMPO; IFC",
    "note_vi": "Định hướng thị trường giúp cải thiện hiệu quả doanh nghiệp.",
    "group": "Chiến lược",
    "domain": "Marketing Management",
    "dependent_variable": "Business Performance (BP)",
    "reference": "Kohli & Jaworski (1990)",
    "application_vi": "Một công ty công nghệ liên tục thu thập phản hồi khách hàng, theo dõi đối thủ và đảm bảo các phòng ban (R&D, marketing) phối hợp nhịp nhàng.",
    "definition_long": "Định hướng Thị trường là một triết lý kinh doanh trong đó công ty đặt khách hàng vào trung tâm của mọi quyết định. Nó bao gồm ba thành phần chính: thu thập thông tin về nhu cầu của khách hàng và khả năng của đối thủ cạnh tranh (định hướng khách hàng, định hướng đối thủ), phổ biến thông tin này trong toàn tổ chức, và phối hợp các bộ phận để tạo ra giá trị vượt trội cho khách hàng (phối hợp liên chức năng).",
    "constructs_detailed": [
        { "name": "Customer Orientation (Định hướng khách hàng)", "desc": "Sự hiểu biết về khách hàng mục tiêu để có thể tạo ra giá trị vượt trội cho họ một cách liên tục." },
        { "name": "Competitor Orientation (Định hướng đối thủ)", "desc": "Sự hiểu biết về điểm mạnh, điểm yếu và chiến lược ngắn hạn và dài hạn của đối thủ cạnh tranh chính." },
        { "name": "Interfunctional Coordination (Phối hợp liên chức năng)", "desc": "Các nguồn lực và quy trình của công ty được phối hợp để tạo ra giá trị cho khách hàng." }
    ],
    "sample_scales": [
        "Chúng tôi thường xuyên đo lường mức độ hài lòng của khách hàng.",
        "Chúng tôi nhanh chóng phản ứng với các hành động của đối thủ cạnh tranh.",
        "Tất cả các phòng ban của chúng tôi đều có ý thức chung về việc phục vụ khách hàng."
    ],
    "related_theories": ["Resource-Based View (RBV)"],
    "limitations": "Việc quá tập trung vào nhu cầu hiện tại của khách hàng có thể cản trở các đổi mới đột phá. Đôi khi, các công ty cần phải 'tạo ra' nhu cầu mới."
  },
  {
    "id": 38,
    "theory": "Balanced Scorecard",
    "constructs_full": "Financial; Customer; Internal Process; Learning & Growth",
    "constructs_code": "FIN; CUST; IP; LG",
    "note_vi": "Công cụ đo lường hiệu suất chiến lược toàn diện.",
    "group": "Performance",
    "domain": "Management",
    "dependent_variable": "Overall Performance (OP)",
    "reference": "Kaplan & Norton (1992)",
    "application_vi": "Doanh nghiệp không chỉ đo lường hiệu suất bằng doanh thu (Tài chính) mà còn bằng sự hài lòng của khách hàng, hiệu quả quy trình và năng lực nhân viên.",
    "definition_long": "Thẻ điểm Cân bằng là một hệ thống quản lý và đo lường hiệu suất chiến lược, giúp các công ty chuyển tầm nhìn và chiến lược thành hành động. Nó cung cấp một cái nhìn toàn diện về hiệu suất của tổ chức từ bốn khía cạnh: Tài chính, Khách hàng, Quy trình nội bộ, và Học hỏi & Phát triển.",
    "constructs_detailed": [
        { "name": "Financial (Tài chính)", "desc": "Các chỉ số tài chính truyền thống như doanh thu, lợi nhuận, ROI." },
        { "name": "Customer (Khách hàng)", "desc": "Các chỉ số liên quan đến khách hàng như sự hài lòng, lòng trung thành, thị phần." },
        { "name": "Internal Process (Quy trình nội bộ)", "desc": "Các chỉ số về hiệu quả hoạt động, chất lượng, và chu kỳ thời gian của các quy trình cốt lõi." },
        { "name": "Learning & Growth (Học hỏi & Phát triển)", "desc": "Các chỉ số về năng lực của nhân viên, văn hóa, và khả năng đổi mới." }
    ],
    "sample_scales": [ "Đây là một khung quản trị, các chỉ số (KPIs) được xác định cụ thể cho từng công ty chứ không dùng thang đo chung." ],
    "related_theories": ["KPI & Performance Management"],
    "limitations": "Việc triển khai Thẻ điểm Cân bằng có thể phức tạp và đòi hỏi sự cam kết mạnh mẽ từ ban lãnh đạo. Việc chọn sai các chỉ số đo lường có thể dẫn đến các hành vi không mong muốn."
  },
  {
    "id": 39,
    "theory": "Porter's Five Forces",
    "constructs_full": "Threat of New Entrants; Supplier Power; Buyer Power; Substitutes; Rivalry",
    "constructs_code": "TNE; SP; BP; SUB; RIV",
    "note_vi": "Phân tích cạnh tranh ngành theo 5 lực lượng.",
    "group": "Chiến lược",
    "domain": "Industry Analysis",
    "dependent_variable": "Industry Profitability (IP)",
    "reference": "Porter (1979)",
    "application_vi": "Một hãng hàng không mới phải phân tích rào cản gia nhập ngành, sức mạnh của các nhà cung cấp máy bay (Boeing, Airbus) và quyền lực của khách hàng.",
    "definition_long": "Mô hình Năm Lực lượng của Porter là một công cụ phân tích cấu trúc của một ngành và mức độ hấp dẫn (lợi nhuận) của nó. Bằng cách hiểu rõ năm lực lượng cạnh tranh này, các công ty có thể xác định điểm mạnh, điểm yếu của mình và định vị chiến lược để đạt được lợi thế cạnh tranh.",
    "constructs_detailed": [
        { "name": "Threat of New Entrants (Đe dọa từ đối thủ mới)", "desc": "Mức độ dễ dàng hay khó khăn cho một đối thủ mới gia nhập ngành." },
        { "name": "Bargaining Power of Buyers (Quyền lực thương lượng của người mua)", "desc": "Khả năng của khách hàng trong việc gây áp lực giảm giá." },
        { "name": "Bargaining Power of Suppliers (Quyền lực thương lượng của nhà cung cấp)", "desc": "Khả năng của nhà cung cấp trong việc tăng giá nguyên liệu đầu vào." },
        { "name": "Threat of Substitute Products or Services (Đe dọa từ sản phẩm thay thế)", "desc": "Sự tồn tại của các sản phẩm/dịch vụ khác có thể đáp ứng cùng một nhu cầu." },
        { "name": "Intensity of Rivalry (Cường độ cạnh tranh trong ngành)", "desc": "Mức độ cạnh tranh giữa các công ty hiện có trong ngành." }
    ],
    "sample_scales": [ "Đây là một khung phân tích chiến lược, không sử dụng thang đo định lượng." ],
    "related_theories": ["Porter's Generic Strategies", "Value Chain"],
    "limitations": "Mô hình này có xu hướng tĩnh và có thể không phản ánh đầy đủ động lực của các ngành công nghệ cao, nơi sự hợp tác và hệ sinh thái đóng vai trò quan trọng."
  },
  {
    "id": 40,
    "theory": "Value Chain",
    "constructs_full": "Primary Activities; Support Activities; Value Creation",
    "constructs_code": "PA; SA; VC",
    "note_vi": "Phân tích hoạt động tạo giá trị trong doanh nghiệp.",
    "group": "Chiến lược",
    "domain": "Operations, Strategy",
    "dependent_variable": "Competitive Advantage (CA)",
    "reference": "Porter (1985)",
    "application_vi": "Một nhà sản xuất đồ nội thất phân tích chuỗi giá trị từ khâu nhập gỗ, thiết kế, sản xuất, logistics đến marketing để tìm cách tối ưu chi phí.",
    "definition_long": "Chuỗi Giá trị là một công cụ phân tích giúp xác định các hoạt động trong một công ty nơi giá trị được tạo ra. Nó chia các hoạt động của công ty thành hai loại: hoạt động chính (primary activities) và hoạt động hỗ trợ (support activities). Bằng cách phân tích chuỗi giá trị, công ty có thể tìm ra các nguồn lực tạo lợi thế cạnh tranh, hoặc các điểm cần cải thiện để tăng hiệu quả.",
    "constructs_detailed": [
        { "name": "Primary Activities (Hoạt động chính)", "desc": "Các hoạt động liên quan trực tiếp đến việc tạo ra và cung cấp sản phẩm, bao gồm: hậu cần đầu vào, vận hành, hậu cần đầu ra, marketing & bán hàng, và dịch vụ." },
        { "name": "Support Activities (Hoạt động hỗ trợ)", "desc": "Các hoạt động hỗ trợ cho các hoạt động chính, bao gồm: cơ sở hạ tầng, quản lý nhân sự, phát triển công nghệ, và mua sắm." }
    ],
    "sample_scales": [ "Đây là một công cụ phân tích kinh doanh định tính." ],
    "related_theories": ["Porter's Five Forces"],
    "limitations": "Chuỗi giá trị truyền thống phù hợp hơn với các công ty sản xuất và có thể khó áp dụng cho các công ty dịch vụ hoặc các mô hình kinh doanh dựa trên nền tảng số."
  },
  {
    "id": 41,
    "theory": "Open Innovation",
    "constructs_full": "Inbound Knowledge; Outbound Knowledge; Collaboration Intensity",
    "constructs_code": "IK; OK; CI",
    "note_vi": "Chia sẻ tri thức với bên ngoài để tăng đổi mới.",
    "group": "Đổi mới",
    "domain": "Innovation Management",
    "dependent_variable": "Innovation Performance (IP)",
    "reference": "Chesbrough (2003)",
    "application_vi": "Công ty P&G hợp tác với các nhà phát minh bên ngoài để phát triển sản phẩm mới thay vì chỉ dựa vào đội ngũ R&D nội bộ.",
    "definition_long": "Đổi mới Mở là một mô hình đổi mới cho rằng các công ty nên sử dụng cả ý tưởng từ bên trong và bên ngoài để thúc đẩy công nghệ của mình. Nó đối lập với mô hình 'đổi mới đóng' truyền thống, nơi tất cả hoạt động R&D đều diễn ra trong nội bộ. Đổi mới mở bao gồm cả việc đưa tri thức bên ngoài vào (inbound) và đưa tri thức không sử dụng ra ngoài (outbound).",
    "constructs_detailed": [
        { "name": "Inbound Open Innovation (Đổi mới mở đầu vào)", "desc": "Tận dụng các nguồn tri thức và công nghệ từ bên ngoài, ví dụ: hợp tác với trường đại học, mua bằng sáng chế." },
        { "name": "Outbound Open Innovation (Đổi mới mở đầu ra)", "desc": "Thương mại hóa các ý tưởng và công nghệ không được sử dụng trong nội bộ, ví dụ: cấp phép công nghệ, tạo công ty con (spin-off)." }
    ],
    "sample_scales": [
        "Chúng tôi thường xuyên tìm kiếm các công nghệ mới từ các startup bên ngoài.",
        "Công ty chúng tôi có các chương trình hợp tác R&D với các trường đại học."
    ],
    "related_theories": ["Absorptive Capacity"],
    "limitations": "Đổi mới mở đòi hỏi sự thay đổi lớn về văn hóa tổ chức và có thể gây ra các vấn đề về bảo vệ sở hữu trí tuệ và quản lý các mối quan hệ phức tạp."
  },
  {
    "id": 42,
    "theory": "Absorptive Capacity",
    "constructs_full": "Acquisition; Assimilation; Transformation; Exploitation",
    "constructs_code": "ACQ; ASM; TRF; EXP",
    "note_vi": "Khả năng hấp thụ tri thức bên ngoài phục vụ đổi mới.",
    "group": "Organizational",
    "domain": "Knowledge Management",
    "dependent_variable": "Innovation Performance (IP)",
    "reference": "Cohen & Levinthal (1990)",
    "application_vi": "Một công ty dược phẩm có năng lực hấp thụ tốt có thể nhanh chóng học hỏi và áp dụng các kết quả nghiên cứu từ các trường đại học.",
    "definition_long": "Năng lực Hấp thụ là khả năng của một công ty trong việc nhận biết giá trị của thông tin mới từ bên ngoài, tiếp thu nó, và áp dụng nó vào các mục đích thương mại. Đây là một năng lực quan trọng để các công ty có thể đổi mới và duy trì lợi thế cạnh tranh, đặc biệt trong các ngành công nghệ cao.",
    "constructs_detailed": [
        { "name": "Acquisition (Tiếp thu)", "desc": "Khả năng xác định và thu nhận tri thức bên ngoài có giá trị." },
        { "name": "Assimilation (Đồng hóa)", "desc": "Khả năng phân tích, xử lý, diễn giải và hiểu thông tin đã thu nhận." },
        { "name": "Transformation (Chuyển đổi)", "desc": "Khả năng kết hợp tri thức mới với tri thức hiện có và phát triển các quy trình mới." },
        { "name": "Exploitation (Khai thác)", "desc": "Khả năng áp dụng tri thức đã chuyển đổi để tạo ra sản phẩm, dịch vụ mới hoặc cải tiến quy trình." }
    ],
    "sample_scales": [
        "Nhân viên của chúng tôi thường xuyên tham dự các hội thảo chuyên ngành để cập nhật kiến thức mới.",
        "Chúng tôi có các quy trình hiệu quả để tích hợp thông tin mới vào hoạt động hàng ngày."
    ],
    "related_theories": ["Knowledge-Based View (KBV)", "Open Innovation"],
    "limitations": "Việc đo lường năng lực hấp thụ là một thách thức, vì nó là một khái niệm đa chiều và phụ thuộc nhiều vào các yếu tố vô hình như văn hóa tổ chức."
  },
  {
    "id": 43,
    "theory": "Lead–Lag Models (Marketing Mix Effects)",
    "constructs_full": "Advertising Spend; Price; Promotion; Sales; Lag Effects",
    "constructs_code": "ADS; PR; PROM; SA; LE",
    "note_vi": "Mô hình phân tích tác động trễ của hoạt động marketing.",
    "group": "Marketing",
    "domain": "Marketing Analytics",
    "dependent_variable": "Sales Response (SR)",
    "reference": "Marketing analytics literature",
    "application_vi": "Nhà bán lẻ phân tích dữ liệu để xem một chiến dịch quảng cáo trên TV hôm nay sẽ ảnh hưởng đến doanh số trong bao nhiêu tuần tới.",
    "definition_long": "Mô hình Trễ-Dẫn là một nhóm các kỹ thuật phân tích chuỗi thời gian được sử dụng trong marketing để đo lường tác động của các hoạt động marketing (ví dụ: quảng cáo, khuyến mãi) lên doanh số. Các mô hình này xem xét đến hiệu ứng trễ (lag effect), tức là tác động của một hoạt động marketing không chỉ xảy ra ngay lập tức mà còn kéo dài trong một khoảng thời gian sau đó.",
    "constructs_detailed": [
        { "name": "Lag Effects (Hiệu ứng trễ)", "desc": "Tác động của một biến độc lập (quảng cáo) lên một biến phụ thuộc (doanh số) tại một thời điểm trong tương lai." }
    ],
    "sample_scales": [ "Đây là một kỹ thuật mô hình hóa dữ liệu, không sử dụng thang đo khảo sát." ],
    "related_theories": ["Return on Marketing Investment (ROMI)"],
    "limitations": "Các mô hình này đòi hỏi dữ liệu chuỗi thời gian dài và chất lượng. Chúng cũng có thể phức tạp và khó diễn giải, đồng thời khó tách bạch ảnh hưởng của các yếu tố marketing khác nhau xảy ra đồng thời."
  },
  {
    "id": 44,
    "theory": "Channel Conflict Theory",
    "constructs_full": "Conflict Level; Control; Coordination; Satisfaction",
    "constructs_code": "CL; CC; CO; CSAT",
    "note_vi": "Xung đột giữa kênh phân phối và cách phối hợp.",
    "group": "Distribution",
    "domain": "Channels Management",
    "dependent_variable": "Channel Performance (CP)",
    "reference": "Channels literature",
    "application_vi": "Một thương hiệu bán hàng trên website của mình với giá rẻ hơn các đại lý, gây ra xung đột với kênh phân phối truyền thống.",
    "definition_long": "Lý thuyết Xung đột Kênh phân tích các bất đồng xảy ra giữa các thành viên trong cùng một kênh phân phối. Xung đột có thể xảy ra theo chiều dọc (giữa nhà sản xuất và nhà bán lẻ) hoặc theo chiều ngang (giữa các nhà bán lẻ khác nhau). Quản lý xung đột kênh hiệu quả là rất quan trọng để đảm bảo hiệu suất của toàn bộ kênh.",
    "constructs_detailed": [
        { "name": "Conflict Level (Mức độ xung đột)", "desc": "Cường độ và tần suất của các bất đồng." },
        { "name": "Control/Power (Kiểm soát/Quyền lực)", "desc": "Khả năng của một thành viên kênh ảnh hưởng đến hành vi của thành viên khác." },
        { "name": "Coordination (Phối hợp)", "desc": "Các cơ chế được sử dụng để giải quyết xung đột và thống nhất mục tiêu." }
    ],
    "sample_scales": [
        "Chúng tôi thường xuyên có bất đồng với nhà cung cấp về chính sách giá.",
        "Nhà cung cấp có nhiều quyền lực trong việc quyết định các điều khoản hợp tác."
    ],
    "related_theories": ["Agency Theory"],
    "limitations": "Không phải tất cả xung đột đều có hại. Một mức độ xung đột chức năng (functional conflict) nhất định có thể thúc đẩy sự đổi mới và cải thiện hiệu suất kênh."
  },
  {
    "id": 45,
    "theory": "Omni-channel Retailing",
    "constructs_full": "Channel Integration; Customer Experience; Channel Usage",
    "constructs_code": "CI; CX; CU",
    "note_vi": "Tích hợp kênh nhằm trải nghiệm liền mạch cho khách hàng.",
    "group": "Bán lẻ",
    "domain": "Retail, E-commerce",
    "dependent_variable": "Sales (S)",
    "reference": "Retail literature",
    "application_vi": "Khách hàng có thể xem sản phẩm tại cửa hàng, đặt mua trên app, và chọn nhận hàng tại nhà, tạo ra một trải nghiệm mua sắm liền mạch.",
    "definition_long": "Bán lẻ Đa kênh (Omni-channel) là một phương pháp tiếp cận bán hàng đa kênh, tập trung vào việc cung cấp cho khách hàng một trải nghiệm mua sắm tích hợp và liền mạch, bất kể họ đang tương tác trên kênh nào (cửa hàng vật lý, website, ứng dụng di động, mạng xã hội). Mục tiêu là làm mờ ranh giới giữa các kênh.",
    "constructs_detailed": [
        { "name": "Channel Integration (Tích hợp kênh)", "desc": "Mức độ mà các kênh khác nhau của nhà bán lẻ được kết nối và hoạt động thống nhất (ví dụ: tồn kho, dữ liệu khách hàng)." },
        { "name": "Customer Experience (Trải nghiệm khách hàng)", "desc": "Cảm nhận tổng thể của khách hàng qua tất cả các điểm chạm với nhà bán lẻ." }
    ],
    "sample_scales": [
        "Tôi có thể dễ dàng trả lại một món hàng mua online tại cửa hàng vật lý của họ.",
        "Thông tin sản phẩm là nhất quán trên cả website và ứng dụng di động của họ."
    ],
    "related_theories": ["Customer Experience (CX) Framework"],
    "limitations": "Việc tích hợp kênh một cách thực sự liền mạch là một thách thức lớn về mặt công nghệ, logistics và tổ chức."
  },
  {
    "id": 46,
    "theory": "Brand Resonance Model",
    "constructs_full": "Brand Identity; Meaning; Response; Relationships",
    "constructs_code": "BI; BM; BR; BRL",
    "note_vi": "Cấp độ cộng hưởng giữa khách hàng và thương hiệu.",
    "group": "Thương hiệu",
    "domain": "Brand Management",
    "dependent_variable": "Brand Equity (BE)",
    "reference": "Keller (2001)",
    "application_vi": "Các câu lạc bộ xe Harley-Davidson là đỉnh cao của sự cộng hưởng thương hiệu, nơi khách hàng xây dựng mối quan hệ sâu sắc với thương hiệu và những người dùng khác.",
    "definition_long": "Mô hình Cộng hưởng Thương hiệu (còn gọi là Kim tự tháp Xây dựng Thương hiệu) mô tả một chuỗi các bước để xây dựng một thương hiệu mạnh. Nó cho rằng việc xây dựng thương hiệu là một quá trình đi lên, bắt đầu bằng việc đảm bảo khách hàng nhận biết thương hiệu (nhận diện) và kết thúc bằng việc tạo ra một mối quan hệ trung thành, tích cực và sâu sắc (cộng hưởng).",
    "constructs_detailed": [
        { "name": "Salience (Sự nổi bật/Nhận diện)", "desc": "Mức độ nhận biết của thương hiệu." },
        { "name": "Performance/Imagery (Hiệu suất/Hình ảnh)", "desc": "Ý nghĩa của thương hiệu là gì (chức năng và trừu tượng)." },
        { "name": "Judgements/Feelings (Đánh giá/Cảm xúc)", "desc": "Phản ứng của khách hàng đối với thương hiệu." },
        { "name": "Resonance (Cộng hưởng)", "desc": "Bản chất của mối quan hệ và mức độ đồng bộ của khách hàng với thương hiệu." }
    ],
    "sample_scales": [
        "Tôi cảm thấy có một mối liên kết sâu sắc với những người cũng sử dụng thương hiệu này.",
        "Tôi thực sự yêu thích thương hiệu này."
    ],
    "related_theories": ["Brand Equity (Keller)"],
    "limitations": "Mô hình này là một khung khái niệm, việc đạt đến đỉnh 'cộng hưởng' là một quá trình dài hạn và khó khăn đối với hầu hết các thương hiệu."
  },
  {
    "id": 47,
    "theory": "Attachment Theory (Brand)",
    "constructs_full": "Brand Attachment; Emotional Bond; Self-Brand Connection",
    "constructs_code": "BA; EB; SBC",
    "note_vi": "Mối gắn kết cảm xúc giữa người dùng và thương hiệu.",
    "group": "Cảm xúc",
    "domain": "Branding",
    "dependent_variable": "Loyalty (LOY)",
    "reference": "Attachment literature",
    "application_vi": "Người tiêu dùng cảm thấy gắn kết tình cảm với thương hiệu thời thơ ấu và sẵn sàng trả giá cao hơn cho các sản phẩm đó.",
    "definition_long": "Lý thuyết Gắn kết, có nguồn gốc từ tâm lý học phát triển, được áp dụng trong marketing để giải thích mối quan hệ tình cảm mạnh mẽ giữa người tiêu dùng và thương hiệu. Gắn kết thương hiệu được định nghĩa là một mối liên kết tâm lý bền vững, đặc trưng bởi sự kết nối tình cảm và sự gần gũi.",
    "constructs_detailed": [
        { "name": "Emotional Bond (Liên kết tình cảm)", "desc": "Cảm giác ấm áp, trìu mến và yêu thích đối với thương hiệu." },
        { "name": "Self-Brand Connection (Kết nối bản thân-thương hiệu)", "desc": "Mức độ mà thương hiệu được sử dụng để thể hiện hoặc tạo ra bản sắc cá nhân của người tiêu dùng." }
    ],
    "sample_scales": [
        "Thương hiệu này có một ý nghĩa đặc biệt đối với tôi.",
        "Tôi cảm thấy có một mối liên kết tình cảm mạnh mẽ với thương hiệu này."
    ],
    "related_theories": ["Brand Resonance Model", "Self-Congruity Theory"],
    "limitations": "Sự gắn kết mạnh mẽ không phải lúc nào cũng dẫn đến hành vi mua hàng, mặc dù nó thường liên quan đến các kết quả tích cực khác như truyền miệng và sự tha thứ khi có lỗi."
  },
  {
    "id": 48,
    "theory": "Psychological Ownership",
    "constructs_full": "Sense of Ownership; Stewardship; Proactive Behavior",
    "constructs_code": "SO; STW; PB",
    "note_vi": "Cảm giác sở hữu dẫn tới hành vi chăm sóc và trung thành.",
    "group": "Tâm lý",
    "domain": "Consumer Behavior, HR",
    "dependent_variable": "Loyalty (LOY)",
    "reference": "Pierce et al. (2001)",
    "application_vi": "Chương trình cho phép khách hàng tự thiết kế đôi giày Nike của mình làm tăng cảm giác sở hữu và sự gắn kết với sản phẩm.",
    "definition_long": "Sở hữu Tâm lý là cảm giác rằng một đối tượng (hữu hình hoặc vô hình) là 'của tôi'. Cảm giác này không dựa trên quyền sở hữu hợp pháp mà là một trạng thái tâm lý. Khi khách hàng cảm thấy sở hữu một thương hiệu hoặc sản phẩm, họ có nhiều khả năng sẽ chăm sóc, bảo vệ và ủng hộ nó.",
    "constructs_detailed": [
        { "name": "Sense of Ownership (Cảm giác sở hữu)", "desc": "Cảm giác rằng một thứ gì đó thuộc về mình." },
        { "name": "Stewardship (Hành vi quản lý)", "desc": "Cảm giác trách nhiệm và mong muốn chăm sóc cho đối tượng sở hữu." },
        { "name": "Proactive Behavior (Hành vi chủ động)", "desc": "Các hành vi tích cực như bảo vệ thương hiệu, truyền miệng." }
    ],
    "sample_scales": [
        "Tôi cảm thấy như thể đây là thương hiệu CỦA TÔI.",
        "Tôi cảm thấy có trách nhiệm với sự thành công của thương hiệu này."
    ],
    "related_theories": ["Attachment Theory (Brand)"],
    "limitations": "Cảm giác sở hữu quá mức có thể dẫn đến các hành vi tiêu cực, chẳng hạn như sự thù địch với những người dùng khác có ý kiến trái chiều."
  },
  {
    "id": 49,
    "theory": "Habit Formation",
    "constructs_full": "Habit Strength; Past Behavior Frequency; Automaticity",
    "constructs_code": "HS; PBF; AUTO",
    "note_vi": "Thói quen ảnh hưởng lớn đến hành vi mua lặp lại.",
    "group": "Hành vi",
    "domain": "Consumer Behavior",
    "dependent_variable": "Repeat Purchase (RP)",
    "reference": "Verplanken & Aarts (1999)",
    "application_vi": "Thói quen uống cà phê mỗi sáng tại một quán quen thuộc khiến khách hàng mua lặp lại một cách tự động mà không cần cân nhắc nhiều.",
    "definition_long": "Hình thành Thói quen là một quá trình mà các hành vi mới trở nên tự động. Trong marketing, thói quen là một yếu tố dự báo mạnh mẽ cho hành vi mua lặp lại. Các hành vi theo thói quen được kích hoạt bởi các tín hiệu trong bối cảnh và được thực hiện mà không cần nhiều suy nghĩ hay ý định có ý thức.",
    "constructs_detailed": [
        { "name": "Habit Strength (Độ mạnh của thói quen)", "desc": "Mức độ tự động của một hành vi." },
        { "name": "Past Behavior Frequency (Tần suất hành vi trong quá khứ)", "desc": "Số lần hành vi đã được thực hiện trước đây, là một yếu tố quan trọng để hình thành thói quen." },
        { "name": "Automaticity (Tính tự động)", "desc": "Hành vi được thực hiện mà không cần sự chú ý, nhận thức, hoặc ý định." }
    ],
    "sample_scales": [
        "Mua sản phẩm X là điều tôi làm một cách tự động.",
        "Tôi mua sản phẩm X mà không cần phải suy nghĩ về nó."
    ],
    "related_theories": ["Theory of Planned Behavior (TPB)"],
    "limitations": "Thói quen có thể bị phá vỡ bởi những thay đổi lớn trong bối cảnh (ví dụ: chuyển nhà, thay đổi công việc) hoặc bởi các nỗ lực có ý thức để thay đổi hành vi."
  },
  {
    "id": 50,
    "theory": "Nudge Theory",
    "constructs_full": "Choice Architecture; Default Options; Framing",
    "constructs_code": "CA; DO; FR",
    "note_vi": "Thiết kế lựa chọn để khuyến khích hành vi mong muốn.",
    "group": "Hành vi",
    "domain": "Behavioral Economics",
    "dependent_variable": "Behavior Change (BC)",
    "reference": "Thaler & Sunstein (2008)",
    "application_vi": "Các siêu thị đặt các sản phẩm lành mạnh ở vị trí ngang tầm mắt để 'thúc đẩy' người tiêu dùng lựa chọn chúng.",
    "definition_long": "Lý thuyết Cú hích cho rằng những sự can thiệp nhỏ và gián tiếp có thể ảnh hưởng đến hành vi của con người một cách có thể dự đoán được mà không cấm bất kỳ lựa chọn nào hoặc thay đổi đáng kể các ưu đãi kinh tế. Nó liên quan đến việc thiết kế 'kiến trúc lựa chọn' (choice architecture) để hướng mọi người đến những quyết định tốt hơn.",
    "constructs_detailed": [
        { "name": "Choice Architecture (Kiến trúc lựa chọn)", "desc": "Cách mà các lựa chọn được trình bày cho người ra quyết định." },
        { "name": "Default Options (Lựa chọn mặc định)", "desc": "Lựa chọn được chọn nếu người ra quyết định không làm gì. Con người có xu hướng mạnh mẽ gắn bó với lựa chọn mặc định." },
        { "name": "Framing (Đóng khung)", "desc": "Cách thông tin được trình bày (ví dụ: nhấn mạnh lợi ích hay mất mát) có thể ảnh hưởng đến lựa chọn." }
    ],
    "sample_scales": [ "Lý thuyết này được áp dụng và đo lường hiệu quả thông qua các thí nghiệm thực địa (A/B testing) chứ không phải khảo sát." ],
    "related_theories": ["Prospect Theory", "Framing Effect"],
    "limitations": "Việc sử dụng các cú hích gây ra các câu hỏi về đạo đức, vì nó có thể bị coi là sự thao túng và có thể bị lạm dụng để hướng mọi người đến những lựa chọn không có lợi cho họ."
  },
 {
    "id": 151,
    "theory": "Psychological Contract Theory",
    "constructs_full": "Transactional Contract; Relational Contract; Contract Breach; Violation",
    "constructs_code": "TC; RC; CB; CV",
    "note_vi": "Niềm tin và kỳ vọng không thành văn giữa nhân viên và tổ chức.",
    "group": "HR",
    "domain": "Organizational Behavior",
    "dependent_variable": "Turnover (TO)",
    "reference": "Rousseau (1995)",
    "application_vi": "Khi công ty không thực hiện những lời hứa ngầm (như cơ hội thăng tiến), hợp đồng tâm lý bị phá vỡ và nhân viên có thể sẽ tìm việc mới.",
    "definition_long": "Lý thuyết Hợp đồng Tâm lý đề cập đến những niềm tin và kỳ vọng không thành văn mà cả nhân viên và nhà tuyển dụng có về nghĩa vụ của họ đối với nhau. Nó khác với hợp đồng lao động chính thức. Khi một bên cảm thấy bên kia không thực hiện đúng nghĩa vụ của mình, một sự 'vi phạm' (breach) hợp đồng tâm lý sẽ xảy ra, dẫn đến các hậu quả tiêu cực.",
    "constructs_detailed": [
      { "name": "Transactional Contract (Hợp đồng giao dịch)", "desc": "Tập trung vào các trao đổi kinh tế cụ thể, ngắn hạn (ví dụ: làm việc để nhận lương)." },
      { "name": "Relational Contract (Hợp đồng quan hệ)", "desc": "Bao gồm các kỳ vọng rộng hơn, dài hạn và dựa trên sự tin tưởng và lòng trung thành." },
      { "name": "Contract Breach (Vi phạm hợp đồng)", "desc": "Nhận thức rằng tổ chức đã không thực hiện một hoặc nhiều nghĩa vụ." },
      { "name": "Violation (Sự xâm phạm)", "desc": "Phản ứng cảm xúc tiêu cực (ví dụ: tức giận, thất vọng) sau khi nhận thấy sự vi phạm." }
    ],
    "sample_scales": [
      "Tôi cảm thấy công ty của tôi đã không giữ lời hứa với tôi.",
      "Tôi đã rất thất vọng về cách công ty đối xử với tôi."
    ],
    "related_theories": ["Social Exchange Theory", "Organizational Justice"],
    "limitations": "Hợp đồng tâm lý là một khái niệm mang tính cá nhân và chủ quan cao. Hai nhân viên trong cùng một công ty có thể có những hợp đồng tâm lý rất khác nhau."
  },
  {
    "id": 152,
    "theory": "Organizational Citizenship Behavior (OCB)",
    "constructs_full": "Altruism; Courtesy; Sportsmanship; Conscientiousness; Civic Virtue",
    "constructs_code": "ALT; COU; SPO; CON; CIV",
    "note_vi": "Hành vi tự nguyện, ngoài vai trò chính thức, đóng góp cho tổ chức.",
    "group": "HR",
    "domain": "Organizational Behavior",
    "dependent_variable": "Team Performance (TP)",
    "reference": "Organ (1988)",
    "application_vi": "Những hành vi tự nguyện như giúp đỡ đồng nghiệp, không phàn nàn và tham gia các hoạt động của công ty góp phần tạo nên một môi trường làm việc tích cực.",
    "definition_long": "Hành vi Công dân Tổ chức (OCB) là các hành vi tự nguyện, không phải là một phần của các yêu cầu công việc chính thức, nhưng góp phần vào hiệu quả tâm lý và xã hội của tổ chức. Đây là những hành vi 'vượt lên trên và vượt ra ngoài' vai trò được giao.",
    "constructs_detailed": [
      { "name": "Altruism (Vị tha)", "desc": "Giúp đỡ đồng nghiệp một cách tự nguyện." },
      { "name": "Courtesy (Lịch sự)", "desc": "Các hành động giúp ngăn ngừa các vấn đề trong công việc, chẳng hạn như thông báo trước cho đồng nghiệp." },
      { "name": "Sportsmanship (Tinh thần thể thao)", "desc": "Sẵn sàng chấp nhận những sự bất tiện và áp đặt không thể tránh khỏi của công việc mà không phàn nàn." },
      { "name": "Conscientiousness (Sự tận tâm)", "desc": "Hành vi vượt qua các yêu cầu tối thiểu, chẳng hạn như đến sớm, ở lại muộn." },
      { "name": "Civic Virtue (Đức hạnh công dân)", "desc": "Tham gia tích cực vào đời sống chính trị của tổ chức, chẳng hạn như tham dự các cuộc họp không bắt buộc." }
    ],
    "sample_scales": [
      "Tôi sẵn sàng dành thời gian để giúp đỡ đồng nghiệp gặp khó khăn trong công việc.",
      "Tôi không phàn nàn về những vấn đề nhỏ nhặt tại nơi làm việc."
    ],
    "related_theories": ["Organizational Justice", "Leader-Member Exchange (LMX)"],
    "limitations": "Việc quá coi trọng OCB có thể tạo áp lực khiến nhân viên phải làm việc quá sức. Cũng có thể có sự thiên vị trong đánh giá khi các nhà quản lý ưu ái những người thể hiện nhiều OCB hơn."
  },
  {
    "id": 153,
    "theory": "Supply Chain Management (SCM) Framework",
    "constructs_full": "Integration; Information Sharing; Collaboration; Agility; Performance",
    "constructs_code": "INT; IS; COL; AGI; PERF",
    "note_vi": "Quản lý chuỗi cung ứng để tối ưu hóa hiệu quả và giá trị.",
    "group": "Operations",
    "domain": "Supply Chain",
    "dependent_variable": "Supply Chain Performance (SCP)",
    "reference": "SCM literature",
    "application_vi": "Các công ty như Zara tích hợp chặt chẽ việc chia sẻ thông tin giữa các cửa hàng, nhà thiết kế và nhà máy để phản ứng nhanh với các xu hướng thời trang.",
    "definition_long": "Quản trị Chuỗi cung ứng (SCM) là việc quản lý dòng chảy hàng hóa và dịch vụ, bao gồm tất cả các quy trình biến đổi nguyên liệu thô thành sản phẩm cuối cùng. Nó liên quan đến việc tích cực tinh giản các hoạt động phía cung của một doanh nghiệp để tối đa hóa giá trị cho khách hàng và đạt được lợi thế cạnh tranh bền vững.",
    "constructs_detailed": [
      { "name": "Integration (Tích hợp)", "desc": "Mức độ phối hợp chiến lược và hoạt động giữa các đối tác trong chuỗi cung ứng." },
      { "name": "Information Sharing (Chia sẻ thông tin)", "desc": "Mức độ thông tin quan trọng được chia sẻ một cách kịp thời và chính xác giữa các đối tác." },
      { "name": "Collaboration (Hợp tác)", "desc": "Mức độ các công ty làm việc cùng nhau để đạt được các mục tiêu chung." },
      { "name": "Agility (Sự linh hoạt)", "desc": "Khả năng của chuỗi cung ứng để phản ứng nhanh chóng với những thay đổi của thị trường." }
    ],
    "sample_scales": [
      "Chúng tôi và các nhà cung cấp chính của mình có các mục tiêu và chiến lược tương thích.",
      "Chúng tôi chia sẻ thông tin về dự báo và tồn kho với các đối tác một cách cởi mở."
    ],
    "related_theories": ["Bullwhip Effect", "Transaction Cost Economics (TCE)"],
    "limitations": "Việc xây dựng một chuỗi cung ứng tích hợp và hợp tác cao đòi hỏi sự tin tưởng lớn và đầu tư đáng kể vào công nghệ thông tin. Nó cũng có thể làm tăng sự phụ thuộc lẫn nhau giữa các công ty."
  },
  {
    "id": 154,
    "theory": "Bullwhip Effect",
    "constructs_full": "Demand Variability; Order Variability; Information Distortion; Lead Time",
    "constructs_code": "DV; OV; ID; LT",
    "note_vi": "Sự khuếch đại biến động đơn hàng khi di chuyển ngược dòng chuỗi cung ứng.",
    "group": "Operations",
    "domain": "Supply Chain",
    "dependent_variable": "Inventory Costs (IC)",
    "reference": "Lee et al. (1997)",
    "application_vi": "Một sự thay đổi nhỏ trong nhu cầu của người tiêu dùng có thể bị khuếch đại thành những biến động lớn về đơn đặt hàng ở các cấp cao hơn của chuỗi cung ứng.",
    "definition_long": "Hiệu ứng Roi da là một hiện tượng trong chuỗi cung ứng, trong đó các dự báo về nhu cầu tạo ra sự biến động ngày càng lớn hơn khi di chuyển ngược dòng từ khách hàng đến nhà sản xuất. Một sự thay đổi nhỏ trong nhu cầu của khách hàng cuối cùng có thể dẫn đến những thay đổi rất lớn trong đơn đặt hàng của nhà sản xuất, gây ra tình trạng tồn kho quá mức hoặc thiếu hụt.",
    "constructs_detailed": [
      { "name": "Demand Variability (Biến động nhu cầu)", "desc": "Sự thay đổi trong nhu cầu thực tế của khách hàng." },
      { "name": "Order Variability (Biến động đơn hàng)", "desc": "Sự thay đổi trong số lượng đơn đặt hàng của các thành viên trong chuỗi cung ứng." },
      { "name": "Information Distortion (Méo mó thông tin)", "desc": "Thông tin về nhu cầu bị thay đổi khi nó được truyền đi ngược dòng chuỗi cung ứng." },
      { "name": "Lead Time (Thời gian chờ)", "desc": "Thời gian từ lúc đặt hàng đến lúc nhận hàng. Thời gian chờ càng dài, hiệu ứng roi da càng lớn." }
    ],
    "sample_scales": [ "Hiện tượng này được đo lường và phân tích bằng dữ liệu hoạt động thực tế (nhu cầu, đơn hàng, tồn kho) chứ không phải qua khảo sát." ],
    "related_theories": ["Supply Chain Management (SCM) Framework"],
    "limitations": "Việc giảm thiểu hiệu ứng roi da đòi hỏi sự hợp tác và chia sẻ thông tin cao độ trong toàn bộ chuỗi cung ứng, điều này có thể khó đạt được."
  },
  {
    "id": 155,
    "theory": "Gartner Hype Cycle",
    "constructs_full": "Innovation Trigger; Peak of Inflated Expectations; Trough of Disillusionment; Slope of Enlightenment; Plateau of Productivity",
    "constructs_code": "IT; PIE; TOD; SOE; POP",
    "note_vi": "Mô hình vòng đời của sự cường điệu hóa công nghệ.",
    "group": "Công nghệ",
    "domain": "Technology Management",
    "dependent_variable": "Technology Adoption Strategy (TAS)",
    "reference": "Gartner",
    "application_vi": "Các công ty sử dụng mô hình này để đánh giá mức độ trưởng thành của các công nghệ mới (như AI, Blockchain) và quyết định thời điểm đầu tư phù hợp.",
    "definition_long": "Chu kỳ Cường điệu của Gartner là một biểu diễn đồ họa về nhận thức chung hoặc sự cường điệu của một công nghệ mới qua thời gian. Nó cung cấp một cái nhìn về cách một công nghệ sẽ phát triển từ khi ra đời đến khi được áp dụng rộng rãi và trở nên hữu ích.",
    "constructs_detailed": [
      { "name": "Innovation Trigger (Khởi đầu đổi mới)", "desc": "Một đột phá công nghệ tiềm năng khởi đầu mọi thứ. Sự quan tâm của giới truyền thông bắt đầu." },
      { "name": "Peak of Inflated Expectations (Đỉnh của kỳ vọng thổi phồng)", "desc": "Sự cường điệu ban đầu tạo ra một loạt các câu chuyện thành công - cùng với hàng loạt các thất bại. Một số công ty hành động; nhiều công ty thì không." },
      { "name": "Trough of Disillusionment (Vực của sự vỡ mộng)", "desc": "Sự quan tâm giảm đi khi các thử nghiệm và triển khai không mang lại kết quả. Các nhà sản xuất thất bại hoặc bị mua lại." },
      { "name": "Slope of Enlightenment (Dốc của sự khai sáng)", "desc": "Nhiều ví dụ hơn về cách công nghệ có thể mang lại lợi ích cho doanh nghiệp bắt đầu kết tinh và được hiểu rõ hơn." },
      { "name": "Plateau of Productivity (Bình nguyên của năng suất)", "desc": "Việc áp dụng chính thống bắt đầu tăng tốc. Các tiêu chí để đánh giá khả năng tồn tại của nhà cung cấp được xác định rõ ràng hơn." }
    ],
    "sample_scales": [ "Đây là một mô hình phân tích định tính do Gartner cung cấp, không dùng thang đo." ],
    "related_theories": ["Diffusion of Innovation"],
    "limitations": "Đây không phải là một mô hình khoa học chính xác mà là một công cụ chẩn đoán để hiểu nhận thức của công chúng về một công nghệ. Không phải tất cả các công nghệ đều đi theo chu kỳ này."
  },
  {
    "id": 156,
    "theory": "The Long Tail",
    "constructs_full": "Niche Products; Mainstream Products; Distribution Costs; Aggregators",
    "constructs_code": "NP; MP; DC; AGG",
    "note_vi": "Kinh doanh số lượng lớn các mặt hàng bán chậm có thể mang lại lợi nhuận.",
    "group": "Digital",
    "domain": "E-commerce, Media",
    "dependent_variable": "Sales Distribution (SD)",
    "reference": "Anderson (2004)",
    "application_vi": "Amazon kiếm được một phần doanh thu đáng kể từ việc bán một số lượng lớn các sản phẩm 'ngách' bán chậm, điều mà các cửa hàng vật lý không thể làm được.",
    "definition_long": "Lý thuyết Đuôi dài cho rằng trong thời đại kỹ thuật số, các doanh nghiệp có thể kiếm được lợi nhuận đáng kể bằng cách bán một số lượng nhỏ của rất nhiều mặt hàng khó tìm (các sản phẩm 'ngách' ở 'đuôi dài' của đường cong nhu cầu), thay vì chỉ bán một số lượng lớn của một vài mặt hàng phổ biến (các sản phẩm 'đầu' phổ biến). Điều này có thể thực hiện được nhờ chi phí phân phối và tồn kho thấp của các nhà bán lẻ trực tuyến.",
    "constructs_detailed": [
      { "name": "Niche Products (Sản phẩm ngách)", "desc": "Các sản phẩm có nhu cầu thấp nhưng tổng doanh thu của chúng có thể rất lớn." },
      { "name": "Aggregators (Các nhà tổng hợp)", "desc": "Các nền tảng (như Amazon, Netflix, Spotify) có khả năng cung cấp một danh mục sản phẩm gần như vô hạn." }
    ],
    "sample_scales": [ "Lý thuyết này được chứng minh bằng cách phân tích dữ liệu bán hàng thực tế của các công ty kỹ thuật số." ],
    "related_theories": ["Network Effects"],
    "limitations": "Mặc dù đuôi dài tồn tại, tầm quan trọng của nó đối với lợi nhuận có thể bị thổi phồng. Các sản phẩm 'đầu' vẫn chiếm phần lớn doanh thu và lợi nhuận ở hầu hết các thị trường."
  },
  {
    "id": 157,
    "theory": "Flywheel Effect (Collins)",
    "constructs_full": "Momentum; Compounding Effect; Consistency; Breakthrough",
    "constructs_code": "MOM; CE; CON; BT",
    "note_vi": "Thành công bền vững đến từ nỗ lực nhất quán tạo đà theo thời gian.",
    "group": "Chiến lược",
    "domain": "Management",
    "dependent_variable": "Sustained Performance (SP)",
    "reference": "Collins (2001)",
    "application_vi": "Thành công bền vững không đến từ một hành động đột phá duy nhất mà từ việc liên tục đẩy 'bánh đà' bằng những nỗ lực nhất quán, tạo ra đà phát triển cộng hưởng.",
    "definition_long": "Hiệu ứng Bánh đà là một khái niệm cho rằng các công ty vĩ đại không được tạo ra từ một quyết định, một hành động hay một chương trình may mắn duy nhất. Thay vào đó, chúng được xây dựng thông qua một quá trình đẩy một bánh đà khổng lồ một cách nhất quán theo một hướng. Mỗi vòng quay sẽ tạo đà, và cuối cùng, một điểm đột phá sẽ đến và bánh đà sẽ tự quay.",
    "constructs_detailed": [
      { "name": "Momentum (Đà)", "desc": "Sức mạnh tích lũy từ các nỗ lực nhất quán." },
      { "name": "Compounding Effect (Hiệu ứng cộng hưởng)", "desc": "Mỗi nỗ lực thành công làm cho các nỗ lực tiếp theo trở nên dễ dàng hơn." },
      { "name": "Consistency (Sự nhất quán)", "desc": "Việc tuân thủ một chiến lược và các nguyên tắc cốt lõi trong một thời gian dài." }
    ],
    "sample_scales": [ "Đây là một khái niệm quản trị định tính, được minh họa qua các nghiên cứu tình huống về các công ty thành công." ],
    "related_theories": ["Core Competence"],
    "limitations": "Khái niệm này mang tính mô tả về quá khứ hơn là một công cụ dự báo cho tương lai. Việc xác định các hành động 'đúng đắn' để đẩy bánh đà vẫn là một thách thức lớn."
  },
  {
    "id": 158,
    "theory": "The Chasm (Crossing the Chasm)",
    "constructs_full": "Innovators; Early Adopters; Early Majority; Late Majority; Laggards; The Chasm",
    "constructs_code": "INN; EA; EM; LM; LAG; CH",
    "note_vi": "Vực thẳm giữa nhóm chấp nhận sớm và nhóm đa số ban đầu trong marketing công nghệ.",
    "group": "Innovation",
    "domain": "Technology Marketing",
    "dependent_variable": "Market Adoption (MA)",
    "reference": "Moore (1991)",
    "application_vi": "Nhiều sản phẩm công nghệ thất bại vì chúng chỉ hấp dẫn nhóm người dùng ưa đổi mới (Early Adopters) mà không thể vượt qua 'vực thẳm' để tiếp cận thị trường đại chúng.",
    "definition_long": "Lý thuyết Vượt qua Vực thẳm là một mô hình marketing tập trung vào các thách thức cụ thể khi tiếp thị các sản phẩm công nghệ cao. Nó cho rằng có một 'vực thẳm' lớn giữa nhóm người chấp nhận sớm (Early Adopters), những người bị thu hút bởi công nghệ mới, và nhóm đa số ban đầu (Early Majority), những người thực dụng hơn và muốn các giải pháp đã được chứng minh. Để thành công, các công ty phải thay đổi chiến lược của mình để 'vượt qua vực thẳm' này.",
    "constructs_detailed": [
      { "name": "Early Adopters (Người chấp nhận sớm)", "desc": "Những người có tầm nhìn, muốn khám phá các công nghệ mới để đạt được lợi thế cạnh tranh." },
      { "name": "Early Majority (Đa số ban đầu)", "desc": "Những người thực dụng, họ chấp nhận công nghệ mới khi nó đã được chứng minh là hữu ích và trở thành tiêu chuẩn." },
      { "name": "The Chasm (Vực thẳm)", "desc": "Khoảng cách lớn về kỳ vọng và giá trị giữa hai nhóm trên." }
    ],
    "sample_scales": [ "Đây là một mô hình khái niệm, không sử dụng thang đo." ],
    "related_theories": ["Diffusion of Innovation"],
    "limitations": "Mô hình này chủ yếu tập trung vào thị trường B2B công nghệ cao và có thể không hoàn toàn áp dụng được cho thị trường B2C hoặc các ngành công nghệ thấp."
  },
  {
    "id": 159,
    "theory": "Product Life Cycle (PLC)",
    "constructs_full": "Introduction; Growth; Maturity; Decline",
    "constructs_code": "INTRO; GROW; MAT; DEC",
    "note_vi": "Các giai đoạn trong vòng đời sản phẩm và chiến lược tương ứng.",
    "group": "Marketing",
    "domain": "Product Management",
    "dependent_variable": "Sales; Profit (S/P)",
    "reference": "PLC literature",
    "application_vi": "Doanh nghiệp áp dụng các chiến lược marketing khác nhau cho từng giai đoạn: xây dựng nhận biết (giới thiệu), chiếm thị phần (tăng trưởng), và tối ưu hóa lợi nhuận (bão hòa).",
    "definition_long": "Vòng đời Sản phẩm là một mô hình mô tả các giai đoạn mà một sản phẩm trải qua từ khi được giới thiệu ra thị trường cho đến khi bị rút khỏi. Bốn giai đoạn chính là Giới thiệu, Tăng trưởng, Bão hòa, và Suy thoái. Mỗi giai đoạn có những đặc điểm riêng về doanh số, lợi nhuận, khách hàng và cạnh tranh, đòi hỏi các chiến lược marketing khác nhau.",
    "constructs_detailed": [
      { "name": "Introduction (Giới thiệu)", "desc": "Doanh số thấp, lợi nhuận âm, tập trung vào việc xây dựng nhận biết." },
      { "name": "Growth (Tăng trưởng)", "desc": "Doanh số tăng nhanh, lợi nhuận tăng, cạnh tranh bắt đầu xuất hiện." },
      { "name": "Maturity (Bão hòa)", "desc": "Doanh số đạt đỉnh và bắt đầu đi ngang, cạnh tranh gay gắt, tập trung vào việc duy trì thị phần." },
      { "name": "Decline (Suy thoái)", "desc": "Doanh số và lợi nhuận giảm, công ty phải quyết định nên đổi mới, thu hoạch hay rút lui." }
    ],
    "sample_scales": [ "Đây là một mô hình khái niệm, được xác định bằng cách phân tích dữ liệu doanh số theo thời gian." ],
    "related_theories": ["BCG Matrix"],
    "limitations": "Không phải tất cả các sản phẩm đều đi theo một đường cong hình chữ S cổ điển. Độ dài của mỗi giai đoạn cũng rất khác nhau và khó dự đoán. Đây là một công cụ mô tả hơn là một công cụ dự báo."
  },
  {
    "id": 160,
    "theory": "Media Richness Theory",
    "constructs_full": "Media Richness; Feedback Immediacy; Cues; Ambiguity",
    "constructs_code": "MR; FI; CUE; AMB",
    "note_vi": "Lựa chọn kênh truyền thông phù hợp với mức độ phức tạp của thông điệp.",
    "group": "Communication",
    "domain": "Organizational Communication",
    "dependent_variable": "Communication Effectiveness (CE)",
    "reference": "Daft & Lengel (1986)",
    "application_vi": "Để giải quyết một vấn đề phức tạp và nhạy cảm, một cuộc họp trực tiếp (phong phú) sẽ hiệu quả hơn nhiều so với việc gửi email (ít phong phú).",
    "definition_long": "Lý thuyết Phong phú Phương tiện cho rằng các kênh truyền thông khác nhau có khả năng truyền tải thông tin khác nhau. Một phương tiện được coi là 'phong phú' nếu nó có thể xử lý nhiều tín hiệu cùng một lúc, tạo điều kiện cho phản hồi nhanh chóng, và truyền tải được các sắc thái cá nhân. Lý thuyết này đề xuất rằng các nhà quản lý nên lựa chọn các phương tiện phong phú cho các nhiệm vụ không rõ ràng và các phương tiện ít phong phú hơn cho các nhiệm vụ rõ ràng.",
    "constructs_detailed": [
      { "name": "Media Richness (Sự phong phú của phương tiện)", "desc": "Khả năng của một phương tiện trong việc truyền tải thông tin và giảm bớt sự mơ hồ. Giao tiếp mặt đối mặt là phong phú nhất, trong khi một báo cáo văn bản là ít phong phú nhất." },
      { "name": "Feedback Immediacy (Sự tức thời của phản hồi)", "desc": "Khả năng của phương tiện cho phép phản hồi nhanh chóng." },
      { "name": "Multiple Cues (Nhiều tín hiệu)", "desc": "Khả năng truyền tải các tín hiệu lời nói và phi lời nói (ví dụ: giọng điệu, nét mặt)." },
      { "name": "Ambiguity (Sự mơ hồ)", "desc": "Mức độ không chắc chắn và khả năng có nhiều diễn giải của một nhiệm vụ hoặc thông điệp." }
    ],
    "sample_scales": [
      "Tôi tin rằng cuộc họp trực tiếp là cách tốt nhất để giải quyết vấn đề phức tạp này.",
      "Gửi email là đủ để truyền đạt thông tin đơn giản này."
    ],
    "related_theories": [],
    "limitations": "Lý thuyết này không tính đến các yếu tố xã hội, chẳng hạn như áp lực phải sử dụng một kênh truyền thông nhất định. Nó cũng được phát triển trước thời đại của các phương tiện truyền thông xã hội và cộng tác trực tuyến hiện đại."
  },
  {
    "id": 161,
    "theory": "Social Network Theory",
    "constructs_full": "Nodes; Ties; Centrality; Density; Structural Holes",
    "constructs_code": "NOD; TIE; CEN; DEN; SH",
    "note_vi": "Phân tích cấu trúc mạng xã hội và ảnh hưởng của nó.",
    "group": "Xã hội",
    "domain": "Sociology, Marketing",
    "dependent_variable": "Information Diffusion (ID)",
    "reference": "Social network literature",
    "application_vi": "Phân tích mạng lưới để xác định những người có ảnh hưởng (nodes trung tâm) trong một cộng đồng và nhắm mục tiêu marketing vào họ.",
    "definition_long": "Lý thuyết Mạng lưới Xã hội xem xét các mối quan hệ xã hội dưới dạng các 'nút' (nodes) và 'liên kết' (ties). Các nút là các tác nhân cá nhân trong mạng lưới, và các liên kết là các mối quan hệ giữa các tác nhân. Lý thuyết này cung cấp một bộ phương pháp để phân tích cấu trúc của các mạng lưới xã hội và cách cấu trúc này ảnh hưởng đến hành vi và kết quả.",
    "constructs_detailed": [
      { "name": "Nodes and Ties (Nút và Liên kết)", "desc": "Các cá nhân/tổ chức và các mối quan hệ giữa họ." },
      { "name": "Centrality (Mức độ trung tâm)", "desc": "Một chỉ số đo lường tầm quan trọng hoặc ảnh hưởng của một nút trong mạng lưới." },
      { "name": "Density (Mật độ)", "desc": "Tỷ lệ các liên kết thực tế so với tổng số các liên kết có thể có trong mạng lưới." },
      { "name": "Structural Holes (Lỗ hổng cấu trúc)", "desc": "Sự thiếu liên kết giữa hai cụm nút trong một mạng lưới. Người bắc cầu qua các lỗ hổng này có thể có được lợi thế." }
    ],
    "sample_scales": [ "Đây là một phương pháp phân tích, sử dụng dữ liệu về mối quan hệ để tính toán các chỉ số mạng lưới." ],
    "related_theories": ["Social Capital Theory", "Diffusion of Innovation"],
    "limitations": "Việc thu thập dữ liệu mạng lưới đầy đủ và chính xác có thể rất khó khăn. Phân tích mạng lưới có thể phức tạp và đòi hỏi các phần mềm chuyên dụng."
  },
  {
    "id": 162,
    "theory": "Impulse Buying Behavior",
    "constructs_full": "Urge to Buy; Affective State; Situational Cues; Cognitive Control",
    "constructs_code": "UTB; AS; SC; CC",
    "note_vi": "Hành vi mua hàng bốc đồng, không có kế hoạch trước.",
    "group": "Hành vi",
    "domain": "Consumer Behavior, Retail",
    "dependent_variable": "Impulse Purchase (IP)",
    "reference": "Rook (1987)",
    "application_vi": "Các siêu thị đặt kẹo và tạp chí ở quầy thanh toán để kích thích hành vi mua hàng bốc đồng của khách hàng trong lúc chờ đợi.",
    "definition_long": "Hành vi Mua hàng Bốc đồng là một quyết định mua hàng không có kế hoạch, xảy ra khi một người tiêu dùng trải qua một sự thôi thúc bất ngờ, mạnh mẽ và dai dẳng để mua một thứ gì đó ngay lập tức. Nó thường bị chi phối bởi các yếu tố cảm xúc và tình huống hơn là các cân nhắc lý trí.",
    "constructs_detailed": [
      { "name": "Urge to Buy (Sự thôi thúc mua)", "desc": "Cảm giác muốn mua một sản phẩm ngay lập tức." },
      { "name": "Affective State (Trạng thái cảm xúc)", "desc": "Tâm trạng và cảm xúc của người tiêu dùng tại thời điểm mua sắm (ví dụ: vui vẻ, buồn chán)." },
      { "name": "Situational Cues (Tín hiệu tình huống)", "desc": "Các yếu tố trong môi trường bán lẻ kích thích sự thôi thúc (ví dụ: trưng bày sản phẩm, khuyến mãi)." },
      { "name": "Cognitive Control (Kiểm soát nhận thức)", "desc": "Khả năng của người tiêu dùng trong việc chống lại sự thôi thúc mua hàng." }
    ],
    "sample_scales": [
      "Tôi thường mua mọi thứ một cách bốc đồng.",
      "Khi tôi thấy một thứ gì đó tôi thực sự thích, tôi cảm thấy phải mua nó ngay lập- tức."
    ],
    "related_theories": ["Hedonic Consumption"],
    "limitations": "Sự khác biệt giữa một hành vi mua bốc đồng và một hành vi mua không có kế hoạch nhưng có cân nhắc tại điểm bán có thể khó phân biệt."
  },
  {
    "id": 163,
    "theory": "Mental Accounting",
    "constructs_full": "Fungibility; Framing of Outcomes; Transaction Utility; Acquisition Utility",
    "constructs_code": "FUN; FO; TU; AU",
    "note_vi": "Cách con người phân loại và quản lý tiền trong các 'tài khoản' tinh thần.",
    "group": "Behavioral",
    "domain": "Behavioral Economics",
    "dependent_variable": "Spending Decisions (SD)",
    "reference": "Thaler (1985)",
    "application_vi": "Người ta có thể dễ dàng chi tiêu khoản tiền 'trúng thưởng' hơn là khoản tiền 'lương', mặc dù giá trị của chúng là như nhau.",
    "definition_long": "Kế toán Tinh thần là một lý thuyết kinh tế học hành vi mô tả cách mọi người mã hóa, phân loại và đánh giá các kết quả kinh tế. Con người có xu hướng chia tiền của họ thành các 'tài khoản' tinh thần riêng biệt dựa trên các tiêu chí như nguồn gốc (ví dụ: lương vs. quà tặng) hoặc mục đích (ví dụ: tiền ăn vs. tiền giải trí), và đối xử với các tài khoản này một cách khác nhau, vi phạm nguyên tắc về tính thay thế được (fungibility) của tiền.",
    "constructs_detailed": [
      { "name": "Transaction Utility (Tiện ích giao dịch)", "desc": "Giá trị cảm nhận được của một 'thỏa thuận'. Đó là sự khác biệt giữa số tiền thực sự trả và một mức giá tham chiếu." },
      { "name": "Acquisition Utility (Tiện ích sở hữu)", "desc": "Giá trị của hàng hóa nhận được so với số tiền phải trả." }
    ],
    "sample_scales": [ "Được nghiên cứu qua các kịch bản và thí nghiệm lựa chọn." ],
    "related_theories": ["Prospect Theory", "Framing Effect"],
    "limitations": "Các quy tắc và ranh giới của các tài khoản tinh thần rất khác nhau ở mỗi người và khó dự đoán một cách chính xác."
  },
  {
    "id": 164,
    "theory": "Self-Congruity Theory",
    "constructs_full": "Self-Concept; Brand Image; Self-Congruity; Brand Preference",
    "constructs_code": "SC; BI; SCON; BP",
    "note_vi": "Người tiêu dùng ưa thích thương hiệu có hình ảnh phù hợp với hình ảnh bản thân.",
    "group": "Thương hiệu",
    "domain": "Branding, Consumer Psychology",
    "dependent_variable": "Brand Choice (BC)",
    "reference": "Sirgy (1982)",
    "application_vi": "Người tiêu dùng có xu hướng lựa chọn các thương hiệu có hình ảnh và tính cách phù hợp với cách họ nhìn nhận về bản thân.",
    "definition_long": "Lý thuyết Tự tương hợp cho rằng hành vi của người tiêu dùng được quyết định một phần bởi sự phù hợp giữa hình ảnh bản thân (self-image) của họ và hình ảnh của sản phẩm hoặc thương hiệu. Người tiêu dùng có xu hướng mua các sản phẩm và thương hiệu mà họ tin rằng có hình ảnh hoặc tính cách tương tự như của chính họ.",
    "constructs_detailed": [
      { "name": "Self-Concept (Khái niệm bản thân)", "desc": "Tổng thể các suy nghĩ và cảm xúc của một cá nhân về bản thân. Có thể bao gồm bản thân thực tế, bản thân lý tưởng, và bản thân xã hội." },
      { "name": "Brand Image (Hình ảnh thương hiệu)", "desc": "Nhận thức của người tiêu dùng về tính cách hoặc hình ảnh của một thương hiệu." },
      { "name": "Self-Congruity (Sự tự tương hợp)", "desc": "Mức độ phù hợp giữa hình ảnh bản thân của người tiêu dùng và hình ảnh thương hiệu." }
    ],
    "sample_scales": [
      "Tôi nghĩ rằng hình ảnh của thương hiệu này rất phù hợp với con người tôi.",
      "Sử dụng thương hiệu này phản ánh con người tôi muốn trở thành."
    ],
    "related_theories": ["Brand Personality Framework", "Social Identity Theory"],
    "limitations": "Tầm quan trọng của sự tự tương hợp có thể khác nhau tùy thuộc vào loại sản phẩm (ví dụ: quan trọng hơn đối với các sản phẩm thể hiện cá tính như thời trang) và đặc điểm cá nhân."
  },
  {
    "id": 165,
    "theory": "Nostalgia Marketing",
    "constructs_full": "Personal Nostalgia; Historical Nostalgia; Emotional Response; Brand Attitude",
    "constructs_code": "PN; HN; ER; BA",
    "note_vi": "Sử dụng hoài niệm để tạo kết nối cảm xúc với người tiêu dùng.",
    "group": "Marketing",
    "domain": "Advertising, Branding",
    "dependent_variable": "Purchase Intention (PI)",
    "reference": "Nostalgia marketing literature",
    "application_vi": "Nintendo tung ra các phiên bản game cổ điển, khơi gợi hoài niệm thời thơ ấu để tạo kết nối cảm xúc và thúc đẩy doanh số.",
    "definition_long": "Tiếp thị Hoài niệm là việc sử dụng các chủ đề, hình ảnh, âm thanh từ quá khứ để gợi lên những cảm xúc tích cực và sự khao khát về 'những ngày xưa tốt đẹp'. Bằng cách kết nối thương hiệu với những ký ức cá nhân hoặc tập thể tích cực, các nhà tiếp thị có thể tạo ra một mối liên kết tình cảm mạnh mẽ và tăng cường thái độ đối với thương hiệu.",
    "constructs_detailed": [
      { "name": "Personal Nostalgia (Hoài niệm cá nhân)", "desc": "Sự khao khát về quá khứ đã trải qua của chính mình." },
      { "name": "Historical Nostalgia (Hoài niệm lịch sử)", "desc": "Sự khao khát về một thời đại trong quá khứ mà cá nhân chưa từng trải qua." },
      { "name": "Emotional Response (Phản ứng cảm xúc)", "desc": "Các cảm xúc tích cực (ví dụ: ấm áp, hạnh phúc) được gợi lên bởi các kích thích hoài niệm." }
    ],
    "sample_scales": [
      "Quảng cáo này làm tôi nhớ lại những kỷ niệm đẹp thời thơ ấu.",
      "Quảng cáo này làm tôi cảm thấy ấm áp và hạnh phúc."
    ],
    "related_theories": ["Attachment Theory (Brand)"],
    "limitations": "Hoài niệm có thể không hiệu quả đối với các thế hệ trẻ không có ký ức về thời kỳ được nhắc đến. Việc sử dụng nó một cách không chân thực có thể bị coi là sáo rỗng."
  },
  {
    "id": 166,
    "theory": "Cognitive Load Theory",
    "constructs_full": "Intrinsic Load; Extraneous Load; Germane Load; Working Memory",
    "constructs_code": "IL; EL; GL; WM",
    "note_vi": "Gánh nặng nhận thức ảnh hưởng đến khả năng xử lý thông tin và học tập.",
    "group": "Psychology",
    "domain": "UX, Instructional Design",
    "dependent_variable": "Task Performance (TP)",
    "reference": "Sweller (1988)",
    "application_vi": "Một trang web có thiết kế lộn xộn, nhiều pop-up (tải nhận thức không liên quan cao) sẽ khiến người dùng khó tìm thấy thông tin họ cần.",
    "definition_long": "Lý thuyết Tải nhận thức là một lý thuyết về thiết kế hướng dẫn, cho rằng bộ nhớ làm việc của con người có dung lượng hạn chế. Do đó, các tài liệu hướng dẫn nên được thiết kế để giảm thiểu 'tải nhận thức không liên quan' và tối ưu hóa 'tải nhận thức phù hợp', nhằm tạo điều kiện thuận lợi cho việc học và xử lý thông tin.",
    "constructs_detailed": [
      { "name": "Intrinsic Load (Tải nội tại)", "desc": "Độ khó vốn có của tài liệu, không thể thay đổi." },
      { "name": "Extraneous Load (Tải không liên quan)", "desc": "Gánh nặng nhận thức do cách trình bày thông tin, nên được giảm thiểu." },
      { "name": "Germane Load (Tải phù hợp)", "desc": "Nỗ lực nhận thức dành cho việc xử lý, xây dựng và tự động hóa các lược đồ (schema), nên được tối ưu hóa." }
    ],
    "sample_scales": [
      "Tôi cảm thấy rất khó để tìm thấy thông tin tôi cần trên trang web này.",
      "Cách trình bày thông tin trên trang này rất rõ ràng và dễ hiểu."
    ],
    "related_theories": ["Information Processing Theory"],
    "limitations": "Việc đo lường chính xác ba loại tải nhận thức một cách riêng biệt là rất khó khăn. Mức tải tối ưu cũng khác nhau ở mỗi cá nhân tùy thuộc vào kiến thức nền của họ."
  },
  {
    "id": 167,
    "theory": "The Paradox of Choice",
    "constructs_full": "Number of Choices; Decision Paralysis; Satisfaction with Choice",
    "constructs_code": "NC; DP; SWC",
    "note_vi": "Quá nhiều lựa chọn có thể dẫn đến tê liệt quyết định và giảm hài lòng.",
    "group": "Hành vi",
    "domain": "Consumer Psychology",
    "dependent_variable": "Choice; Satisfaction (C/S)",
    "reference": "Schwartz (2004)",
    "application_vi": "Một thực đơn có quá nhiều món có thể khiến thực khách bị 'tê liệt', khó ra quyết định và cảm thấy ít hài lòng hơn với lựa chọn của mình.",
    "definition_long": "Nghịch lý của Sự lựa chọn cho rằng mặc dù tự do và tự chủ là quan trọng, nhưng việc có quá nhiều lựa chọn có thể dẫn đến các hậu quả tiêu cực về mặt tâm lý. Thay vì làm cho mọi người cảm thấy tốt hơn, một loạt các lựa chọn quá lớn có thể gây ra sự tê liệt trong quyết định, sự hối tiếc sau lựa chọn, và sự hài lòng thấp hơn.",
    "constructs_detailed": [
      { "name": "Number of Choices (Số lượng lựa chọn)", "desc": "Số lượng các phương án có sẵn." },
      { "name": "Decision Paralysis (Tê liệt quyết định)", "desc": "Tình trạng không thể đưa ra quyết định khi đối mặt với quá nhiều lựa chọn." },
      { "name": "Satisfaction with Choice (Sự hài lòng với lựa chọn)", "desc": "Mức độ hài lòng sau khi đã đưa ra quyết định." }
    ],
    "sample_scales": [
      "Tôi cảm thấy choáng ngợp trước số lượng lựa chọn có sẵn.",
      "Sau khi mua hàng, tôi thường tự hỏi liệu mình có thể đã có một lựa chọn tốt hơn không."
    ],
    "related_theories": ["Satisficing (Bounded Rationality)"],
    "limitations": "Hiệu ứng này không phải lúc nào cũng xảy ra. Đối với những người có chuyên môn cao hoặc sở thích rõ ràng, nhiều lựa chọn hơn có thể là một điều tốt. Ngưỡng mà tại đó 'quá nhiều' lựa chọn bắt đầu có tác động tiêu cực cũng khác nhau."
  },
  {
    "id": 168,
    "theory": "E-Service Quality (E-S-QUAL)",
    "constructs_full": "Efficiency; Fulfillment; System Availability; Privacy",
    "constructs_code": "EFF; FUL; SA; PRI",
    "note_vi": "Thang đo chất lượng dịch vụ điện tử.",
    "group": "Chất lượng dịch vụ",
    "domain": "E-commerce",
    "dependent_variable": "Customer Satisfaction (CS)",
    "reference": "Parasuraman et al. (2005)",
    "application_vi": "Các trang TMĐT được đánh giá dựa trên hiệu quả (tốc độ tải trang), sự hoàn thành (giao hàng đúng hẹn), tính sẵn sàng của hệ thống và bảo mật thông tin.",
    "definition_long": "E-S-QUAL là một thang đo đa chiều để đánh giá chất lượng dịch vụ cảm nhận của khách hàng đối với các trang web. Nó được phát triển dựa trên mô hình SERVQUAL nhưng được điều chỉnh cho phù hợp với bối cảnh dịch vụ điện tử. Thang đo này bao gồm bốn chiều cốt lõi.",
    "constructs_detailed": [
      { "name": "Efficiency (Hiệu quả)", "desc": "Sự dễ dàng và tốc độ mà khách hàng có thể truy cập và sử dụng trang web." },
      { "name": "Fulfillment (Sự hoàn thành)", "desc": "Mức độ trang web thực hiện đúng các lời hứa về việc giao hàng và cung cấp sản phẩm." },
      { "name": "System Availability (Tính sẵn sàng của hệ thống)", "desc": "Các khía cạnh kỹ thuật của trang web, chẳng hạn như hoạt động ổn định, không bị lỗi." },
      { "name": "Privacy (Sự riêng tư)", "desc": "Mức độ bảo vệ và bảo mật thông tin cá nhân của khách hàng." }
    ],
    "sample_scales": [
      "Trang web này tải nhanh.",
      "Sản phẩm được giao đúng thời gian đã hứa.",
      "Tôi cảm thấy an toàn khi cung cấp thông tin cá nhân của mình trên trang web này."
    ],
    "related_theories": ["SERVQUAL", "TAM"],
    "limitations": "Mô hình này tập trung vào các khía cạnh chức năng của trang web và có thể bỏ qua các yếu tố trải nghiệm khác như tính thẩm mỹ hoặc sự thú vị."
  },
  {
    "id": 169,
    "theory": "Information Foraging Theory",
    "constructs_full": "Information Scent; Patch; Foraging Cost; Information Diet",
    "constructs_code": "IS; PAT; FC; ID",
    "note_vi": "Người dùng tìm kiếm thông tin trực tuyến tương tự như động vật tìm kiếm thức ăn.",
    "group": "Information",
    "domain": "UX, Web Design",
    "dependent_variable": "Engagement (ENG)",
    "reference": "Pirolli & Card (1999)",
    "application_vi": "Người dùng sẽ rời bỏ một trang web nếu các tiêu đề và liên kết ('mùi thông tin') không cho thấy họ đang đi đúng hướng để tìm thấy thứ họ cần.",
    "definition_long": "Lý thuyết Tìm kiếm Thông tin áp dụng các mô hình về tìm kiếm thức ăn của động vật vào việc con người tìm kiếm thông tin. Nó cho rằng con người, khi tìm kiếm thông tin, sẽ cố gắng tối đa hóa tỷ lệ thu được thông tin có giá trị so với chi phí bỏ ra (ví dụ: thời gian, nỗ lực). Họ sẽ đi theo những 'mùi thông tin' (information scent) hứa hẹn nhất.",
    "constructs_detailed": [
      { "name": "Information Scent (Mùi thông tin)", "desc": "Các tín hiệu (ví dụ: tiêu đề, liên kết, hình ảnh) giúp người dùng đánh giá khả năng một nguồn thông tin có chứa thứ họ đang tìm kiếm hay không." },
      { "name": "Patch (Vùng thông tin)", "desc": "Một tập hợp các thông tin, chẳng hạn như một trang web hoặc một thư mục." },
      { "name": "Foraging Cost (Chi phí tìm kiếm)", "desc": "Thời gian và nỗ lực cần thiết để tìm và xử lý thông tin." }
    ],
    "sample_scales": [ "Đây là một khung lý thuyết để phân tích hành vi người dùng, thường được đánh giá qua các thử nghiệm khả dụng (usability testing) và phân tích dữ liệu web (web analytics)." ],
    "related_theories": ["Cognitive Load Theory"],
    "limitations": "Lý thuyết này giả định một hành vi tìm kiếm có mục tiêu rõ ràng và có thể không giải thích tốt cho các hành vi lướt web không mục đích hoặc khám phá."
  },
  {
    "id": 170,
    "theory": "Return on Marketing Investment (ROMI)",
    "constructs_full": "Marketing Spend; Incremental Revenue; Gross Margin; ROMI",
    "constructs_code": "MS; IR; GM; ROMI",
    "note_vi": "Đo lường lợi nhuận từ chi tiêu marketing.",
    "group": "Financial",
    "domain": "Marketing Analytics",
    "dependent_variable": "Marketing Effectiveness (ME)",
    "reference": "Marketing finance literature",
    "application_vi": "Tính toán lợi nhuận thu được từ mỗi đồng chi cho các chiến dịch marketing để đánh giá hiệu quả và phân bổ ngân sách.",
    "definition_long": "Lợi nhuận trên Đầu tư Marketing (ROMI) là một chỉ số tài chính được sử dụng để đo lường hiệu quả của các hoạt động marketing. Nó giúp các nhà tiếp thị biện minh cho chi tiêu của mình và phân bổ ngân sách một cách hiệu quả hơn bằng cách so sánh lợi nhuận gia tăng do marketing tạo ra với chi phí của các hoạt động đó.",
    "constructs_detailed": [
      { "name": "Marketing Spend (Chi tiêu Marketing)", "desc": "Tổng chi phí cho một chiến dịch hoặc hoạt động marketing." },
      { "name": "Incremental Revenue (Doanh thu gia tăng)", "desc": "Doanh thu được tạo ra trực tiếp nhờ vào hoạt động marketing, sau khi đã trừ đi doanh thu cơ bản (baseline)." }
    ],
    "sample_scales": [ "Đây là một chỉ số tài chính được tính toán từ dữ liệu bán hàng và chi phí, không phải là một thang đo khảo sát." ],
    "related_theories": ["Lead–Lag Models"],
    "limitations": "Việc tính toán chính xác 'doanh thu gia tăng' là một thách thức lớn, vì rất khó để tách bạch hoàn toàn tác động của marketing khỏi các yếu tố khác. ROMI cũng có thể khuyến khích sự tập trung vào các chiến thuật ngắn hạn có thể đo lường được."
  },
  {
    "id": 171,
    "theory": "Agile Management/Marketing",
    "constructs_full": "Sprints; Stand-ups; Collaboration; Adaptive Planning; Fast Feedback",
    "constructs_code": "SPR; STA; COL; AP; FF",
    "note_vi": "Phương pháp quản lý linh hoạt, lặp lại và thích ứng.",
    "group": "Management",
    "domain": "Project Management, Marketing",
    "dependent_variable": "Project Speed (PS)",
    "reference": "Agile literature",
    "application_vi": "Các nhóm marketing làm việc theo các 'sprint' ngắn (2 tuần), họp đứng mỗi ngày để cập nhật và nhanh chóng điều chỉnh chiến dịch dựa trên dữ liệu.",
    "definition_long": "Quản lý Linh hoạt (Agile) là một phương pháp tiếp cận lặp lại để quản lý dự án và phát triển sản phẩm. Nó nhấn mạnh sự hợp tác, phản hồi nhanh chóng và các chu kỳ phát triển ngắn được gọi là 'sprint'. Khi được áp dụng cho marketing, nó giúp các nhóm nhanh chóng thích ứng với những thay đổi của thị trường và dữ liệu hiệu suất.",
    "constructs_detailed": [
      { "name": "Sprints", "desc": "Các chu kỳ công việc ngắn, có thời hạn cố định (thường là 1-4 tuần) để hoàn thành một lượng công việc đã định." },
      { "name": "Stand-ups (Họp đứng)", "desc": "Các cuộc họp ngắn hàng ngày để các thành viên trong nhóm đồng bộ hóa các hoạt động và lập kế hoạch cho 24 giờ tới." },
      { "name": "Adaptive Planning (Lập kế hoạch thích ứng)", "desc": "Kế hoạch được điều chỉnh liên tục dựa trên các thông tin và phản hồi mới." }
    ],
    "sample_scales": [ "Đây là một phương pháp làm việc, hiệu quả được đo bằng các chỉ số dự án như tốc độ hoàn thành, thời gian ra thị trường, và khả năng đáp ứng thay đổi." ],
    "related_theories": ["Lean Startup"],
    "limitations": "Agile đòi hỏi một sự thay đổi lớn về tư duy và văn hóa. Nó có thể không phù hợp với các dự án có yêu cầu rất ổn định và có thể dự đoán được từ đầu."
  },
  {
    "id": 172,
    "theory": "Theory of Constraints (TOC)",
    "constructs_full": "Constraint Identification; Exploitation; Subordination; Elevation",
    "constructs_code": "CI; EXP; SUB; ELE",
    "note_vi": "Tập trung cải thiện nút thắt cổ chai để nâng cao hiệu suất toàn hệ thống.",
    "group": "Operations",
    "domain": "Process Management",
    "dependent_variable": "Throughput (TP)",
    "reference": "Goldratt (1984)",
    "application_vi": "Tập trung vào việc cải thiện 'nút thắt cổ chai' trong một dây chuyền sản xuất, vì hiệu suất của toàn bộ hệ thống bị giới hạn bởi điểm yếu nhất đó.",
    "definition_long": "Lý thuyết Ràng buộc là một triết lý quản lý cho rằng mọi hệ thống phức tạp đều có ít nhất một ràng buộc (constraint) hoặc 'nút thắt cổ chai' (bottleneck) giới hạn khả năng đạt được mục tiêu của hệ thống. Để cải thiện hiệu suất của toàn bộ hệ thống, sự chú ý phải được tập trung vào việc cải thiện ràng buộc đó.",
    "constructs_detailed": [
      { "name": "Constraint Identification (Xác định ràng buộc)", "desc": "Bước đầu tiên là tìm ra yếu tố đang giới hạn hiệu suất của hệ thống." },
      { "name": "Exploitation (Khai thác)", "desc": "Tận dụng tối đa ràng buộc mà không cần đầu tư lớn." },
      { "name": "Subordination (Phục tùng)", "desc": "Điều chỉnh tất cả các phần khác của hệ thống để hỗ trợ cho ràng buộc." },
      { "name": "Elevation (Nâng cấp)", "desc": "Nếu cần, đầu tư để tăng công suất của ràng buộc." }
    ],
    "sample_scales": [ "Đây là một phương pháp cải tiến quy trình, hiệu quả được đo bằng các chỉ số hoạt động như thông lượng, tồn kho, và chi phí vận hành." ],
    "related_theories": ["Lean Management"],
    "limitations": "Việc xác định đúng ràng buộc có thể khó khăn, đặc biệt là khi ràng buộc không phải là một nguồn lực vật chất mà là một chính sách hoặc quy tắc."
  },
  {
    "id": 173,
    "theory": "Business Model Canvas",
    "constructs_full": "Customer Segments; Value Propositions; Channels; Customer Relationships; Revenue Streams; Key Resources; Key Activities; Key Partnerships; Cost Structure",
    "constructs_code": "CS; VP; CH; CR; RS; KR; KA; KP; CST",
    "note_vi": "Công cụ trực quan hóa và thiết kế mô hình kinh doanh.",
    "group": "Chiến lược",
    "domain": "Business Model Design",
    "dependent_variable": "Business Model Viability (BMV)",
    "reference": "Osterwalder & Pigneur (2010)",
    "application_vi": "Một công cụ trực quan hóa mô hình kinh doanh trên một trang giấy, giúp các startup và doanh nghiệp phân tích và đổi mới mô hình của mình.",
    "definition_long": "Khung Mô hình Kinh doanh là một công cụ quản lý chiến lược cho phép bạn mô tả, thiết kế, thách thức, và xoay trục mô hình kinh doanh của mình. Nó cung cấp một ngôn ngữ hình ảnh chung để mô tả cách một tổ chức tạo ra, cung cấp và nắm bắt giá trị thông qua chín khối xây dựng.",
    "constructs_detailed": [
      { "name": "Customer Segments (Phân khúc khách hàng)", "desc": "Các nhóm người hoặc tổ chức khác nhau mà một doanh nghiệp nhắm đến." },
      { "name": "Value Propositions (Đề xuất giá trị)", "desc": "Gói sản phẩm và dịch vụ tạo ra giá trị cho một phân khúc khách hàng cụ thể." },
      { "name": "Channels (Kênh)", "desc": "Cách một công ty giao tiếp và tiếp cận các phân khúc khách hàng của mình để cung cấp một đề xuất giá trị." },
      { "name": "Revenue Streams (Dòng doanh thu)", "desc": "Tiền mặt mà một công ty tạo ra từ mỗi phân khúc khách hàng." }
    ],
    "sample_scales": [ "Đây là một công cụ tư duy chiến lược và phân tích định tính." ],
    "related_theories": ["Lean Startup", "Value Proposition Canvas"],
    "limitations": "Khung này không xem xét đến các yếu tố cạnh tranh hoặc môi trường bên ngoài một cách chi tiết. Nó là một công cụ mô tả hơn là một công cụ dự báo."
  },
  {
    "id": 174,
    "theory": "Competitive Advantage",
    "constructs_full": "Cost Advantage; Differentiation Advantage; Sustainable Advantage",
    "constructs_code": "CA; DA; SA",
    "note_vi": "Lợi thế cạnh tranh là cốt lõi của hiệu suất vượt trội.",
    "group": "Chiến lược",
    "domain": "Strategy",
    "dependent_variable": "Firm Performance (FP)",
    "reference": "Porter (1985)",
    "application_vi": "Lợi thế cạnh tranh là khả năng của một công ty tạo ra giá trị cho khách hàng vượt trội hơn so với đối thủ, có thể bằng chi phí thấp hơn hoặc sự khác biệt.",
    "definition_long": "Lợi thế Cạnh tranh là một thuộc tính cho phép một tổ chức vượt trội hơn các đối thủ cạnh tranh của mình. Lợi thế này có thể đến từ nhiều nguồn, nhưng thường được phân loại thành hai loại cơ bản: lợi thế về chi phí và lợi thế về sự khác biệt hóa. Một lợi thế cạnh tranh được coi là bền vững nếu nó không thể dễ dàng bị sao chép hoặc bị xói mòn bởi các hành động của đối thủ.",
    "constructs_detailed": [
      { "name": "Cost Advantage (Lợi thế chi phí)", "desc": "Khả năng sản xuất một sản phẩm hoặc cung cấp một dịch vụ với chi phí thấp hơn so với đối thủ." },
      { "name": "Differentiation Advantage (Lợi thế khác biệt hóa)", "desc": "Khả năng cung cấp một sản phẩm hoặc dịch vụ độc đáo và vượt trội về chất lượng, tính năng hoặc thương hiệu." },
      { "name": "Sustainable Advantage (Lợi thế bền vững)", "desc": "Một lợi thế cạnh tranh có thể được duy trì trong một thời gian dài." }
    ],
    "sample_scales": [ "Thường được đo lường gián tiếp thông qua các chỉ số hiệu suất như lợi nhuận, thị phần, hoặc thông qua các khảo sát về nhận thức của khách hàng." ],
    "related_theories": ["Resource-Based View (RBV)", "Porter's Generic Strategies"],
    "limitations": "Lợi thế cạnh tranh ngày càng khó duy trì trong môi trường kinh doanh toàn cầu hóa và thay đổi nhanh chóng."
  },
  {
    "id": 175,
    "theory": "Core Competence",
    "constructs_full": "Valuable; Rare; Inimitable; Non-substitutable Competencies",
    "constructs_code": "V; R; I; N",
    "note_vi": "Năng lực cốt lõi là nền tảng cho lợi thế cạnh tranh dài hạn.",
    "group": "Chiến lược",
    "domain": "Strategy",
    "dependent_variable": "Long-term Growth (LTG)",
    "reference": "Prahalad & Hamel (1990)",
    "application_vi": "Năng lực cốt lõi của Honda trong việc sản xuất động cơ đã cho phép họ thành công ở nhiều lĩnh vực từ xe máy, ô tô đến máy cắt cỏ.",
    "definition_long": "Năng lực Cốt lõi là sự kết hợp hài hòa giữa các kỹ năng và công nghệ cho phép một công ty cung cấp một lợi ích độc đáo cho khách hàng. Đó là 'gốc rễ' của lợi thế cạnh tranh, từ đó các sản phẩm và dịch vụ cốt lõi 'mọc' ra. Một năng lực cốt lõi phải cung cấp khả năng tiếp cận nhiều thị trường, tạo ra lợi ích cảm nhận đáng kể cho khách hàng, và khó bị đối thủ bắt chước.",
    "constructs_detailed": [
      { "name": "Valuable, Rare, Inimitable (Có giá trị, Hiếm, Khó bắt chước)", "desc": "Các tiêu chí tương tự như trong RBV/VRIO để xác định một năng lực có phải là cốt lõi hay không." }
    ],
    "sample_scales": [ "Đây là một khái niệm chiến lược được xác định thông qua phân tích nội bộ, không phải qua khảo sát." ],
    "related_theories": ["Resource-Based View (RBV)", "VRIO Framework"],
    "limitations": "Các công ty có thể gặp khó khăn trong việc xác định chính xác năng lực cốt lõi của mình, hoặc có thể quá bám víu vào các năng lực cốt lõi cũ, dẫn đến sự cứng nhắc và không thể thích ứng với những thay đổi của thị trường."
  },
  {
    "id": 176,
    "theory": "The Learning Organization",
    "constructs_full": "Personal Mastery; Mental Models; Shared Vision; Team Learning; Systems Thinking",
    "constructs_code": "PM; MM; SV; TL; ST",
    "note_vi": "Tổ chức liên tục học hỏi và chuyển đổi để thích ứng.",
    "group": "Organizational",
    "domain": "Knowledge Management",
    "dependent_variable": "Adaptability (ADAP)",
    "reference": "Senge (1990)",
    "application_vi": "Một tổ chức liên tục học hỏi, khuyến khích chia sẻ kiến thức và thử nghiệm để thích ứng nhanh chóng với sự thay đổi của môi trường.",
    "definition_long": "Tổ chức Học hỏi là một tổ chức liên tục mở rộng khả năng của mình để tạo ra tương lai. Theo Senge, các tổ chức này được đặc trưng bởi việc thành thạo năm nguyên tắc cốt lõi, giúp chúng có khả năng học hỏi, thích ứng và thay đổi một cách hệ thống.",
    "constructs_detailed": [
      { "name": "Personal Mastery (Làm chủ bản thân)", "desc": "Sự cam kết của cá nhân đối với việc học hỏi và phát triển liên tục." },
      { "name": "Mental Models (Mô hình tư duy)", "desc": "Các giả định và khuôn mẫu suy nghĩ sâu sắc ảnh hưởng đến cách chúng ta hành động. Các tổ chức học hỏi khuyến khích việc nhận diện và thách thức các mô hình này." },
      { "name": "Shared Vision (Tầm nhìn chung)", "desc": "Một hình ảnh chung về tương lai mà tất cả các thành viên trong tổ chức đều cam kết." },
      { "name": "Team Learning (Học hỏi theo nhóm)", "desc": "Quá trình đối thoại và thảo luận cho phép các nhóm phát triển trí thông minh và khả năng vượt xa các thành viên cá nhân." },
      { "name": "Systems Thinking (Tư duy hệ thống)", "desc": "Nguyên tắc thứ năm, tích hợp tất cả các nguyên tắc khác, là khả năng nhìn thấy các mối liên kết và các mẫu hình thay đổi trong hệ thống." }
    ],
    "sample_scales": [
      "Trong tổ chức của tôi, mọi người được khuyến khích dành thời gian để học hỏi những điều mới.",
      "Chúng tôi thường xuyên thách thức các giả định cũ về cách làm việc.",
      "Các nhóm làm việc của chúng tôi có khả năng giải quyết các vấn đề phức tạp cùng nhau."
    ],
    "related_theories": ["Knowledge-Based View (KBV)"],
    "limitations": "Việc xây dựng một tổ chức học hỏi là một quá trình văn hóa dài hạn và khó khăn, đòi hỏi sự thay đổi sâu sắc trong tư duy và hành vi ở mọi cấp độ."
  },
  {
    "id": 177,
    "theory": "McGregor's Theory X and Theory Y",
    "constructs_full": "Theory X (authoritarian); Theory Y (participative)",
    "constructs_code": "TX; TY",
    "note_vi": "Hai giả định đối lập về bản chất và động lực của người lao động.",
    "group": "Management",
    "domain": "HR",
    "dependent_variable": "Management Style (MS)",
    "reference": "McGregor (1960)",
    "application_vi": "Nhà quản lý theo Thuyết Y tin rằng nhân viên vốn có động lực và sáng tạo, do đó họ sẽ trao quyền và tạo điều kiện thay vì giám sát chặt chẽ (Thuyết X).",
    "definition_long": "Thuyết X và Thuyết Y là hai bộ giả định đối lập về bản chất của người lao động, ảnh hưởng đến phong cách quản lý. Các nhà quản lý Thuyết X có xu hướng có cái nhìn tiêu cực, trong khi các nhà quản lý Thuyết Y có cái nhìn tích cực hơn.",
    "constructs_detailed": [
      { "name": "Theory X (Thuyết X)", "desc": "Giả định rằng nhân viên vốn lười biếng, không thích trách nhiệm và cần được giám sát, kiểm soát và thúc đẩy bằng các hình phạt." },
      { "name": "Theory Y (Thuyết Y)", "desc": "Giả định rằng nhân viên có thể tự định hướng, sáng tạo, thích trách nhiệm và coi công việc là một phần tự nhiên của cuộc sống." }
    ],
    "sample_scales": [
      "Quản lý của tôi tin rằng nếu không có sự giám sát chặt chẽ, nhân viên sẽ không làm việc.",
      "Quản lý của tôi tin tưởng nhân viên sẽ làm điều đúng đắn cho tổ chức."
    ],
    "related_theories": ["Goal-Setting Theory"],
    "limitations": "Thuyết này có thể đơn giản hóa quá mức và phân loại con người vào hai thái cực. Hầu hết mọi người và phong cách quản lý nằm đâu đó ở giữa."
  },
  {
    "id": 178,
    "theory": "Situational Leadership Theory",
    "constructs_full": "Telling; Selling; Participating; Delegating; Follower Readiness",
    "constructs_code": "TEL; SEL; PAR; DEL; FR",
    "note_vi": "Lãnh đạo cần điều chỉnh phong cách cho phù hợp với mức độ trưởng thành của nhân viên.",
    "group": "Leadership",
    "domain": "Management",
    "dependent_variable": "Leadership Effectiveness (LE)",
    "reference": "Hersey & Blanchard (1969)",
    "application_vi": "Với một nhân viên mới (chưa sẵn sàng), lãnh đạo cần chỉ dẫn (Telling); với nhân viên kinh nghiệm (sẵn sàng), lãnh đạo có thể giao phó (Delegating).",
    "definition_long": "Lý thuyết Lãnh đạo Tình huống cho rằng không có một phong cách lãnh đạo tốt nhất duy nhất. Thay vào đó, lãnh đạo hiệu quả phụ thuộc vào tình huống, và cụ thể là mức độ sẵn sàng (readiness) hoặc trưởng thành (maturity) của nhân viên. Nhà lãnh đạo nên điều chỉnh phong cách của mình (kết hợp giữa hành vi chỉ đạo và hành vi hỗ trợ) để phù hợp với mức độ sẵn sàng của nhân viên.",
    "constructs_detailed": [
      { "name": "Telling/Directing (Chỉ đạo)", "desc": "Chỉ đạo cao, hỗ trợ thấp. Dành cho nhân viên có năng lực thấp nhưng cam kết cao." },
      { "name": "Selling/Coaching (Huấn luyện)", "desc": "Chỉ đạo cao, hỗ trợ cao. Dành cho nhân viên có năng lực thấp và cam kết cũng thấp." },
      { "name": "Participating/Supporting (Hỗ trợ)", "desc": "Chỉ đạo thấp, hỗ trợ cao. Dành cho nhân viên có năng lực cao nhưng cam kết hoặc tự tin thấp." },
      { "name": "Delegating (Giao phó)", "desc": "Chỉ đạo thấp, hỗ trợ thấp. Dành cho nhân viên có cả năng lực và cam kết cao." }
    ],
    "sample_scales": [ "Mô hình này thường được sử dụng như một công cụ đào tạo và phát triển cho các nhà quản lý hơn là một lý thuyết nghiên cứu được kiểm định rộng rãi." ],
    "related_theories": ["Contingency Theory"],
    "limitations": "Lý thuyết này đã bị chỉ trích vì thiếu sự hỗ trợ thực nghiệm mạnh mẽ và sự không nhất quán trong các định nghĩa về mức độ sẵn sàng."
  },
  {
    "id": 179,
    "theory": "Brand Community Model",
    "constructs_full": "Consciousness of Kind; Rituals and Traditions; Moral Responsibility",
    "constructs_code": "CK; RT; MR",
    "note_vi": "Cộng đồng thương hiệu xây dựng trên các kết nối xã hội giữa người hâm mộ.",
    "group": "Thương hiệu",
    "domain": "Marketing",
    "dependent_variable": "Brand Loyalty (BL)",
    "reference": "Muniz & O'Guinn (2001)",
    "application_vi": "Các cộng đồng người hâm mộ Star Wars có ý thức chung, các nghi lễ (như cosplay) và trách nhiệm đạo đức để bảo vệ và phát triển di sản của thương hiệu.",
    "definition_long": "Mô hình Cộng đồng Thương hiệu định nghĩa cộng đồng thương hiệu không phải là một nhóm người do công ty tạo ra, mà là một cộng đồng chuyên biệt, không bị ràng buộc về mặt địa lý, dựa trên một tập hợp các mối quan hệ xã hội có cấu trúc giữa những người ngưỡng mộ một thương hiệu. Nó được đặc trưng bởi ba dấu hiệu cốt lõi.",
    "constructs_detailed": [
      { "name": "Consciousness of Kind (Ý thức đồng loại)", "desc": "Cảm giác kết nối nội tại mà các thành viên cảm thấy với nhau, và sự khác biệt mà họ cảm nhận so với những người không thuộc cộng đồng." },
      { "name": "Rituals and Traditions (Nghi lễ và Truyền thống)", "desc": "Các thực hành và quy trình xã hội được chia sẻ xung quanh thương hiệu, giúp tái tạo và củng cố ý nghĩa của cộng đồng." },
      { "name": "Moral Responsibility (Trách nhiệm đạo đức)", "desc": "Cảm giác nghĩa vụ và trách nhiệm đối với cộng đồng và các thành viên của nó." }
    ],
    "sample_scales": [
      "Tôi cảm thấy có một mối liên kết với những người khác cũng yêu thích thương hiệu này.",
      "Chúng tôi có những cách riêng để nói về và sử dụng thương hiệu này.",
      "Tôi cảm thấy có trách nhiệm phải giúp đỡ các thành viên khác trong cộng đồng thương hiệu này."
    ],
    "related_theories": ["Social Identity Theory"],
    "limitations": "Không phải tất cả các thương hiệu đều có thể tạo ra các cộng đồng mạnh mẽ. Điều này thường chỉ xảy ra với các thương hiệu có tính biểu tượng cao và lịch sử lâu đời."
  },
  {
    "id": 180,
    "theory": "Customer Engagement Behavior (CEB)",
    "constructs_full": "Cognitive; Emotional; Behavioral Engagement; Co-creation",
    "constructs_code": "COG; EMO; BEH; CC",
    "note_vi": "Hành vi gắn kết của khách hàng vượt ra ngoài giao dịch mua bán.",
    "group": "Customer",
    "domain": "Marketing",
    "dependent_variable": "Firm Performance (FP)",
    "reference": "Van Doorn et al. (2010)",
    "application_vi": "Sự gắn kết của khách hàng không chỉ là mua hàng mà còn là các hành vi như viết đánh giá, tham gia diễn đàn, và giới thiệu cho bạn bè.",
    "definition_long": "Hành vi Gắn kết của Khách hàng (CEB) là các hành vi của khách hàng đối với một thương hiệu hoặc công ty, vượt ra ngoài các giao dịch mua bán. Những hành vi này có thể là nhận thức, tình cảm, và/hoặc hành vi, và có thể mang tính tích cực hoặc tiêu cực.",
    "constructs_detailed": [
      { "name": "Cognitive Engagement (Gắn kết nhận thức)", "desc": "Mức độ xử lý thông tin và suy nghĩ của khách hàng về thương hiệu." },
      { "name": "Emotional Engagement (Gắn kết cảm xúc)", "desc": "Mức độ kết nối tình cảm của khách hàng với thương hiệu." },
      { "name": "Behavioral Engagement (Gắn kết hành vi)", "desc": "Các hành vi thực tế như truyền miệng, viết đánh giá, tham gia các sự kiện của thương hiệu." }
    ],
    "sample_scales": [
      "Tôi thường xuyên theo dõi tin tức và cập nhật từ thương hiệu này.",
      "Tôi tích cực giới thiệu thương hiệu này cho bạn bè và gia đình.",
      "Tôi sẵn lòng cung cấp phản hồi để giúp thương hiệu này cải thiện."
    ],
    "related_theories": ["Brand Resonance Model", "Relationship Marketing"],
    "limitations": "Việc đo lường sự gắn kết một cách toàn diện là một thách thức, vì nó là một khái niệm đa chiều và diễn ra trên nhiều kênh khác nhau (cả online và offline)."
  },
  {
    "id": 181,
    "theory": "Consumer Culture Theory (CCT)",
    "constructs_full": "Consumer Identity Projects; Marketplace Cultures; Sociohistoric Patterning of Consumption",
    "constructs_code": "CIP; MC; SPC",
    "note_vi": "Nghiên cứu tiêu dùng dưới góc độ văn hóa và xã hội.",
    "group": "Văn hóa",
    "domain": "Consumer Research",
    "dependent_variable": "Consumption Patterns (CP)",
    "reference": "Arnould & Thompson (2005)",
    "application_vi": "Nghiên cứu cách người tiêu dùng sử dụng các thương hiệu và sản phẩm để xây dựng bản sắc cá nhân và tham gia vào các tiểu văn hóa (vd: văn hóa 'sneakerhead').",
    "definition_long": "Lý thuyết Văn hóa Tiêu dùng (CCT) là một trường phái nghiên cứu người tiêu dùng tập trung vào các khía cạnh xã hội, văn hóa, và trải nghiệm của việc tiêu dùng. CCT xem xét tiêu dùng không chỉ là một hành vi cá nhân mà là một tập hợp các thực hành xã hội và văn hóa, trong đó người tiêu dùng sử dụng các nguồn lực từ thị trường để xây dựng bản sắc và các mối quan hệ xã hội.",
    "constructs_detailed": [
      { "name": "Consumer Identity Projects (Các dự án bản sắc người tiêu dùng)", "desc": "Cách người tiêu dùng sử dụng các sản phẩm và thương hiệu để tạo ra và thể hiện bản sắc của mình." },
      { "name": "Marketplace Cultures (Văn hóa thị trường)", "desc": "Cách người tiêu dùng hình thành các cộng đồng và tiểu văn hóa xung quanh các hoạt động tiêu dùng (ví dụ: cộng đồng người hâm mộ, câu lạc bộ xe hơi)." },
      { "name": "Sociohistoric Patterning of Consumption (Các mẫu hình tiêu dùng theo lịch sử xã hội)", "desc": "Cách các cấu trúc xã hội lớn hơn (như giai cấp, giới tính, dân tộc) định hình các mô hình tiêu dùng." }
    ],
    "sample_scales": [ "CCT là một phương pháp nghiên cứu định tính, sử dụng các kỹ thuật như dân tộc học (ethnography), phỏng vấn sâu và phân tích diễn ngôn." ],
    "related_theories": ["Social Identity Theory", "Brand Community Model"],
    "limitations": "Các phát hiện từ nghiên cứu CCT thường mang tính bối cảnh cao và có thể không dễ dàng tổng quát hóa cho các nhóm dân số lớn hơn."
  },
  {
    "id": 182,
    "theory": "Materialism",
    "constructs_full": "Acquisition Centrality; Acquisition as the Pursuit of Happiness; Possession-defined Success",
    "constructs_code": "AC; APH; PDS",
    "note_vi": "Chủ nghĩa vật chất và ảnh hưởng đến hành vi tiêu dùng và hạnh phúc.",
    "group": "Tiêu dùng",
    "domain": "Consumer Behavior",
    "dependent_variable": "Compulsive Buying (CB)",
    "reference": "Belk (1985); Richins & Dawson (1992)",
    "application_vi": "Nghiên cứu về chủ nghĩa vật chất, trong đó việc mua sắm và sở hữu tài sản được coi là trung tâm của cuộc sống và là thước đo thành công.",
    "definition_long": "Chủ nghĩa Vật chất là một hệ thống giá trị cá nhân coi trọng việc sở hữu tài sản vật chất. Những người có chủ nghĩa vật chất cao tin rằng việc sở hữu và mua sắm là trung tâm của cuộc sống, là chìa khóa dẫn đến hạnh phúc, và là thước đo cho sự thành công của bản thân và người khác.",
    "constructs_detailed": [
      { "name": "Acquisition Centrality (Mua sắm là trung tâm)", "desc": "Việc sở hữu và mua sắm chiếm một vị trí trung tâm trong cuộc sống của một người." },
      { "name": "Acquisition as the Pursuit of Happiness (Mua sắm là mưu cầu hạnh phúc)", "desc": "Niềm tin rằng việc sở hữu nhiều thứ hơn sẽ làm cho cuộc sống hạnh phúc hơn." },
      { "name": "Possession-defined Success (Sở hữu định nghĩa thành công)", "desc": "Xu hướng đánh giá sự thành công của bản thân và người khác dựa trên số lượng và chất lượng của những thứ họ sở hữu." }
    ],
    "sample_scales": [
      "Tôi ngưỡng mộ những người sở hữu những ngôi nhà, xe hơi và quần áo đắt tiền.",
      "Mua những thứ tôi không thực sự cần làm tôi cảm thấy tốt hơn.",
      "Cuộc sống của tôi sẽ tốt hơn nếu tôi sở hữu những thứ nhất định mà tôi không có."
    ],
    "related_theories": ["Consumer Culture Theory (CCT)"],
    "limitations": "Mối quan hệ giữa chủ nghĩa vật chất và hạnh phúc rất phức tạp. Mặc dù nó thường liên quan đến mức độ hạnh phúc thấp hơn, nhưng mối quan hệ này có thể bị ảnh hưởng bởi các yếu tố văn hóa và kinh tế xã hội."
  },
  {
    "id": 183,
    "theory": "Country of Origin (COO) Effect",
    "constructs_full": "COO Image; Product Evaluation; Brand Attitude",
    "constructs_code": "COO; PE; BA",
    "note_vi": "Ảnh hưởng của quốc gia xuất xứ đến nhận thức và đánh giá sản phẩm.",
    "group": "Branding",
    "domain": "International Marketing",
    "dependent_variable": "Purchase Intention (PI)",
    "reference": "COO literature",
    "application_vi": "Người tiêu dùng thường có nhận thức rằng hàng hóa sản xuất tại Đức (COO) có chất lượng kỹ thuật cao, hoặc thời trang từ Ý thì sành điệu.",
    "definition_long": "Hiệu ứng Quốc gia Xuất xứ (COO) đề cập đến tác động mà quốc gia sản xuất của một sản phẩm có đối với nhận thức và đánh giá của người tiêu dùng về sản phẩm đó. Người tiêu dùng thường sử dụng COO như một tín hiệu để suy ra chất lượng và các thuộc tính khác của sản phẩm, đặc biệt khi họ thiếu thông tin khác.",
    "constructs_detailed": [
      { "name": "COO Image (Hình ảnh quốc gia xuất xứ)", "desc": "Tập hợp các niềm tin và ấn tượng mà người tiêu dùng có về một quốc gia cụ thể." },
      { "name": "Product Evaluation (Đánh giá sản phẩm)", "desc": "Đánh giá tổng thể của người tiêu dùng về sản phẩm." }
    ],
    "sample_scales": [
      "Các sản phẩm được sản xuất tại [tên quốc gia] thường có chất lượng rất cao.",
      "Tôi thích mua các sản phẩm được sản xuất tại [tên quốc gia]."
    ],
    "related_theories": ["Signaling Theory", "Price-Quality Inference"],
    "limitations": "Tầm quan trọng của COO có thể giảm đi khi người tiêu dùng có các thông tin khác như thương hiệu, giá cả, hoặc kinh nghiệm cá nhân. Trong một thế giới toàn cầu hóa, việc xác định một 'quốc gia xuất xứ' duy nhất cũng trở nên khó khăn hơn."
  },
  {
    "id": 184,
    "theory": "Digital Divide",
    "constructs_full": "Access; Skills; Usage; Outcomes",
    "constructs_code": "ACC; SKI; USA; OUT",
    "note_vi": "Khoảng cách kỹ thuật số về truy cập và kỹ năng sử dụng công nghệ.",
    "group": "Công nghệ",
    "domain": "Sociology, Policy",
    "dependent_variable": "Social/Economic Inequality (SEI)",
    "reference": "Digital divide literature",
    "application_vi": "Nghiên cứu về khoảng cách kỹ thuật số giữa các nhóm dân cư khác nhau về khả năng truy cập, kỹ năng sử dụng và lợi ích thu được từ internet.",
    "definition_long": "Khoảng cách Kỹ thuật số đề cập đến sự chênh lệch giữa các nhóm nhân khẩu học và khu vực địa lý khác nhau về cơ hội tiếp cận công nghệ thông tin và truyền thông (ICT) và việc sử dụng internet. Ban đầu, nó chỉ tập trung vào khoảng cách về 'truy cập', nhưng giờ đây đã mở rộng để bao gồm cả khoảng cách về 'kỹ năng' và 'kết quả'.",
    "constructs_detailed": [
      { "name": "Access Divide (Khoảng cách truy cập)", "desc": "Sự khác biệt trong việc truy cập vật lý vào công nghệ (ví dụ: có máy tính, có kết nối internet)." },
      { "name": "Skills Divide (Khoảng cách kỹ năng)", "desc": "Sự khác biệt về khả năng sử dụng công nghệ một cách hiệu quả." },
      { "name": "Usage Divide (Khoảng cách sử dụng)", "desc": "Sự khác biệt về cách mọi người sử dụng internet (ví dụ: chỉ để giải trí so với để học tập và phát triển kinh tế)." },
      { "name": "Outcomes Divide (Khoảng cách kết quả)", "desc": "Sự khác biệt về các lợi ích hữu hình mà mọi người nhận được từ việc sử dụng internet." }
    ],
    "sample_scales": [ "Thường được đo lường bằng dữ liệu khảo sát nhân khẩu học và hành vi sử dụng internet." ],
    "related_theories": [],
    "limitations": "Bản chất của khoảng cách kỹ thuật số liên tục thay đổi khi công nghệ phát triển. Ví dụ, khoảng cách về truy cập di động đang thu hẹp, nhưng khoảng cách về kỹ năng AI có thể đang mở rộng."
  },
  {
    "id": 185,
    "theory": "Privacy Calculus Theory",
    "constructs_full": "Perceived Risk; Perceived Benefit; Disclosure Intention",
    "constructs_code": "PR; PB; DI",
    "note_vi": "Người dùng cân nhắc giữa rủi ro và lợi ích khi chia sẻ thông tin cá nhân.",
    "group": "Công nghệ",
    "domain": "IS, E-commerce",
    "dependent_variable": "Information Disclosure (ID)",
    "reference": "Dinev & Hart (2006)",
    "application_vi": "Người dùng cân nhắc giữa lợi ích (nhận được dịch vụ cá nhân hóa) và rủi ro (mất riêng tư) khi quyết định có chia sẻ thông tin cá nhân cho một ứng dụng hay không.",
    "definition_long": "Lý thuyết Tính toán Riêng tư cho rằng quyết định của một cá nhân về việc tiết lộ thông tin cá nhân là một quá trình tính toán hợp lý, trong đó họ cân nhắc giữa các lợi ích cảm nhận và các rủi ro cảm nhận. Nếu lợi ích cảm nhận vượt qua rủi ro cảm nhận, họ sẽ có nhiều khả năng tiết lộ thông tin hơn.",
    "constructs_detailed": [
      { "name": "Perceived Risk (Rủi ro cảm nhận)", "desc": "Các rủi ro tiềm tàng liên quan đến việc tiết lộ thông tin, chẳng hạn như lạm dụng dữ liệu hoặc mất quyền kiểm soát." },
      { "name": "Perceived Benefit (Lợi ích cảm nhận)", "desc": "Các lợi ích tiềm tàng từ việc tiết lộ thông tin, chẳng hạn như sự tiện lợi, cá nhân hóa, hoặc phần thưởng kinh tế." },
      { "name": "Disclosure Intention (Ý định tiết lộ)", "desc": "Ý định của cá nhân trong việc cung cấp thông tin cá nhân." }
    ],
    "sample_scales": [
      "Tôi lo lắng về việc công ty này có thể làm gì với thông tin cá nhân của tôi.",
      "Việc cung cấp thông tin cá nhân của tôi cho phép tôi nhận được các đề xuất tốt hơn.",
      "Tôi sẵn lòng cung cấp thông tin cá nhân của mình cho trang web này."
    ],
    "related_theories": ["Perceived Risk Theory"],
    "limitations": "Quá trình tính toán này có thể không phải lúc nào cũng hợp lý. Nó bị ảnh hưởng bởi các thiên kiến nhận thức, cảm xúc, và sự thiếu hiểu biết về cách dữ liệu được sử dụng. Hiện tượng này còn được gọi là 'nghịch lý riêng tư' (privacy paradox)."
  },
  {
    "id": 186,
    "theory": "AI Acceptance Model",
    "constructs_full": "Perceived Intelligence; Anthropomorphism; Trust in AI; Adoption Intention",
    "constructs_code": "PI; ANT; TAI; AI",
    "note_vi": "Các yếu tố ảnh hưởng đến việc chấp nhận công nghệ trí tuệ nhân tạo.",
    "group": "Công nghệ",
    "domain": "AI, Robotics",
    "dependent_variable": "AI Service Adoption (ASA)",
    "reference": "AI acceptance literature",
    "application_vi": "Việc người dùng có chấp nhận sử dụng một trợ lý ảo hay không phụ thuộc vào cảm nhận về sự thông minh, sự tin tưởng và mức độ 'giống người' của nó.",
    "definition_long": "Mô hình Chấp nhận Trí tuệ Nhân tạo (AI) là sự mở rộng của các mô hình chấp nhận công nghệ truyền thống (như TAM) để bao gồm các yếu tố đặc thù của AI. Các mô hình này thường xem xét các khía cạnh như sự thông minh cảm nhận, mức độ giống người, và sự tin tưởng vào hệ thống AI để giải thích ý định chấp nhận của người dùng.",
    "constructs_detailed": [
      { "name": "Perceived Intelligence (Sự thông minh cảm nhận)", "desc": "Nhận thức của người dùng về khả năng của hệ thống AI trong việc thực hiện các nhiệm vụ thông minh." },
      { "name": "Anthropomorphism (Nhân cách hóa)", "desc": "Xu hướng gán các đặc điểm của con người cho hệ thống AI." },
      { "name": "Trust in AI (Sự tin tưởng vào AI)", "desc": "Niềm tin của người dùng rằng hệ thống AI sẽ hành động một cách đáng tin cậy, an toàn và có đạo đức." }
    ],
    "sample_scales": [
      "Tôi tin rằng trợ lý ảo này rất thông minh.",
      "Tương tác với chatbot này có cảm giác giống như nói chuyện với một người thật.",
      "Tôi tin tưởng vào các khuyến nghị do hệ thống AI này đưa ra."
    ],
    "related_theories": ["TAM", "UTAUT"],
    "limitations": "Lĩnh vực chấp nhận AI vẫn còn mới và đang phát triển nhanh chóng. Các yếu tố ảnh hưởng có thể rất khác nhau tùy thuộc vào loại ứng dụng AI (ví dụ: chatbot so với xe tự lái)."
  },
  {
    "id": 187,
    "theory": "Sharing Economy Participation",
    "constructs_full": "Economic Benefits; Social Benefits; Environmental Benefits; Trust; Perceived Risk",
    "constructs_code": "EB; SB; ENB; TRU; PR",
    "note_vi": "Động lực và rào cản tham gia vào kinh tế chia sẻ (vd: Airbnb, Grab).",
    "group": "Kinh tế chia sẻ",
    "domain": "Consumer Behavior",
    "dependent_variable": "Participation Intention (PI)",
    "reference": "Sharing economy literature",
    "application_vi": "Động lực tham gia Airbnb bao gồm lợi ích kinh tế (cho thuê nhà), lợi ích xã hội (gặp gỡ người mới) và sự tin tưởng vào nền tảng.",
    "definition_long": "Việc tham gia vào Kinh tế Chia sẻ được thúc đẩy bởi một loạt các động cơ và bị cản trở bởi các rào cản khác nhau. Các mô hình nghiên cứu thường xem xét sự cân bằng giữa các lợi ích (kinh tế, xã hội, môi trường) và các rủi ro cảm nhận. Niềm tin vào cả nền tảng và các người dùng khác là một yếu tố cực kỳ quan trọng.",
    "constructs_detailed": [
      { "name": "Economic Benefits (Lợi ích kinh tế)", "desc": "Các động cơ tài chính như tiết kiệm tiền hoặc kiếm thêm thu nhập." },
      { "name": "Social Benefits (Lợi ích xã hội)", "desc": "Các động cơ như kết nối với người khác và cảm giác thuộc về một cộng đồng." },
      { "name": "Environmental Benefits (Lợi ích môi trường)", "desc": "Niềm tin rằng việc chia sẻ giúp giảm lãng phí và tiêu thụ tài nguyên." },
      { "name": "Trust (Niềm tin)", "desc": "Sự tin tưởng vào nền tảng và các người dùng khác (ví dụ: chủ nhà, khách thuê)." }
    ],
    "sample_scales": [
      "Sử dụng dịch vụ này giúp tôi tiết kiệm được nhiều tiền.",
      "Tôi thích khía cạnh cộng đồng của việc sử dụng nền tảng này.",
      "Tôi tin tưởng vào hệ thống đánh giá của nền tảng này để đảm bảo an toàn."
    ],
    "related_theories": ["Trust", "Perceived Risk Theory"],
    "limitations": "Động cơ tham gia có thể rất khác nhau giữa các nền tảng (ví dụ: Airbnb so với Uber) và giữa các vai trò khác nhau (ví dụ: người cung cấp so với người tiêu dùng)."
  },
  {
    "id": 188,
    "theory": "B2B Relationship Stages",
    "constructs_full": "Awareness; Exploration; Expansion; Commitment; Dissolution",
    "constructs_code": "AWA; EXP; EXPN; COM; DIS",
    "note_vi": "Các giai đoạn phát triển của mối quan hệ kinh doanh B2B.",
    "group": "B2B",
    "domain": "Relationship Marketing",
    "dependent_variable": "Relationship Quality (RQ)",
    "reference": "Dwyer et al. (1987)",
    "application_vi": "Mô tả các giai đoạn của một mối quan hệ kinh doanh, từ lúc nhận biết ban đầu, thăm dò, mở rộng hợp tác đến cam kết lâu dài.",
    "definition_long": "Mô hình Giai đoạn Quan hệ B2B mô tả một quá trình phát triển của mối quan hệ giữa người mua và người bán. Mối quan hệ không hình thành ngay lập tức mà tiến triển qua một loạt các giai đoạn, từ nhận biết ban đầu đến cam kết sâu sắc, và cũng có thể kết thúc bằng sự tan rã.",
    "constructs_detailed": [
      { "name": "Awareness (Nhận biết)", "desc": "Các bên nhận ra rằng bên kia là một đối tác khả thi." },
      { "name": "Exploration (Thăm dò)", "desc": "Giai đoạn thử nghiệm, trong đó các bên kiểm tra khả năng và hiệu suất của nhau thông qua các giao dịch nhỏ." },
      { "name": "Expansion (Mở rộng)", "desc": "Sự gia tăng sự phụ thuộc lẫn nhau và sự hài lòng từ các giao dịch ban đầu." },
      { "name": "Commitment (Cam kết)", "desc": "Cả hai bên đều đầu tư và cam kết duy trì mối quan hệ lâu dài." },
      { "name": "Dissolution (Tan rã)", "desc": "Quá trình kết thúc mối quan hệ." }
    ],
    "sample_scales": [ "Đây là một mô hình khái niệm, thường được sử dụng để phân tích định tính các trường hợp kinh doanh." ],
    "related_theories": ["Relationship Marketing", "Social Exchange Theory"],
    "limitations": "Không phải tất cả các mối quan hệ đều đi theo một chu trình tuyến tính như vậy. Một số có thể bỏ qua các giai đoạn hoặc duy trì ở giai đoạn thăm dò trong một thời gian dài."
  },
   {
    "id": 101,
    "theory": "Service Blueprinting",
    "constructs_full": "Frontstage Actions; Backstage Actions; Support Processes; Customer Actions",
    "constructs_code": "FS; BS; SP; CA",
    "note_vi": "Công cụ mô tả quy trình dịch vụ để tối ưu điểm tiếp xúc.",
    "group": "Service Design",
    "domain": "Operations, CX",
    "dependent_variable": "Service Quality (SQ)",
    "reference": "Service design literature",
    "application_vi": "Một nhà hàng vẽ sơ đồ quy trình dịch vụ để tối ưu hóa mọi thứ từ lúc khách hàng đặt bàn, gọi món, đến các hoạt động trong bếp.",
    "definition_long": "Sơ đồ Dịch vụ là một kỹ thuật trực quan hóa, mô tả chi tiết một quy trình dịch vụ. Nó giúp phân tách rõ ràng giữa các hoạt động mà khách hàng thấy (frontstage) và không thấy (backstage), cũng như các quy trình hỗ trợ. Mục tiêu là để hiểu rõ hành trình của khách hàng, xác định các điểm yếu (pain points) và cơ hội cải tiến.",
    "constructs_detailed": [
      { "name": "Customer Actions (Hành động của khách hàng)", "desc": "Các bước mà khách hàng thực hiện trong quá trình trải nghiệm dịch vụ." },
      { "name": "Frontstage Actions (Hành động tiền sảnh)", "desc": "Các hành động của nhân viên tiếp xúc trực tiếp với khách hàng." },
      { "name": "Backstage Actions (Hành động hậu trường)", "desc": "Các hành động của nhân viên mà khách hàng không thấy nhưng cần thiết để hỗ trợ hành động tiền sảnh." },
      { "name": "Support Processes (Quy trình hỗ trợ)", "desc": "Các hoạt động nội bộ hỗ trợ nhân viên cung cấp dịch vụ." }
    ],
    "sample_scales": [ "Đây là một công cụ phân tích và thiết kế định tính, không sử dụng thang đo." ],
    "related_theories": ["Customer Experience (CX) Framework", "SERVQUAL"],
    "limitations": "Sơ đồ có thể trở nên rất phức tạp đối với các dịch vụ có nhiều biến thể hoặc điểm chạm. Nó mô tả quy trình hiện tại nhưng không tự động đưa ra giải pháp."
  },
  {
    "id": 102,
    "theory": "Jobs to be Done (JTBD)",
    "constructs_full": "Functional Jobs; Emotional Jobs; Social Jobs; Context",
    "constructs_code": "FJ; EJ; SJ; CTX",
    "note_vi": "Hiểu công việc người dùng cần hoàn thành để thiết kế giải pháp phù hợp.",
    "group": "Innovation, Marketing",
    "domain": "Product Strategy",
    "dependent_variable": "Adoption (AD)",
    "reference": "JTBD literature",
    "application_vi": "Người ta 'thuê' một ly milkshake cho 'công việc' làm cho chuyến đi buổi sáng bớt nhàm chán, chứ không chỉ để giải khát.",
    "definition_long": "Jobs to be Done là một lý thuyết cho rằng khách hàng không mua sản phẩm, mà họ 'thuê' chúng để hoàn thành một 'công việc' cụ thể trong cuộc sống của họ. Bằng cách tập trung vào công việc cơ bản mà khách hàng đang cố gắng thực hiện, các công ty có thể đổi mới và tạo ra các giải pháp tốt hơn thay vì chỉ cải tiến các tính năng của sản phẩm hiện có.",
    "constructs_detailed": [
      { "name": "Functional Jobs (Công việc chức năng)", "desc": "Nhiệm vụ thực tế, khách quan mà khách hàng muốn hoàn thành." },
      { "name": "Emotional Jobs (Công việc cảm xúc)", "desc": "Cách khách hàng muốn cảm nhận trong một bối cảnh nhất định." },
      { "name": "Social Jobs (Công việc xã hội)", "desc": "Cách khách hàng muốn được người khác nhìn nhận." },
      { "name": "Context (Bối cảnh)", "desc": "Tình huống cụ thể mà công việc phát sinh." }
    ],
    "sample_scales": [ "JTBD là một phương pháp nghiên cứu định tính, thường sử dụng các cuộc phỏng vấn sâu để khám phá 'công việc' chứ không dùng thang đo." ],
    "related_theories": ["Design Thinking", "Customer Perceived Value"],
    "limitations": "Việc xác định đúng 'công việc' đòi hỏi kỹ năng nghiên cứu định tính cao. Có thể có nhiều 'công việc' khác nhau cho cùng một sản phẩm, gây khó khăn trong việc ưu tiên."
  },
  {
    "id": 103,
    "theory": "Behavioral Intention-Behavior Gap",
    "constructs_full": "Behavioral Intention; Actual Behavior; Habit; Contextual Barriers",
    "constructs_code": "BI; AB; HAB; CB",
    "note_vi": "Giải thích khoảng cách giữa ý định và hành vi thực tế.",
    "group": "Hành vi",
    "domain": "Consumer Behavior",
    "dependent_variable": "Actual Purchase (AP)",
    "reference": "Sheeran (2002)",
    "application_vi": "Nhiều người có ý định ăn uống lành mạnh nhưng cuối cùng lại chọn đồ ăn nhanh vì sự tiện lợi và thói quen.",
    "definition_long": "Khoảng cách Ý định-Hành vi đề cập đến hiện tượng mọi người thường không thực hiện hành vi mà họ đã có ý định. Mặc dù ý định là một yếu tố dự báo quan trọng, nhưng nhiều yếu tố khác như thói quen, rào cản từ môi trường, hoặc sự tự kiểm soát có thể can thiệp vào quá trình chuyển đổi từ ý định sang hành động.",
    "constructs_detailed": [
      { "name": "Behavioral Intention (Ý định hành vi)", "desc": "Sự sẵn sàng và kế hoạch của một người để thực hiện một hành vi." },
      { "name": "Actual Behavior (Hành vi thực tế)", "desc": "Hành động được thực hiện trên thực tế." },
      { "name": "Contextual Barriers (Rào cản bối cảnh)", "desc": "Các yếu tố từ môi trường cản trở việc thực hiện hành vi (ví dụ: thiếu thời gian, thiếu sản phẩm)." }
    ],
    "sample_scales": [
      "Tôi có ý định đi tập thể dục ba lần trong tuần này.",
      "Sự bận rộn trong công việc thường ngăn cản tôi thực hiện ý định của mình."
    ],
    "related_theories": ["Theory of Planned Behavior (TPB)"],
    "limitations": "Việc đo lường chính xác tất cả các yếu tố can thiệp (ví dụ: cảm xúc tức thời, các sự kiện bất ngờ) là rất khó khăn."
  },
  {
    "id": 104,
    "theory": "Customer Perceived Value",
    "constructs_full": "Functional Value; Emotional Value; Social Value; Perceived Cost",
    "constructs_code": "FV; EV; SV; PC",
    "note_vi": "Giá trị cảm nhận quyết định hành vi tiêu dùng.",
    "group": "Customer",
    "domain": "Marketing",
    "dependent_variable": "Purchase Intention (PI)",
    "reference": "Zeithaml (1988)",
    "application_vi": "Khách hàng mua một chiếc túi hàng hiệu không chỉ vì giá trị chức năng (đựng đồ) mà còn vì giá trị cảm xúc và xã hội mà nó mang lại.",
    "definition_long": "Giá trị Cảm nhận của Khách hàng là sự đánh giá tổng thể của người tiêu dùng về lợi ích của một sản phẩm hoặc dịch vụ dựa trên nhận thức của họ về những gì nhận được và những gì phải hy sinh. Đó là một sự cân bằng giữa 'lợi ích' (ví dụ: chất lượng, dịch vụ) và 'chi phí' (ví dụ: tiền bạc, thời gian, nỗ lực).",
    "constructs_detailed": [
      { "name": "Functional Value (Giá trị chức năng)", "desc": "Lợi ích thực tế, hữu dụng mà sản phẩm mang lại." },
      { "name": "Emotional Value (Giá trị cảm xúc)", "desc": "Cảm xúc hoặc tình cảm mà sản phẩm tạo ra." },
      { "name": "Social Value (Giá trị xã hội)", "desc": "Khả năng của sản phẩm trong việc nâng cao hình ảnh xã hội của người tiêu dùng." },
      { "name": "Perceived Cost (Chi phí cảm nhận)", "desc": "Tất cả những gì khách hàng phải từ bỏ, bao gồm cả tiền bạc và phi tiền tệ." }
    ],
    "sample_scales": [
      "Sản phẩm này rất hữu ích cho tôi.",
      "Sử dụng sản phẩm này làm tôi cảm thấy vui vẻ.",
      "So với những lợi ích nhận được, giá của sản phẩm này rất hợp lý."
    ],
    "related_theories": ["Jobs to be Done (JTBD)"],
    "limitations": "Giá trị cảm nhận là một khái niệm rất chủ quan và có thể thay đổi nhanh chóng tùy thuộc vào bối cảnh và các lựa chọn thay thế có sẵn."
  },
  {
    "id": 105,
    "theory": "Van Westendorp Price Sensitivity Model",
    "constructs_full": "Too Cheap; Cheap; Expensive; Too Expensive; Optimal Price",
    "constructs_code": "TC; CH; EX; TE; OP",
    "note_vi": "Phương pháp xác định vùng giá chấp nhận của khách hàng.",
    "group": "Pricing",
    "domain": "Market Research",
    "dependent_variable": "Optimal Price (OP)",
    "reference": "Van Westendorp (1976)",
    "application_vi": "Công ty thực hiện khảo sát để xác định khoảng giá chấp nhận được cho một sản phẩm mới, tìm ra mức giá tối ưu không quá rẻ cũng không quá đắt.",
    "definition_long": "Mô hình Độ nhạy cảm về giá của Van Westendorp là một kỹ thuật nghiên cứu thị trường để xác định một loạt các mức giá chấp nhận được trong tâm trí của người tiêu dùng. Nó dựa trên việc hỏi bốn câu hỏi về giá cả để xác định các điểm giá quan trọng, từ đó tìm ra khoảng giá tối ưu và mức giá tối ưu.",
    "constructs_detailed": [
      { "name": "Too Cheap (Quá rẻ)", "desc": "Ở mức giá nào bạn sẽ bắt đầu nghi ngờ về chất lượng của sản phẩm?" },
      { "name": "Cheap (Rẻ/Hời)", "desc": "Ở mức giá nào bạn sẽ coi sản phẩm này là một món hời?" },
      { "name": "Expensive (Đắt)", "desc": "Ở mức giá nào bạn sẽ bắt đầu thấy sản phẩm này đắt, nhưng vẫn cân nhắc mua?" },
      { "name": "Too Expensive (Quá đắt)", "desc": "Ở mức giá nào bạn sẽ cho rằng sản phẩm này quá đắt và không mua?" }
    ],
    "sample_scales": [ "Kỹ thuật này sử dụng các câu hỏi trực tiếp về giá cả, không dùng thang đo Likert." ],
    "related_theories": ["Psychological Pricing"],
    "limitations": "Phương pháp này không xem xét đến các yếu tố cạnh tranh. Nó cũng giả định rằng người tiêu dùng có thể đánh giá chính xác giá trị của sản phẩm mà không có bối cảnh mua hàng thực tế."
  },
  {
    "id": 106,
    "theory": "Conjoint Analysis Framework",
    "constructs_full": "Attribute Levels; Part-worth Utilities; Choice Share",
    "constructs_code": "AL; PW; CS",
    "note_vi": "Phân tích ưu tiên thuộc tính và sẵn sàng trả của khách hàng.",
    "group": "Market Research",
    "domain": "Product Design",
    "dependent_variable": "Preference (PREF)",
    "reference": "Conjoint literature",
    "application_vi": "Hãng laptop khảo sát để biết người dùng ưu tiên yếu tố nào nhất (thời lượng pin, trọng lượng, hay giá cả) khi thiết kế sản phẩm mới.",
    "definition_long": "Phân tích Liên hợp là một kỹ thuật thống kê được sử dụng trong nghiên cứu thị trường để xác định tầm quan trọng tương đối của các thuộc tính khác nhau của một sản phẩm đối với người tiêu dùng. Người trả lời được yêu cầu đánh giá hoặc lựa chọn giữa các hồ sơ sản phẩm khác nhau, mỗi hồ sơ là một sự kết hợp của các cấp độ thuộc tính.",
    "constructs_detailed": [
      { "name": "Attribute Levels (Cấp độ thuộc tính)", "desc": "Các biến thể của một thuộc tính (ví dụ: thuộc tính 'màu sắc' có các cấp độ 'đỏ', 'xanh', 'đen')." },
      { "name": "Part-worth Utilities (Giá trị hữu dụng từng phần)", "desc": "Giá trị số liệu thống kê được tính toán cho mỗi cấp độ thuộc tính, phản ánh mức độ ưa thích của người tiêu dùng đối với nó." }
    ],
    "sample_scales": [ "Người tham gia được hiển thị các bộ sản phẩm và được yêu cầu chọn sản phẩm họ thích nhất, hoặc xếp hạng chúng." ],
    "related_theories": ["Customer Perceived Value"],
    "limitations": "Việc thiết kế một nghiên cứu liên hợp đòi hỏi chuyên môn kỹ thuật. Nó có thể trở nên quá phức tạp cho người trả lời nếu có quá nhiều thuộc tính và cấp độ."
  },
  {
    "id": 107,
    "theory": "Diffusion of Responsibility (Groups)",
    "constructs_full": "Group Size; Perceived Responsibility; Helping Behavior",
    "constructs_code": "GS; PR; HB",
    "note_vi": "Trong nhóm, trách nhiệm cá nhân giảm khi có nhiều người hiện diện.",
    "group": "Social Psychology",
    "domain": "Teams, CSR",
    "dependent_variable": "Intervention Likelihood (IL)",
    "reference": "Darley & Latané (1968)",
    "application_vi": "Trong một cuộc họp nhóm lớn, các thành viên thường có xu hướng ít đưa ra ý kiến hơn vì cho rằng 'người khác sẽ nói'.",
    "definition_long": "Khuếch tán Trách nhiệm là một hiện tượng tâm lý xã hội theo đó một người ít có khả năng nhận trách nhiệm về hành động hoặc không hành động khi có những người khác cũng có mặt. Cá nhân cho rằng người khác sẽ chịu trách nhiệm hoặc đã làm như vậy rồi. Đây là một hình thức của hiệu ứng người ngoài cuộc (bystander effect).",
    "constructs_detailed": [
      { "name": "Group Size (Quy mô nhóm)", "desc": "Số lượng người có mặt trong một tình huống." },
      { "name": "Perceived Responsibility (Trách nhiệm cảm nhận)", "desc": "Mức độ một cá nhân cảm thấy có trách nhiệm cá nhân phải hành động." }
    ],
    "sample_scales": [ "Thường được nghiên cứu thông qua các thí nghiệm xã hội hơn là khảo sát." ],
    "related_theories": ["Social Proof (Cialdini)"],
    "limitations": "Hiệu ứng này có thể bị giảm bớt nếu các thành viên trong nhóm quen biết nhau, hoặc nếu vai trò và trách nhiệm của mỗi người được xác định rõ ràng."
  },
  {
    "id": 108,
    "theory": "Social Capital Theory",
    "constructs_full": "Structural Capital; Relational Capital; Cognitive Capital",
    "constructs_code": "SC; RC; CC",
    "note_vi": "Vốn xã hội hỗ trợ chia sẻ tri thức và kết quả tổ chức.",
    "group": "Organizational",
    "domain": "Knowledge Management",
    "dependent_variable": "Performance (PERF)",
    "reference": "Nahapiet & Ghoshal (1998)",
    "application_vi": "Mối quan hệ tin cậy và mạng lưới vững chắc giữa các nhân viên giúp họ chia sẻ kiến thức và hợp tác hiệu quả hơn.",
    "definition_long": "Lý thuyết Vốn Xã hội cho rằng các mạng lưới quan hệ xã hội là một nguồn lực có giá trị. Các mối quan hệ này tạo ra lợi ích cho các cá nhân và tập thể thông qua việc tạo điều kiện cho sự tin tưởng, hợp tác và chia sẻ thông tin. Vốn xã hội thường được chia thành ba chiều: cấu trúc, quan hệ và nhận thức.",
    "constructs_detailed": [
      { "name": "Structural Capital (Vốn cấu trúc)", "desc": "Cấu trúc tổng thể của mạng lưới, chẳng hạn như ai kết nối với ai và các mô hình tương tác." },
      { "name": "Relational Capital (Vốn quan hệ)", "desc": "Bản chất của các mối quan hệ cá nhân, bao gồm niềm tin, sự tôn trọng và tình bạn." },
      { "name": "Cognitive Capital (Vốn nhận thức)", "desc": "Các nguồn lực cung cấp ý nghĩa và sự diễn giải chung, chẳng hạn như ngôn ngữ chung, tầm nhìn và giá trị chung." }
    ],
    "sample_scales": [
      "Tôi có một mạng lưới quan hệ rộng rãi trong công ty này.",
      "Tôi hoàn toàn tin tưởng các đồng nghiệp trong nhóm của mình.",
      "Chúng tôi có chung một tầm nhìn rõ ràng về mục tiêu của nhóm."
    ],
    "related_theories": ["Social Network Theory"],
    "limitations": "Vốn xã hội mạnh trong một nhóm có thể cản trở sự kết nối với các nhóm khác, dẫn đến tư duy nhóm (groupthink) và hạn chế sự đa dạng về thông tin."
  },
  {
    "id": 109,
    "theory": "Transformational Leadership",
    "constructs_full": "Idealized Influence; Inspirational Motivation; Intellectual Stimulation; Individualized Consideration",
    "constructs_code": "II; IM; IS; IC",
    "note_vi": "Lãnh đạo thúc đẩy động lực, đổi mới và hiệu suất nhân viên.",
    "group": "Leadership",
    "domain": "Organization",
    "dependent_variable": "Follower Performance (FP)",
    "reference": "Bass (1985)",
    "application_vi": "Nhà lãnh đạo truyền cảm hứng bằng một tầm nhìn lớn, khuyến khích sự sáng tạo và quan tâm đến sự phát triển của từng cá nhân trong nhóm.",
    "definition_long": "Lãnh đạo Chuyển đổi là một phong cách lãnh đạo trong đó nhà lãnh đạo làm việc với các nhóm để xác định sự thay đổi cần thiết, tạo ra một tầm nhìn để hướng dẫn sự thay đổi thông qua cảm hứng, và thực hiện sự thay đổi cùng với các thành viên tận tụy của nhóm. Phong cách này nâng cao động lực, tinh thần và hiệu suất của nhân viên.",
    "constructs_detailed": [
      { "name": "Idealized Influence (Ảnh hưởng lý tưởng hóa)", "desc": "Đóng vai trò là một hình mẫu đáng ngưỡng mộ, tạo ra sự tin tưởng và tôn trọng." },
      { "name": "Inspirational Motivation (Động viên truyền cảm hứng)", "desc": "Truyền đạt một tầm nhìn hấp dẫn và thể hiện sự lạc quan về tương lai." },
      { "name": "Intellectual Stimulation (Kích thích trí tuệ)", "desc": "Thách thức các giả định, chấp nhận rủi ro và khuyến khích sự sáng tạo của nhân viên." },
      { "name": "Individualized Consideration (Quan tâm cá nhân)", "desc": "Đóng vai trò là một người huấn luyện hoặc cố vấn, lắng nghe và hỗ trợ nhu cầu của từng nhân viên." }
    ],
    "sample_scales": [
      "Lãnh đạo của tôi hành động theo cách khiến tôi tôn trọng.",
      "Lãnh đạo của tôi nói về tương lai một cách đầy nhiệt huyết.",
      "Lãnh đạo của tôi khuyến khích tôi nhìn nhận các vấn đề từ những góc độ khác nhau."
    ],
    "related_theories": ["Transactional Leadership", "Authentic Leadership"],
    "limitations": "Phong cách này có thể không hiệu quả trong mọi tình huống, đặc biệt là trong các môi trường đòi hỏi sự tuân thủ quy trình nghiêm ngặt hoặc trong các cuộc khủng hoảng cần ra quyết định nhanh chóng."
  },
  {
    "id": 110,
    "theory": "Transactional Leadership",
    "constructs_full": "Contingent Reward; Management by Exception",
    "constructs_code": "CR; MBE",
    "note_vi": "Lãnh đạo theo trao đổi phần thưởng & giám sát.",
    "group": "Leadership",
    "domain": "Management",
    "dependent_variable": "Task Performance (TP)",
    "reference": "Burns & Bass literature",
    "application_vi": "Quản lý theo kiểu 'nếu bạn hoàn thành mục tiêu, bạn sẽ được thưởng' và chỉ can thiệp khi có vấn đề xảy ra.",
    "definition_long": "Lãnh đạo Giao dịch là một phong cách lãnh đạo tập trung vào sự giám sát, tổ chức và hiệu suất. Nhà lãnh đạo thúc đẩy nhân viên thông qua các phần thưởng và hình phạt. Mối quan hệ này dựa trên một cuộc 'giao dịch': nhân viên tuân thủ và đổi lại sẽ nhận được lương hoặc các lợi ích khác.",
    "constructs_detailed": [
      { "name": "Contingent Reward (Phần thưởng có điều kiện)", "desc": "Làm rõ những gì được mong đợi và trao thưởng khi các mục tiêu được đáp ứng." },
      { "name": "Management by Exception (Quản lý theo ngoại lệ)", "desc": "Can thiệp chỉ khi các tiêu chuẩn không được đáp ứng. Có thể là chủ động (theo dõi sai lệch) hoặc bị động (chỉ can thiệp khi vấn đề đã xảy ra)." }
    ],
    "sample_scales": [
      "Lãnh đạo của tôi làm rõ những gì tôi có thể nhận được nếu tôi làm tốt công việc.",
      "Lãnh đạo của tôi chỉ chú ý đến tôi khi tôi mắc lỗi."
    ],
    "related_theories": ["Transformational Leadership"],
    "limitations": "Phong cách này thường không thúc đẩy sự sáng tạo hoặc động lực nội tại. Nó hiệu quả để hoàn thành các nhiệm vụ cụ thể nhưng không tạo ra sự cam kết lâu dài."
  },
  {
    "id": 111,
    "theory": "Leader-Member Exchange (LMX)",
    "constructs_full": "Leader Support; Trust; Role Clarity; Relationship Quality",
    "constructs_code": "LS; TR; RC; RQ",
    "note_vi": "Chất lượng quan hệ lãnh đạo-nhân viên ảnh hưởng hiệu suất và thái độ.",
    "group": "Leadership",
    "domain": "HR",
    "dependent_variable": "Job Satisfaction (JS)",
    "reference": "Graen & Uhl-Bien (1995)",
    "application_vi": "Chất lượng mối quan hệ giữa sếp và nhân viên (có sự tin tưởng, hỗ trợ cao) ảnh hưởng trực tiếp đến hiệu suất và sự hài lòng của nhân viên đó.",
    "definition_long": "Lý thuyết Trao đổi Lãnh đạo-Thành viên (LMX) cho rằng các nhà lãnh đạo phát triển các mối quan hệ trao đổi khác nhau với các thành viên khác nhau. Các mối quan hệ chất lượng cao (in-group) được đặc trưng bởi sự tin tưởng, tôn trọng và nghĩa vụ lẫn nhau. Các mối quan hệ chất lượng thấp (out-group) chỉ dựa trên các nghĩa vụ hợp đồng chính thức.",
    "constructs_detailed": [
      { "name": "Relationship Quality (Chất lượng mối quan hệ)", "desc": "Mức độ tin tưởng, tôn trọng và ảnh hưởng lẫn nhau giữa lãnh đạo và thành viên." },
      { "name": "Leader Support (Sự hỗ trợ của lãnh đạo)", "desc": "Mức độ lãnh đạo cung cấp hỗ trợ về công việc và tình cảm cho thành viên." }
    ],
    "sample_scales": [
      "Tôi có mối quan hệ công việc hiệu quả với lãnh đạo của mình.",
      "Lãnh đạo của tôi sẵn sàng sử dụng quyền lực của mình để giúp tôi giải quyết các vấn đề trong công việc.",
      "Tôi biết vị trí của mình với lãnh đạo của mình... tôi thực sự biết liệu anh/cô ấy có hài lòng với những gì tôi làm hay không."
    ],
    "related_theories": ["Transformational Leadership"],
    "limitations": "Lý thuyết này có thể bị coi là biện minh cho sự thiên vị và đối xử không công bằng tại nơi làm việc, vì nó cho rằng việc lãnh đạo có 'nhóm trong' và 'nhóm ngoài' là điều tự nhiên."
  },
  {
    "id": 112,
    "theory": "Employee Engagement Model",
    "constructs_full": "Vigor; Dedication; Absorption",
    "constructs_code": "VIG; DED; ABS",
    "note_vi": "Gắn kết nhân viên gắn với hiệu suất & giữ chân.",
    "group": "HR",
    "domain": "Organizational Behavior",
    "dependent_variable": "Performance (PERF)",
    "reference": "Schaufeli et al. (2002)",
    "application_vi": "Các công ty xây dựng môi trường làm việc tích cực để nhân viên cảm thấy tràn đầy năng lượng, tận tâm và tập trung cao độ vào công việc.",
    "definition_long": "Gắn kết trong công việc là một trạng thái tinh thần tích cực, thỏa mãn liên quan đến công việc, được đặc trưng bởi ba khía cạnh chính: Sức sống (Vigor), Sự tận tâm (Dedication), và Sự mải mê (Absorption). Nhân viên gắn kết có mức năng lượng cao, nhiệt tình với công việc và hoàn toàn đắm chìm vào công việc của họ.",
    "constructs_detailed": [
      { "name": "Vigor (Sức sống)", "desc": "Đặc trưng bởi mức năng lượng và sự bền bỉ tinh thần cao, sự sẵn lòng nỗ lực trong công việc, và sự kiên trì ngay cả khi đối mặt với khó khăn." },
      { "name": "Dedication (Sự tận tâm)", "desc": "Đặc trưng bởi cảm giác có ý nghĩa, nhiệt tình, cảm hứng, tự hào và thách thức." },
      { "name": "Absorption (Sự mải mê)", "desc": "Đặc trưng bởi sự tập trung hoàn toàn và hạnh phúc khi đắm chìm trong công việc, khiến thời gian trôi qua nhanh chóng." }
    ],
    "sample_scales": [
      "Tại nơi làm việc, tôi cảm thấy tràn đầy năng lượng.",
      "Tôi nhiệt tình với công việc của mình.",
      "Thời gian trôi qua rất nhanh khi tôi đang làm việc."
    ],
    "related_theories": ["Service-Profit Chain", "Flow Theory"],
    "limitations": "Sự gắn kết quá mức có thể dẫn đến kiệt sức (burnout) nếu không có sự cân bằng và phục hồi hợp lý. Đôi khi, nó bị nhầm lẫn với nghiện công việc (workaholism)."
  },
  {
    "id": 113,
    "theory": "Human Capital Theory",
    "constructs_full": "Education; Skills; Experience",
    "constructs_code": "EDU; SK; EXP",
    "note_vi": "Đầu tư vào nhân lực tăng năng suất và thu nhập.",
    "group": "HR",
    "domain": "Labor Economics",
    "dependent_variable": "Productivity (PROD)",
    "reference": "Becker (1964)",
    "application_vi": "Các công ty đầu tư vào các chương trình đào tạo để nâng cao kỹ năng và kiến thức cho nhân viên, từ đó tăng năng suất lao động.",
    "definition_long": "Lý thuyết Vốn con người coi kiến thức, kỹ năng và khả năng của các cá nhân như một dạng vốn. Giống như vốn vật chất (máy móc), vốn con người có thể được đầu tư thông qua giáo dục và đào tạo. Những khoản đầu tư này làm tăng năng suất của cá nhân và do đó, tăng thu nhập của họ.",
    "constructs_detailed": [
      { "name": "Education (Giáo dục)", "desc": "Kiến thức chính quy thu được qua trường lớp." },
      { "name": "Skills (Kỹ năng)", "desc": "Các khả năng cụ thể để thực hiện một nhiệm vụ, có thể là kỹ năng chung hoặc kỹ năng đặc thù cho công ty." },
      { "name": "Experience (Kinh nghiệm)", "desc": "Kiến thức và kỹ năng tích lũy được qua quá trình làm việc." }
    ],
    "sample_scales": [ "Vốn con người thường được đo lường bằng các chỉ số khách quan như số năm đi học, các chứng chỉ đã có, số năm kinh nghiệm, thay vì thang đo thái độ." ],
    "related_theories": ["Resource-Based View (RBV)"],
    "limitations": "Lý thuyết này có thể không giải thích đầy đủ sự bất bình đẳng thu nhập do các yếu tố khác như mạng lưới xã hội, sự phân biệt đối xử, hoặc may mắn."
  },
  {
    "id": 114,
    "theory": "Employer Branding",
    "constructs_full": "Employer Image; Perceived Attractiveness; Recruitment Outcomes",
    "constructs_code": "EI; PA; RO",
    "note_vi": "Hình ảnh nhà tuyển dụng hỗ trợ thu hút nhân tài.",
    "group": "HR",
    "domain": "Employer Marketing",
    "dependent_variable": "Talent Attraction (TA)",
    "reference": "Backhaus & Tikoo (2004)",
    "application_vi": "Google xây dựng hình ảnh một nơi làm việc lý tưởng với phúc lợi tốt và văn hóa sáng tạo để thu hút những kỹ sư tài năng nhất.",
    "definition_long": "Xây dựng Thương hiệu Nhà tuyển dụng là quá trình quảng bá một công ty như một nhà tuyển dụng được lựa chọn cho một nhóm mục tiêu mong muốn. Nó bao gồm việc định hình và truyền thông 'đề xuất giá trị nhân viên' (Employee Value Proposition - EVP) để thu hút, tuyển dụng và giữ chân nhân tài.",
    "constructs_detailed": [
      { "name": "Employer Image (Hình ảnh nhà tuyển dụng)", "desc": "Nhận thức của công chúng về công ty như một nơi làm việc." },
      { "name": "Perceived Attractiveness (Sự hấp dẫn cảm nhận)", "desc": "Mức độ hấp dẫn của công ty đối với các ứng viên tiềm năng." },
      { "name": "Recruitment Outcomes (Kết quả tuyển dụng)", "desc": "Các kết quả như số lượng và chất lượng của các đơn ứng tuyển." }
    ],
    "sample_scales": [
      "Tôi có một ấn tượng tích cực về công ty này như một nơi làm việc.",
      "Tôi rất muốn làm việc cho công ty này.",
      "Công ty này nổi tiếng là một nhà tuyển dụng tốt."
    ],
    "related_theories": ["Brand Equity (Keller)"],
    "limitations": "Thương hiệu nhà tuyển dụng phải được xây dựng dựa trên thực tế. Nếu hình ảnh được quảng bá không phù hợp với trải nghiệm thực tế của nhân viên, nó sẽ phản tác dụng."
  },
  {
    "id": 115,
    "theory": "Service Profitability Framework",
    "constructs_full": "Service Quality; Retention; Revenue Growth; Productivity",
    "constructs_code": "SQ; RET; RG; PR",
    "note_vi": "Mối liên hệ giữa chất lượng dịch vụ và lợi nhuận.",
    "group": "Financial",
    "domain": "Service Management",
    "dependent_variable": "Profitability (PF)",
    "reference": "Heskett et al. variants",
    "application_vi": "Một công ty tư vấn tập trung vào việc cung cấp dịch vụ chất lượng cao để giữ chân khách hàng lâu dài, từ đó đảm bảo doanh thu và lợi nhuận ổn định.",
    "definition_long": "Khung Lợi nhuận Dịch vụ là một mô hình quản lý liên kết các thực hành dịch vụ với khả năng sinh lời. Nó cho rằng chất lượng dịch vụ vượt trội dẫn đến sự hài lòng và giữ chân khách hàng cao hơn, từ đó thúc đẩy tăng trưởng doanh thu và lợi nhuận. Đồng thời, năng suất và hiệu quả chi phí cũng đóng vai trò quan trọng.",
    "constructs_detailed": [
      { "name": "Service Quality (Chất lượng dịch vụ)", "desc": "Mức độ dịch vụ đáp ứng hoặc vượt qua kỳ vọng của khách hàng." },
      { "name": "Retention (Giữ chân)", "desc": "Tỷ lệ khách hàng tiếp tục sử dụng dịch vụ theo thời gian." },
      { "name": "Revenue Growth (Tăng trưởng doanh thu)", "desc": "Sự gia tăng doanh thu từ khách hàng hiện tại và khách hàng mới." },
      { "name": "Productivity (Năng suất)", "desc": "Hiệu quả trong việc sử dụng các nguồn lực để cung cấp dịch vụ." }
    ],
    "sample_scales": [ "Đây là một khung phân tích tài chính và hoạt động, sử dụng các chỉ số kinh doanh thực tế để đo lường." ],
    "related_theories": ["Service-Profit Chain", "SERVQUAL"],
    "limitations": "Mô hình này có thể đơn giản hóa các mối quan hệ phức tạp. Lợi nhuận không chỉ phụ thuộc vào dịch vụ mà còn vào chiến lược giá, cạnh tranh và các yếu tố kinh tế vĩ mô."
  },
  {
    "id": 116,
    "theory": "Consumer Decision Journey (McKinsey)",
    "constructs_full": "Consideration; Active Evaluation; Moment of Purchase; Post-purchase",
    "constructs_code": "CON; AE; MP; PP",
    "note_vi": "Mô tả hành trình ra quyết định mua hàng hiện đại.",
    "group": "Marketing",
    "domain": "Customer Journey",
    "dependent_variable": "Purchase & Advocacy (P&A)",
    "reference": "McKinsey (consumer journey)",
    "application_vi": "Thương hiệu cần phải có mặt ở tất cả các giai đoạn: quảng cáo (cân nhắc), đánh giá trên mạng (đánh giá), trải nghiệm tại cửa hàng (mua hàng) và hỗ trợ sau bán (sau mua).",
    "definition_long": "Hành trình Quyết định của Người tiêu dùng là một mô hình hiện đại mô tả quá trình mua hàng không còn là một phễu tuyến tính mà là một vòng lặp. Khách hàng bắt đầu với một nhóm các thương hiệu ban đầu để cân nhắc, sau đó tích cực đánh giá, thu hẹp lựa chọn, đưa ra quyết định mua hàng, và cuối cùng trải nghiệm sản phẩm. Trải nghiệm sau mua hàng ảnh hưởng đến lần cân nhắc tiếp theo.",
    "constructs_detailed": [
      { "name": "Initial Consideration Set (Tập hợp cân nhắc ban đầu)", "desc": "Một nhóm nhỏ các thương hiệu mà người tiêu dùng nghĩ đến đầu tiên." },
      { "name": "Active Evaluation (Đánh giá tích cực)", "desc": "Quá trình khách hàng tìm kiếm thông tin, đọc đánh giá, so sánh các lựa chọn." },
      { "name": "Moment of Purchase (Thời điểm mua hàng)", "desc": "Khách hàng đưa ra lựa chọn cuối cùng tại điểm bán." },
      { "name": "Post-purchase Experience (Trải nghiệm sau mua)", "desc": "Giai đoạn khách hàng sử dụng sản phẩm và hình thành sự hài lòng và lòng trung thành." }
    ],
    "sample_scales": [ "Đây là một khung phân tích hành trình, thường được nghiên cứu bằng cách lập bản đồ các điểm chạm (touchpoint mapping) và khảo sát ở từng giai đoạn." ],
    "related_theories": ["AIDA Model", "Sales Funnel"],
    "limitations": "Hành trình thực tế có thể còn phức tạp và lộn xộn hơn mô hình vòng lặp này, đặc biệt với các quyết định mua hàng khác nhau (mua hàng bốc đồng vs. mua hàng cân nhắc kỹ)."
  },
  {
    "id": 117,
    "theory": "Affective Events Theory",
    "constructs_full": "Work Events; Affective Reactions; Job Satisfaction; Behavior",
    "constructs_code": "WE; AR; JS; JB",
    "note_vi": "Sự kiện cảm xúc tại nơi làm việc ảnh hưởng thái độ/hành vi.",
    "group": "Organizational",
    "domain": "Workplace Psychology",
    "dependent_variable": "Job Performance (JP)",
    "reference": "Weiss & Cropanzano (1996)",
    "application_vi": "Một lời khen từ sếp (sự kiện) có thể tạo ra cảm xúc tích cực (phản ứng), làm tăng sự hài lòng và động lực làm việc trong ngày hôm đó.",
    "definition_long": "Lý thuyết Sự kiện Cảm xúc cho rằng các sự kiện xảy ra tại nơi làm việc gây ra các phản ứng cảm xúc ở nhân viên, và những cảm xúc này sau đó ảnh hưởng đến thái độ và hành vi của họ. Thay vì chỉ tập trung vào các đặc điểm ổn định của môi trường làm việc, lý thuyết này nhấn mạnh vai trò của các sự kiện hàng ngày và những cảm xúc tức thời.",
    "constructs_detailed": [
      { "name": "Work Events (Sự kiện tại nơi làm việc)", "desc": "Các sự kiện hàng ngày, cả tích cực (ví dụ: nhận được lời khen) và tiêu cực (ví dụ: xung đột với đồng nghiệp)." },
      { "name": "Affective Reactions (Phản ứng cảm xúc)", "desc": "Các cảm xúc và tâm trạng tức thời do các sự kiện gây ra." },
      { "name": "Job Satisfaction (Sự hài lòng công việc)", "desc": "Thái độ tổng thể, bị ảnh hưởng bởi sự tích lũy của các phản ứng cảm xúc." },
      { "name": "Job Behaviors (Hành vi công việc)", "desc": "Các hành vi bị ảnh hưởng bởi cảm xúc, chẳng hạn như hiệu suất hoặc hành vi công dân tổ chức." }
    ],
    "sample_scales": [
      "Hôm nay, tôi đã nhận được phản hồi tích cực về công việc của mình.",
      "Sự kiện đó đã làm tôi cảm thấy vui vẻ.",
      "Tâm trạng của tôi hôm nay ảnh hưởng đến cách tôi làm việc."
    ],
    "related_theories": ["Emotional Contagion", "Job Characteristics Model"],
    "limitations": "Việc nắm bắt các sự kiện và phản ứng cảm xúc tức thời đòi hỏi các phương pháp nghiên cứu chuyên sâu như ghi nhật ký hàng ngày (diary studies), vốn khó thực hiện trên quy mô lớn."
  },
  {
    "id": 118,
    "theory": "Job Characteristics Model",
    "constructs_full": "Skill Variety; Task Identity; Task Significance; Autonomy; Feedback",
    "constructs_code": "SV; TI; TS; AUT; FB",
    "note_vi": "Đặc tính công việc ảnh hưởng tới động lực và hiệu suất.",
    "group": "Organizational",
    "domain": "Job Design",
    "dependent_variable": "Motivation (MOT)",
    "reference": "Hackman & Oldham (1976)",
    "application_vi": "Thiết kế công việc cho phép nhân viên thực hiện nhiều kỹ năng khác nhau, tự chủ về cách làm và thấy được ý nghĩa của công việc sẽ tạo ra động lực cao.",
    "definition_long": "Mô hình Đặc tính Công việc là một lý thuyết về thiết kế công việc, cho rằng có năm đặc tính công việc cốt lõi ảnh hưởng đến ba trạng thái tâm lý quan trọng, từ đó dẫn đến các kết quả tích cực về công việc và cá nhân. Mục tiêu là thiết kế công việc sao cho nó có thể tạo ra động lực nội tại cho nhân viên.",
    "constructs_detailed": [
      { "name": "Skill Variety (Sự đa dạng kỹ năng)", "desc": "Mức độ một công việc đòi hỏi nhiều hoạt động và kỹ năng khác nhau." },
      { "name": "Task Identity (Sự nhận diện nhiệm vụ)", "desc": "Mức độ một công việc đòi hỏi hoàn thành một phần công việc 'toàn bộ' và có thể xác định được từ đầu đến cuối." },
      { "name": "Task Significance (Tầm quan trọng của nhiệm vụ)", "desc": "Mức độ công việc có tác động đáng kể đến cuộc sống của người khác." },
      { "name": "Autonomy (Sự tự chủ)", "desc": "Mức độ công việc cung cấp sự tự do và độc lập cho cá nhân trong việc lập kế hoạch và thực hiện." },
      { "name": "Feedback (Phản hồi)", "desc": "Mức độ cá nhân nhận được thông tin trực tiếp và rõ ràng về hiệu suất công việc của mình." }
    ],
    "sample_scales": [
      "Công việc của tôi đòi hỏi tôi phải sử dụng nhiều kỹ năng phức tạp.",
      "Công việc của tôi có tác động lớn đến mọi người bên ngoài tổ chức.",
      "Tôi có quyền tự quyết đáng kể trong công việc của mình."
    ],
    "related_theories": ["Self-Determination Theory (SDT)"],
    "limitations": "Mô hình này không tính đến sự khác biệt cá nhân một cách đầy đủ. Một công việc có tính thách thức và tự chủ cao có thể phù hợp với người này nhưng lại gây căng thẳng cho người khác."
  },
  {
    "id": 119,
    "theory": "Service Recovery Paradox",
    "constructs_full": "Service Failure; Recovery Effort; Perceived Justice; Satisfaction",
    "constructs_code": "SF; RE; PJ; SAT",
    "note_vi": "Phục hồi dịch vụ tốt có thể tăng hài lòng hơn mức không có lỗi.",
    "group": "Service",
    "domain": "Customer Service",
    "dependent_variable": "Satisfaction (SAT)",
    "reference": "McCollough et al. (2000)",
    "application_vi": "Khi một hãng hàng không làm thất lạc hành lý (thất bại) nhưng giải quyết vấn đề một cách nhanh chóng và có bồi thường thỏa đáng (phục hồi tốt), khách hàng có thể còn hài lòng hơn cả lúc đầu.",
    "definition_long": "Nghịch lý Phục hồi Dịch vụ là một tình huống trong đó một khách hàng có sự hài lòng và/hoặc lòng trung thành cao hơn sau khi công ty đã giải quyết thành công một sự cố dịch vụ, so với khi không có sự cố nào xảy ra. Một nỗ lực phục hồi xuất sắc có thể biến một khách hàng không hài lòng thành một khách hàng rất trung thành.",
    "constructs_detailed": [
      { "name": "Service Failure (Thất bại dịch vụ)", "desc": "Một sự cố trong đó dịch vụ không đáp ứng được kỳ vọng của khách hàng." },
      { "name": "Recovery Effort (Nỗ lực phục hồi)", "desc": "Các hành động mà công ty thực hiện để giải quyết thất bại." },
      { "name": "Perceived Justice (Sự công bằng cảm nhận)", "desc": "Cảm nhận của khách hàng về sự công bằng trong quá trình phục hồi (bao gồm công bằng phân phối, thủ tục và tương tác)." }
    ],
    "sample_scales": [
      "Công ty đã giải quyết vấn đề của tôi một cách nhanh chóng.",
      "Sự bồi thường mà tôi nhận được là công bằng cho sự cố đã xảy ra.",
      "Nhân viên đã rất lịch sự và thông cảm với vấn đề của tôi."
    ],
    "related_theories": ["Organizational Justice", "Expectation-Disconfirmation Model"],
    "limitations": "Nghịch lý này không phải lúc nào cũng xảy ra. Nó phụ thuộc vào mức độ nghiêm trọng của thất bại, nỗ lực phục hồi, và kinh nghiệm trước đó của khách hàng. Việc dựa vào nó như một chiến lược là rất rủi ro."
  },
  {
    "id": 120,
    "theory": "Expectation Confirmation Theory (ECT)",
    "constructs_full": "Expectations; Perceived Performance; Confirmation; Satisfaction",
    "constructs_code": "EXP; PP; CON; SAT",
    "note_vi": "Ứng dụng cho tiếp tục sử dụng dịch vụ/sản phẩm số.",
    "group": "Customer",
    "domain": "IS, Consumer",
    "dependent_variable": "Continued Use (CU)",
    "reference": "Bhattacherjee (2001)",
    "application_vi": "Người dùng sẽ tiếp tục sử dụng một ứng dụng nếu trải nghiệm thực tế (hiệu suất) phù hợp hoặc vượt qua mong đợi ban đầu của họ.",
    "definition_long": "Lý thuyết Xác nhận Kỳ vọng là một lý thuyết nhận thức giải thích sự hài lòng và hành vi sau mua hàng (ví dụ: tiếp tục sử dụng). Nó cho rằng sự hài lòng được quyết định bởi mức độ 'xác nhận' (confirmation) - sự tương đồng giữa kỳ vọng ban đầu và hiệu suất cảm nhận. Sự hài lòng, đến lượt nó, sẽ ảnh hưởng đến ý định tiếp tục sử dụng.",
    "constructs_detailed": [
      { "name": "Expectations (Kỳ vọng)", "desc": "Kỳ vọng của người dùng về hệ thống trước khi sử dụng." },
      { "name": "Perceived Performance (Hiệu suất cảm nhận)", "desc": "Nhận thức của người dùng về hiệu suất thực tế của hệ thống." },
      { "name": "Confirmation (Sự xác nhận)", "desc": "Mức độ hiệu suất cảm nhận đáp ứng kỳ vọng." },
      { "name": "Satisfaction (Sự hài lòng)", "desc": "Cảm giác hài lòng của người dùng sau khi sử dụng." }
    ],
    "sample_scales": [
      "Trải nghiệm của tôi với hệ thống này tốt hơn tôi mong đợi.",
      "Nhìn chung, tôi hài lòng với hệ thống này.",
      "Tôi có ý định tiếp tục sử dụng hệ thống này trong tương lai."
    ],
    "related_theories": ["Expectation-Disconfirmation Model", "TAM"],
    "limitations": "Lý thuyết này tập trung vào hành vi sau khi đã chấp nhận, và có thể không giải thích đầy đủ các yếu tố ảnh hưởng đến quyết định chấp nhận ban đầu."
  },
  {
    "id": 121,
    "theory": "Uses and Gratifications Theory",
    "constructs_full": "Motives; Gratification Sought; Gratification Obtained",
    "constructs_code": "MOT; GS; GO",
    "note_vi": "Người dùng chủ động chọn phương tiện để thỏa mãn nhu cầu.",
    "group": "Media",
    "domain": "Communication, Media Studies",
    "dependent_variable": "Continued Use (CU)",
    "reference": "Katz (1959)",
    "application_vi": "Người dùng chủ động chọn xem Netflix để giải trí, lướt Facebook để kết nối xã hội, hoặc đọc tin tức để cập nhật thông tin.",
    "definition_long": "Lý thuyết Sử dụng và Hài lòng là một cách tiếp cận để hiểu tại sao và làm thế nào mọi người tích cực tìm kiếm các phương tiện truyền thông cụ thể để thỏa mãn các nhu cầu cụ thể. Nó cho rằng khán giả không phải là những người tiêu thụ thụ động; thay vào đó, họ có vai trò tích cực trong việc lựa chọn và sử dụng phương tiện truyền thông.",
    "constructs_detailed": [
      { "name": "Motives / Gratification Sought (Động cơ / Sự hài lòng tìm kiếm)", "desc": "Những lý do tại sao mọi người sử dụng một phương tiện truyền thông cụ thể (ví dụ: để giải trí, học hỏi, tương tác xã hội, trốn thoát)." },
      { "name": "Gratification Obtained (Sự hài lòng đạt được)", "desc": "Mức độ mà việc sử dụng phương tiện truyền thông thực sự đáp ứng được những nhu cầu đó." }
    ],
    "sample_scales": [
      "Tôi sử dụng mạng xã hội này để giữ liên lạc với bạn bè.",
      "Việc sử dụng mạng xã hội này giúp tôi giải trí và thư giãn."
    ],
    "related_theories": ["ECT"],
    "limitations": "Lý thuyết này phụ thuộc nhiều vào việc tự báo cáo của người dùng, vốn có thể không chính xác. Nó cũng ít tập trung vào nội dung của thông điệp truyền thông."
  },
  {
    "id": 122,
    "theory": "Behavioral Economics - Anchoring",
    "constructs_full": "Anchor Value; Adjustment; Final Estimate",
    "constructs_code": "AV; ADJ; FE",
    "note_vi": "Giá khởi điểm ảnh hưởng tới đánh giá tiếp theo.",
    "group": "Behavioral",
    "domain": "Pricing, Decision Making",
    "dependent_variable": "Price Perception (PP)",
    "reference": "Tversky & Kahneman",
    "application_vi": "Một sản phẩm được gạch giá gốc cao và hiển thị giá khuyến mãi thấp hơn sẽ tạo cảm giác 'hời' vì giá gốc đóng vai trò là một mỏ neo tâm lý.",
    "definition_long": "Neo đậu là một thiên kiến nhận thức mô tả xu hướng của con người phụ thuộc quá nhiều vào thông tin đầu tiên được cung cấp (cái 'neo') khi đưa ra quyết định. Một khi cái neo đã được đặt, các phán đoán tiếp theo sẽ được điều chỉnh dựa trên nó, và có xu hướng bị lệch về phía cái neo.",
    "constructs_detailed": [
      { "name": "Anchor Value (Giá trị neo)", "desc": "Thông tin ban đầu (thường là một con số) được trình bày cho người ra quyết định." },
      { "name": "Adjustment (Sự điều chỉnh)", "desc": "Quá trình điều chỉnh ước tính ban đầu ra khỏi cái neo. Sự điều chỉnh này thường không đủ." }
    ],
    "sample_scales": [ "Thường được kiểm chứng qua các thí nghiệm, ví dụ: hỏi hai nhóm cùng một câu hỏi nhưng với một con số neo ban đầu khác nhau và so sánh kết quả." ],
    "related_theories": ["Psychological Pricing"],
    "limitations": "Hiệu ứng neo có thể bị giảm bớt nếu người ra quyết định có chuyên môn cao trong lĩnh vực đó hoặc nếu họ được khuyến khích xem xét các thông tin khác."
  },
  {
    "id": 123,
    "theory": "Priming Effect",
    "constructs_full": "Prime Stimulus; Accessibility; Subsequent Behavior",
    "constructs_code": "PS; AC; SB",
    "note_vi": "Kích thích trước ảnh hưởng nhận thức và hành vi sau.",
    "group": "Psychology",
    "domain": "Marketing, UX",
    "dependent_variable": "Choice (CHO)",
    "reference": "Cognitive psychology",
    "application_vi": "Một cửa hàng rượu bật nhạc Pháp có thể vô thức 'mồi' khách hàng mua rượu vang Pháp nhiều hơn.",
    "definition_long": "Hiệu ứng Mồi là một hiện tượng trong đó việc tiếp xúc với một kích thích (prime) ảnh hưởng đến phản ứng với một kích thích tiếp theo mà không có sự hướng dẫn hoặc ý định có ý thức. Việc mồi có thể kích hoạt các khái niệm, khuôn mẫu hoặc mục tiêu trong tâm trí, làm cho chúng trở nên dễ tiếp cận hơn và có khả năng ảnh hưởng đến suy nghĩ và hành vi sau đó.",
    "constructs_detailed": [
      { "name": "Prime Stimulus (Kích thích mồi)", "desc": "Từ ngữ, hình ảnh, âm thanh hoặc bất kỳ kích thích nào được trình bày để ảnh hưởng đến hành vi sau đó." },
      { "name": "Accessibility (Khả năng tiếp cận)", "desc": "Mức độ dễ dàng mà một khái niệm được gợi ra trong tâm trí." }
    ],
    "sample_scales": [ "Hiệu ứng mồi được nghiên cứu thông qua các thí nghiệm trong đó một nhóm được tiếp xúc với mồi và một nhóm đối chứng thì không." ],
    "related_theories": ["Mere Exposure Effect"],
    "limitations": "Các hiệu ứng mồi, đặc biệt là các hiệu ứng phức tạp, đôi khi khó tái tạo trong các nghiên cứu và có thể rất nhạy cảm với các yếu tố bối cảnh tinh vi."
  },
  {
    "id": 124,
    "theory": "Framing Effect",
    "constructs_full": "Gain/Loss Frame; Risk Preference; Decision Outcome",
    "constructs_code": "GF; LF; RP",
    "note_vi": "Cách trình bày ảnh hưởng đến quyết định lựa chọn.",
    "group": "Behavioral",
    "domain": "Marketing",
    "dependent_variable": "Choice (CHO)",
    "reference": "Tversky & Kahneman",
    "application_vi": "Ghi 'thịt bò nạc 85%' (khung tích cực) sẽ hấp dẫn hơn ghi 'thịt bò 15% mỡ' (khung tiêu cực), mặc dù chúng là một.",
    "definition_long": "Hiệu ứng Đóng khung là một thiên kiến nhận thức trong đó mọi người phản ứng với một lựa chọn cụ thể theo những cách khác nhau tùy thuộc vào cách nó được trình bày; ví dụ: như một khoản lợi (gain) hay một khoản lỗ (loss). Mọi người có xu hướng tránh rủi ro khi một khung tích cực được trình bày nhưng lại tìm kiếm rủi ro khi một khung tiêu cực được trình bày.",
    "constructs_detailed": [
      { "name": "Gain Frame (Khung lợi ích)", "desc": "Trình bày một tình huống tập trung vào các kết quả tích cực hoặc lợi ích." },
      { "name": "Loss Frame (Khung mất mát)", "desc": "Trình bày cùng một tình huống nhưng tập trung vào các kết quả tiêu cực hoặc chi phí." }
    ],
    "sample_scales": [ "Được kiểm chứng qua các thí nghiệm trong đó các nhóm khác nhau nhận được cùng một thông tin nhưng được đóng khung khác nhau, và so sánh lựa chọn của họ." ],
    "related_theories": ["Prospect Theory"],
    "limitations": "Hiệu quả của việc đóng khung có thể phụ thuộc vào kinh nghiệm trước đó và đặc điểm cá nhân của người ra quyết định."
  },
  {
    "id": 125,
    "theory": "Temporal Discounting",
    "constructs_full": "Delay; Discount Rate; Present Bias",
    "constructs_code": "DEL; DR; PB",
    "note_vi": "Ưa lợi ích gần hơn so với tương lai ảnh hưởng tới tiêu dùng/tiết kiệm.",
    "group": "Behavioral",
    "domain": "Consumer Finance",
    "dependent_variable": "Saving vs Consumption (S/C)",
    "reference": "Behavioral literature",
    "application_vi": "Các chương trình 'Mua ngay, trả sau' (Buy Now, Pay Later) khai thác xu hướng ưa thích lợi ích tức thời của người tiêu dùng.",
    "definition_long": "Chiết khấu theo Thời gian (còn gọi là chiết khấu trễ) là xu hướng mọi người coi trọng các phần thưởng ở hiện tại hơn là các phần thưởng trong tương lai. Giá trị của một phần thưởng bị 'chiết khấu' hoặc giảm đi khi nó bị trì hoãn trong tương lai. Con người thường thể hiện 'thiên kiến hiện tại' (present bias), tức là họ có xu hướng hành động thiếu kiên nhẫn trong ngắn hạn nhưng lại kiên nhẫn hơn trong dài hạn.",
    "constructs_detailed": [
      { "name": "Delay (Sự trì hoãn)", "desc": "Khoảng thời gian cho đến khi một phần thưởng được nhận." },
      { "name": "Discount Rate (Tỷ lệ chiết khấu)", "desc": "Tỷ lệ mà giá trị chủ quan của một phần thưởng giảm đi theo sự trì hoãn." }
    ],
    "sample_scales": [ "Thường được đo lường bằng các câu hỏi lựa chọn, ví dụ: 'Bạn thích nhận 100.000đ ngay bây giờ hay 120.000đ sau một tháng nữa?'" ],
    "related_theories": ["Construal Level Theory"],
    "limitations": "Tỷ lệ chiết khấu không phải là hằng số và có thể bị ảnh hưởng bởi các yếu tố như quy mô của phần thưởng và cảm xúc."
  },
  {
    "id": 126,
    "theory": "Loss Aversion",
    "constructs_full": "Losses; Gains; Reference Point",
    "constructs_code": "LOS; GA; RP",
    "note_vi": "Mất mát cảm nhận mạnh hơn lợi ích tương đương.",
    "group": "Behavioral",
    "domain": "Marketing, Finance",
    "dependent_variable": "Risk Preference (RP)",
    "reference": "Kahneman & Tversky",
    "application_vi": "Nỗi đau khi mất 100.000đ thường lớn hơn niềm vui khi được 100.000đ, đó là lý do các chính sách dùng thử miễn phí rất hiệu quả.",
    "definition_long": "Ác cảm Mất mát là một khái niệm cốt lõi của Lý thuyết Triển vọng, đề cập đến xu hướng của mọi người thích tránh mất mát hơn là đạt được lợi ích tương đương. Các nghiên cứu cho thấy tác động tâm lý của một khoản lỗ mạnh hơn khoảng hai lần so với tác động của một khoản lợi tương đương.",
    "constructs_detailed": [
      { "name": "Losses (Mất mát)", "desc": "Các kết quả được coi là thấp hơn điểm tham chiếu." },
      { "name": "Gains (Lợi ích)", "desc": "Các kết quả được coi là cao hơn điểm tham chiếu." }
    ],
    "sample_scales": [ "Được chứng minh qua các thí nghiệm lựa chọn và đánh giá." ],
    "related_theories": ["Prospect Theory", "Framing Effect"],
    "limitations": "Mức độ ác cảm mất mát có thể khác nhau ở mỗi người và trong các bối cảnh khác nhau. Nó có thể ít rõ rệt hơn đối với các khoản lỗ nhỏ."
  },
  {
    "id": 127,
    "theory": "Moral Hazard / Adverse Selection (Market)",
    "constructs_full": "Information Asymmetry; Incentives; Monitoring; Risk Behavior",
    "constructs_code": "IA; INC; MON; RB",
    "note_vi": "Rủi ro đạo đức và lựa chọn bất lợi do bất cân xứng thông tin.",
    "group": "Economics",
    "domain": "Insurance, Finance, Marketing",
    "dependent_variable": "Market Outcomes (MO)",
    "reference": "Akerlof (1970); Arrow (1963)",
    "application_vi": "Trên thị trường xe cũ, người bán biết rõ về lỗi của xe hơn người mua (lựa chọn bất lợi). Sau khi mua bảo hiểm, người dùng có thể lái xe bất cẩn hơn (rủi ro đạo đức).",
    "definition_long": "Đây là hai vấn đề chính phát sinh từ bất đối xứng thông tin. Lựa chọn Bất lợi (Adverse Selection) xảy ra 'trước' giao dịch, khi một bên có thông tin mà bên kia không có, dẫn đến việc thị trường thu hút những người tham gia 'tồi tệ' nhất. Rủi ro Đạo đức (Moral Hazard) xảy ra 'sau' giao dịch, khi một bên thay đổi hành vi của mình theo hướng rủi ro hơn vì họ không phải chịu toàn bộ hậu quả.",
    "constructs_detailed": [
      { "name": "Information Asymmetry (Bất đối xứng thông tin)", "desc": "Một bên trong giao dịch có nhiều hoặc tốt hơn thông tin so với bên kia." },
      { "name": "Risk Behavior (Hành vi rủi ro)", "desc": "Hành vi được thực hiện bởi bên được bảo vệ khỏi rủi ro." }
    ],
    "sample_scales": [ "Đây là các khái niệm kinh tế, thường được phân tích thông qua các mô hình lý thuyết và dữ liệu thị trường thực tế." ],
    "related_theories": ["Signaling Theory", "Agency Theory"],
    "limitations": "Trong thực tế, các cơ chế như xây dựng danh tiếng, bảo hành và các tín hiệu khác có thể giúp giảm thiểu các vấn đề này."
  },
  {
    "id": 128,
    "theory": "BCG Matrix",
    "constructs_full": "Market Growth; Market Share; Star; Cash Cow; Question Mark; Dog",
    "constructs_code": "MG; MS; STAR; CC; QM; DOG",
    "note_vi": "Ma trận phân tích danh mục sản phẩm/SBU.",
    "group": "Chiến lược",
    "domain": "Portfolio Management",
    "dependent_variable": "Resource Allocation (RA)",
    "reference": "Henderson (1970)",
    "application_vi": "Một tập đoàn phân bổ nguồn lực: đầu tư mạnh vào 'Ngôi sao', duy trì 'Bò sữa', xem xét 'Dấu hỏi' và thoái vốn khỏi 'Con chó'.",
    "definition_long": "Ma trận BCG (còn gọi là ma trận tăng trưởng-thị phần) là một công cụ lập kế hoạch chiến lược giúp các công ty phân tích danh mục các đơn vị kinh doanh chiến lược (SBU) hoặc dòng sản phẩm của mình. Nó phân loại các SBU vào bốn loại dựa trên tỷ lệ tăng trưởng thị trường và thị phần tương đối.",
    "constructs_detailed": [
      { "name": "Stars (Ngôi sao)", "desc": "Tăng trưởng cao, thị phần cao. Cần đầu tư lớn để duy trì tăng trưởng." },
      { "name": "Cash Cows (Bò sữa)", "desc": "Tăng trưởng thấp, thị phần cao. Tạo ra nhiều tiền mặt hơn mức cần thiết để duy trì." },
      { "name": "Question Marks (Dấu hỏi)", "desc": "Tăng trưởng cao, thị phần thấp. Cần đầu tư lớn để tăng thị phần, nhưng kết quả không chắc chắn." },
      { "name": "Dogs (Con chó)", "desc": "Tăng trưởng thấp, thị phần thấp. Thường tạo ra lợi nhuận thấp hoặc lỗ." }
    ],
    "sample_scales": [ "Đây là một công cụ phân tích định tính dựa trên dữ liệu thị trường." ],
    "related_theories": ["GE-McKinsey Matrix", "Product Life Cycle (PLC)"],
    "limitations": "Mô hình này quá đơn giản, chỉ sử dụng hai chiều. Tăng trưởng thị trường không phải là chỉ số duy nhất về sự hấp dẫn của ngành, và thị phần tương đối không phải là chỉ số duy nhất về lợi thế cạnh tranh."
  },
  {
    "id": 129,
    "theory": "GE-McKinsey Matrix",
    "constructs_full": "Industry Attractiveness; Business Unit Strength; Invest; Hold; Harvest",
    "constructs_code": "IA; BUS; INV; HLD; HAR",
    "note_vi": "Ma trận phân tích danh mục đầu tư phức tạp hơn BCG.",
    "group": "Chiến lược",
    "domain": "Portfolio Management",
    "dependent_variable": "Strategic Choices (SC)",
    "reference": "McKinsey",
    "application_vi": "Một phiên bản phức tạp hơn của ma trận BCG, sử dụng nhiều yếu tố hơn để đánh giá sức hấp dẫn của ngành và sức mạnh của đơn vị kinh doanh.",
    "definition_long": "Ma trận GE-McKinsey là một công cụ phân tích danh mục đầu tư chiến lược, được phát triển như một phiên bản cải tiến của ma trận BCG. Thay vì chỉ hai chiều, nó sử dụng hai chiều tổng hợp: Sức hấp dẫn của ngành (Industry Attractiveness) và Sức mạnh của đơn vị kinh doanh (Business Unit Strength), mỗi chiều được tạo thành từ nhiều yếu tố khác nhau.",
    "constructs_detailed": [
      { "name": "Industry Attractiveness (Sức hấp dẫn của ngành)", "desc": "Một chỉ số tổng hợp bao gồm các yếu tố như quy mô thị trường, tốc độ tăng trưởng, lợi nhuận ngành, cường độ cạnh tranh." },
      { "name": "Business Unit Strength (Sức mạnh của đơn vị kinh doanh)", "desc": "Một chỉ số tổng hợp bao gồm các yếu tố như thị phần, sức mạnh thương hiệu, chất lượng sản phẩm, kênh phân phối." }
    ],
    "sample_scales": [ "Đây là một công cụ phân tích chiến lược, đòi hỏi việc đánh giá và cho điểm các yếu tố khác nhau để xác định vị trí trên ma trận." ],
    "related_theories": ["BCG Matrix"],
    "limitations": "Việc đánh giá và cho điểm các yếu tố có thể rất chủ quan. Nó cung cấp các khuyến nghị chiến lược chung nhưng không đưa ra các hành động cụ thể."
  },
  {
    "id": 130,
    "theory": "Ansoff Matrix",
    "constructs_full": "Market Penetration; Product Development; Market Development; Diversification",
    "constructs_code": "MP; PD; MD; DIV",
    "note_vi": "Ma trận các chiến lược tăng trưởng.",
    "group": "Chiến lược",
    "domain": "Growth Strategy",
    "dependent_variable": "Growth Path (GP)",
    "reference": "Ansoff (1957)",
    "application_vi": "Starbucks thâm nhập thị trường bằng cách mở thêm cửa hàng, phát triển sản phẩm mới (Frappuccino), mở rộng sang quốc gia khác và đa dạng hóa (bán máy pha cà phê).",
    "definition_long": "Ma trận Ansoff (còn gọi là ma trận Mở rộng Sản phẩm/Thị trường) là một công cụ lập kế hoạch chiến lược cung cấp một khuôn khổ để giúp các nhà quản lý nghĩ về các chiến lược tăng trưởng. Nó đề xuất bốn chiến lược tăng trưởng dựa trên việc kết hợp giữa sản phẩm hiện tại/mới và thị trường hiện tại/mới.",
    "constructs_detailed": [
      { "name": "Market Penetration (Thâm nhập thị trường)", "desc": "Bán sản phẩm hiện tại cho thị trường hiện tại. Rủi ro thấp nhất." },
      { "name": "Product Development (Phát triển sản phẩm)", "desc": "Bán sản phẩm mới cho thị trường hiện tại." },
      { "name": "Market Development (Phát triển thị trường)", "desc": "Bán sản phẩm hiện tại cho thị trường mới (ví dụ: khu vực địa lý mới, phân khúc mới)." },
      { "name": "Diversification (Đa dạng hóa)", "desc": "Bán sản phẩm mới cho thị trường mới. Rủi ro cao nhất." }
    ],
    "sample_scales": [ "Đây là một công cụ lập kế hoạch chiến lược, không dùng thang đo." ],
    "related_theories": ["BCG Matrix"],
    "limitations": "Ma trận này không xem xét đến các yếu tố khác như vai trò của đối thủ cạnh tranh hoặc sự cần thiết phải phát triển năng lực mới. Nó cũng không tính toán đến rủi ro một cách chi tiết."
  },
  {
    "id": 131,
    "theory": "PESTEL/PEST Analysis",
    "constructs_full": "Political; Economic; Social; Technological; Environmental; Legal",
    "constructs_code": "P; E; S; T; E; L",
    "note_vi": "Phân tích môi trường vĩ mô.",
    "group": "Chiến lược",
    "domain": "Environmental Scanning",
    "dependent_variable": "Opportunities; Threats (O/T)",
    "reference": "PESTEL literature",
    "application_vi": "Một công ty sản xuất xe điện phân tích các yếu tố như chính sách trợ giá của chính phủ (Political) và xu hướng sống xanh của xã hội (Social).",
    "definition_long": "Phân tích PESTEL là một công cụ chiến lược được sử dụng để xác định, phân tích và theo dõi các yếu tố môi trường vĩ mô có thể có tác động đến một tổ chức. Kết quả của phân tích này thường được sử dụng để xác định các cơ hội và thách thức trong một phân tích SWOT.",
    "constructs_detailed": [
      { "name": "Political (Chính trị)", "desc": "Các yếu tố liên quan đến chính phủ và chính sách công." },
      { "name": "Economic (Kinh tế)", "desc": "Các yếu tố kinh tế vĩ mô như lạm phát, lãi suất, tăng trưởng GDP." },
      { "name": "Social (Xã hội)", "desc": "Các yếu tố văn hóa-xã hội như nhân khẩu học, lối sống, xu hướng tiêu dùng." },
      { "name": "Technological (Công nghệ)", "desc": "Các đổi mới công nghệ và tác động của chúng." },
      { "name": "Environmental (Môi trường)", "desc": "Các yếu tố liên quan đến môi trường và sinh thái." },
      { "name": "Legal (Pháp lý)", "desc": "Các luật và quy định hiện hành." }
    ],
    "sample_scales": [ "Đây là một khung phân tích định tính." ],
    "related_theories": ["SWOT Analysis"],
    "limitations": "PESTEL chỉ là một bức tranh chụp nhanh về môi trường tại một thời điểm. Môi trường thay đổi liên tục, vì vậy phân tích này cần được cập nhật thường xuyên. Nó cũng không cung cấp các giải pháp cụ thể."
  },
  {
    "id": 132,
    "theory": "SWOT Analysis",
    "constructs_full": "Strengths; Weaknesses; Opportunities; Threats",
    "constructs_code": "S; W; O; T",
    "note_vi": "Phân tích điểm mạnh, yếu, cơ hội, và thách thức.",
    "group": "Chiến lược",
    "domain": "Strategic Planning",
    "dependent_variable": "Strategic Fit (SF)",
    "reference": "SWOT literature",
    "application_vi": "Phân tích điểm mạnh (thương hiệu), điểm yếu (kênh phân phối), cơ hội (thị trường mới nổi) và thách thức (đối thủ cạnh tranh).",
    "definition_long": "Phân tích SWOT là một kỹ thuật lập kế hoạch chiến lược được sử dụng để giúp một cá nhân hoặc tổ chức xác định Điểm mạnh (Strengths), Điểm yếu (Weaknesses) từ bên trong, cũng như Cơ hội (Opportunities) và Thách thức (Threats) từ bên ngoài liên quan đến một dự án kinh doanh hoặc một vấn đề cụ thể.",
    "constructs_detailed": [
      { "name": "Strengths (Điểm mạnh)", "desc": "Các thuộc tính nội tại của tổ chức có lợi cho việc đạt được mục tiêu." },
      { "name": "Weaknesses (Điểm yếu)", "desc": "Các thuộc tính nội tại của tổ chức có hại cho việc đạt được mục tiêu." },
      { "name": "Opportunities (Cơ hội)", "desc": "Các yếu tố bên ngoài mà tổ chức có thể khai thác để tạo lợi thế." },
      { "name": "Threats (Thách thức)", "desc": "Các yếu tố bên ngoài có thể gây nguy hại cho hiệu suất của tổ chức." }
    ],
    "sample_scales": [ "Đây là một công cụ phân tích định tính." ],
    "related_theories": ["PESTEL Analysis", "Porter's Five Forces"],
    "limitations": "SWOT có thể trở thành một danh sách dài mà không có sự ưu tiên. Nó không cung cấp các hành động cụ thể và có thể rất chủ quan. Để hiệu quả hơn, nó nên được kết hợp với phân tích TOWS để tạo ra các chiến lược."
  },
  {
    "id": 133,
    "theory": "Contingency Theory",
    "constructs_full": "Situational Factors; Leadership Style; Organizational Structure",
    "constructs_code": "SF; LS; OS",
    "note_vi": "Không có cách quản lý tốt nhất, phụ thuộc vào tình huống.",
    "group": "Organizational",
    "domain": "Management",
    "dependent_variable": "Effectiveness (EFF)",
    "reference": "Fiedler, Lawrence & Lorsch",
    "application_vi": "Không có một phong cách lãnh đạo 'tốt nhất'. Phong cách độc đoán có thể hiệu quả trong khủng hoảng, trong khi phong cách dân chủ tốt hơn cho các nhóm sáng tạo.",
    "definition_long": "Lý thuyết Tình huống là một lớp các lý thuyết hành vi cho rằng không có một cách tốt nhất để tổ chức một công ty, lãnh đạo một nhóm, hoặc đưa ra quyết định. Thay vào đó, cách tiếp cận tối ưu phụ thuộc vào tình huống, tức là phụ thuộc vào các yếu tố nội bộ và bên ngoài (các yếu tố tình huống).",
    "constructs_detailed": [
      { "name": "Situational Factors (Yếu tố tình huống)", "desc": "Các biến số trong môi trường có thể ảnh hưởng đến kết quả, ví dụ: sự ổn định của môi trường, công nghệ, quy mô tổ chức." },
      { "name": "Leadership Style / Organizational Structure (Phong cách lãnh đạo / Cấu trúc tổ chức)", "desc": "Các lựa chọn về quản lý và cấu trúc được điều chỉnh để phù hợp với các yếu tố tình huống." }
    ],
    "sample_scales": [ "Thường được nghiên cứu bằng cách so sánh hiệu suất của các tổ chức khác nhau trong các tình huống khác nhau." ],
    "related_theories": ["Situational Leadership Theory"],
    "limitations": "Lý thuyết này có thể phức tạp vì có rất nhiều yếu tố tình huống tiềm năng. Nó cũng có thể mang tính phản ứng hơn là chủ động, vì nó tập trung vào việc thích ứng với tình huống hiện tại."
  },
  {
    "id": 134,
    "theory": "Institutional Theory",
    "constructs_full": "Isomorphism; Legitimacy; Norms; Mimetic, Coercive, Normative pressures",
    "constructs_code": "ISO; LEG; NOR; MCN",
    "note_vi": "Tổ chức tuân thủ các quy tắc và chuẩn mực xã hội để được hợp pháp.",
    "group": "Organizational",
    "domain": "Sociology, Strategy",
    "dependent_variable": "Organizational Form (OF)",
    "reference": "DiMaggio & Powell (1983)",
    "application_vi": "Các ngân hàng có xu hướng có cấu trúc và sản phẩm tương tự nhau (đồng hình) để tuân thủ các quy định và được xã hội coi là hợp pháp.",
    "definition_long": "Lý thuyết Thể chế xem xét cách các cấu trúc, bao gồm các quy tắc, chuẩn mực và thói quen, được thiết lập như những hướng dẫn có thẩm quyền cho hành vi xã hội. Các tổ chức thường tuân theo các quy tắc và chuẩn mực này không chỉ vì hiệu quả mà còn để đạt được tính hợp pháp (legitimacy) trong mắt các bên liên quan. Điều này dẫn đến hiện tượng 'đồng hình' (isomorphism), tức là các tổ chức trong cùng một lĩnh vực có xu hướng trở nên giống nhau.",
    "constructs_detailed": [
      { "name": "Isomorphism (Đồng hình)", "desc": "Quá trình khiến các tổ chức trở nên giống nhau hơn." },
      { "name": "Legitimacy (Tính hợp pháp)", "desc": "Sự chấp nhận và công nhận của xã hội đối với một tổ chức." },
      { "name": "Mimetic, Coercive, Normative pressures (Áp lực bắt chước, cưỡng chế, chuẩn mực)", "desc": "Ba cơ chế chính gây ra sự đồng hình." }
    ],
    "sample_scales": [
        "Chúng tôi áp dụng các thực hành quản lý này vì chúng được coi là tiêu chuẩn trong ngành.",
        "Việc tuân thủ các quy định của chính phủ là rất quan trọng đối với hoạt động của chúng tôi."
    ],
    "related_theories": ["Stakeholder Theory"],
    "limitations": "Lý thuyết này có thể quá tập trung vào sự tuân thủ và ít giải thích về sự đổi mới, sự thay đổi và khả năng hành động của các tổ chức để định hình lại môi trường của họ."
  },
  {
    "id": 135,
    "theory": "Resource Dependence Theory",
    "constructs_full": "Resource Scarcity; Dependence; Power; Environmental Uncertainty",
    "constructs_code": "RS; DEP; POW; EU",
    "note_vi": "Sự phụ thuộc vào nguồn lực bên ngoài ảnh hưởng đến hành vi tổ chức.",
    "group": "Organizational",
    "domain": "Strategy, Inter-org Relations",
    "dependent_variable": "Power Dynamics (PD)",
    "reference": "Pfeffer & Salancik (1978)",
    "application_vi": "Một công ty có thể sáp nhập với nhà cung cấp chính của mình để giảm sự phụ thuộc vào nguồn lực và kiểm soát tốt hơn chuỗi cung ứng.",
    "definition_long": "Lý thuyết Phụ thuộc vào Nguồn lực cho rằng hành vi của tổ chức được hiểu rõ nhất bằng cách xem xét bối cảnh môi trường của nó; cụ thể là sự phụ thuộc vào các tổ chức khác để có được các nguồn lực quan trọng. Để tồn tại, các tổ chức phải có được nguồn lực. Điều này dẫn đến việc hình thành các mối quan hệ quyền lực và phụ thuộc, và các tổ chức sẽ thực hiện các hành động chiến lược (ví dụ: sáp nhập, liên minh) để quản lý sự phụ thuộc này.",
    "constructs_detailed": [
      { "name": "Resource Scarcity (Sự khan hiếm nguồn lực)", "desc": "Mức độ sẵn có của các nguồn lực quan trọng trong môi trường." },
      { "name": "Dependence (Sự phụ thuộc)", "desc": "Mức độ một tổ chức cần một nguồn lực từ một tổ chức khác." },
      { "name": "Power (Quyền lực)", "desc": "Khả năng của một tổ chức ảnh hưởng đến tổ chức khác, thường bắt nguồn từ việc kiểm soát các nguồn lực quan trọng." }
    ],
    "sample_scales": [
      "Chúng tôi phụ thuộc rất nhiều vào một vài nhà cung cấp chính.",
      "Việc tìm kiếm một nhà cung cấp thay thế cho nguồn lực X là rất khó khăn."
    ],
    "related_theories": ["Porter's Five Forces"],
    "limitations": "Lý thuyết này có thể miêu tả các tổ chức như những thực thể thụ động, chỉ phản ứng với môi trường, trong khi thực tế chúng cũng có thể chủ động định hình môi trường của mình."
  },
  {
    "id": 136,
    "theory": "Upper Echelons Theory",
    "constructs_full": "Top Management Team Characteristics; Strategic Choice; Firm Performance",
    "constructs_code": "TMT; SC; FP",
    "note_vi": "Đặc điểm của ban lãnh đạo cấp cao ảnh hưởng đến quyết định và kết quả.",
    "group": "Chiến lược",
    "domain": "Strategic Management",
    "dependent_variable": "Firm Performance (FP)",
    "reference": "Hambrick & Mason (1984)",
    "application_vi": "Một CEO có nền tảng về công nghệ có thể sẽ đưa ra các quyết định chiến lược tập trung vào đổi mới và R&D nhiều hơn.",
    "definition_long": "Lý thuyết Cấp cao cho rằng các kết quả của tổ chức - cả chiến lược và hiệu suất - là sự phản ánh các giá trị và thiên kiến nhận thức của các nhà quản lý cấp cao. Các đặc điểm của đội ngũ quản lý cấp cao (TMT), chẳng hạn như tuổi tác, kinh nghiệm, nền tảng giáo dục, được coi là những yếu tố dự báo cho các lựa chọn chiến lược và do đó là hiệu suất của công ty.",
    "constructs_detailed": [
      { "name": "Top Management Team (TMT) Characteristics (Đặc điểm của Đội ngũ Quản lý Cấp cao)", "desc": "Các đặc điểm nhân khẩu học và tâm lý của các nhà lãnh đạo (tuổi, kinh nghiệm chức năng, trình độ học vấn, v.v.)." },
      { "name": "Strategic Choice (Lựa chọn chiến lược)", "desc": "Các quyết định quan trọng mà TMT đưa ra, chẳng hạn như đa dạng hóa, đổi mới, hoặc mua lại." }
    ],
    "sample_scales": [ "Lý thuyết này thường được kiểm định bằng cách sử dụng dữ liệu lưu trữ về các nhà quản lý và dữ liệu tài chính của công ty, chứ không phải qua khảo sát trực tiếp." ],
    "related_theories": ["Resource-Based View (RBV)"],
    "limitations": "Mối liên hệ giữa các đặc điểm nhân khẩu học và các quyết định thực tế có thể không phải lúc nào cũng mạnh mẽ. Các yếu tố môi trường và tổ chức cũng đóng vai trò quan trọng trong việc hạn chế các lựa chọn của nhà lãnh đạo."
  },
  {
    "id": 137,
    "theory": "Gamification Framework",
    "constructs_full": "Points; Badges; Leaderboards; Motivation; Engagement",
    "constructs_code": "P; B; L; MOT; ENG",
    "note_vi": "Ứng dụng cơ chế trò chơi để tăng tương tác và động lực.",
    "group": "UX/Marketing",
    "domain": "User Engagement",
    "dependent_variable": "User Activity (UA)",
    "reference": "Gamification literature",
    "application_vi": "Các ứng dụng học ngôn ngữ như Duolingo sử dụng điểm, huy hiệu và bảng xếp hạng để tạo động lực và giữ chân người dùng.",
    "definition_long": "Game hóa là việc áp dụng các yếu tố thiết kế trò chơi và nguyên tắc trò chơi vào các bối cảnh không phải trò chơi. Nó thường được sử dụng để thu hút người dùng, thúc đẩy hành vi mong muốn, và giải quyết các vấn đề bằng cách làm cho các nhiệm vụ trở nên thú vị hơn.",
    "constructs_detailed": [
      { "name": "Game Mechanics (Cơ chế trò chơi)", "desc": "Các thành phần như Điểm (Points), Huy hiệu (Badges), và Bảng xếp hạng (Leaderboards) - được gọi chung là PBL." },
      { "name": "Motivation (Động lực)", "desc": "Cả động lực nội tại (sự thích thú) và ngoại tại (phần thưởng) được sử dụng để khuyến khích sự tham gia." },
      { "name": "Engagement (Sự gắn kết)", "desc": "Mức độ tham gia và tương tác tích cực của người dùng." }
    ],
    "sample_scales": [
      "Việc kiếm được điểm và huy hiệu khuyến khích tôi tiếp tục sử dụng ứng dụng này.",
      "Bảng xếp hạng làm tôi muốn cố gắng hơn để vượt qua những người khác."
    ],
    "related_theories": ["Flow Theory", "Self-Determination Theory (SDT)"],
    "limitations": "Việc áp dụng PBL một cách hời hợt có thể phản tác dụng nếu nó không được kết nối với động lực nội tại của người dùng. Nó có thể tạo ra cảm giác bị thao túng và giảm sự quan tâm dài hạn."
  },
  {
    "id": 138,
    "theory": "Hofstede's Cultural Dimensions",
    "constructs_full": "Power Distance; Individualism; Masculinity; Uncertainty Avoidance; Long-term Orientation",
    "constructs_code": "PDI; IDV; MAS; UAI; LTO",
    "note_vi": "Các chiều văn hóa ảnh hưởng đến quản trị và marketing quốc tế.",
    "group": "Culture",
    "domain": "International Business",
    "dependent_variable": "Cross-cultural Behavior (CCB)",
    "reference": "Hofstede (1980)",
    "application_vi": "McDonald's điều chỉnh thực đơn và chiến lược marketing để phù hợp với văn hóa từng quốc gia, ví dụ như không bán thịt bò ở Ấn Độ.",
    "definition_long": "Lý thuyết Chiều văn hóa của Hofstede là một khuôn khổ để hiểu sự khác biệt văn hóa giữa các quốc gia và cách chúng ảnh hưởng đến hành vi kinh doanh. Lý thuyết này xác định một số chiều mà giá trị văn hóa có thể được phân tích.",
    "constructs_detailed": [
      { "name": "Power Distance (Khoảng cách quyền lực)", "desc": "Mức độ mà các thành viên ít quyền lực hơn trong một xã hội chấp nhận và mong đợi rằng quyền lực được phân phối không đồng đều." },
      { "name": "Individualism vs. Collectivism (Chủ nghĩa cá nhân vs. Chủ nghĩa tập thể)", "desc": "Mức độ các cá nhân được hòa nhập vào các nhóm." },
      { "name": "Masculinity vs. Femininity (Nam tính vs. Nữ tính)", "desc": "Sự phân bổ vai trò cảm xúc giữa các giới tính. Văn hóa nam tính coi trọng sự quyết đoán và cạnh tranh, trong khi văn hóa nữ tính coi trọng sự khiêm tốn và chăm sóc." },
      { "name": "Uncertainty Avoidance (Né tránh sự không chắc chắn)", "desc": "Mức độ mà một xã hội cảm thấy bị đe dọa bởi các tình huống không chắc chắn hoặc không rõ ràng." },
      { "name": "Long-term Orientation (Định hướng dài hạn)", "desc": "Mức độ một xã hội duy trì các mối liên kết với quá khứ trong khi đối mặt với các thách thức của hiện tại và tương lai." }
    ],
    "sample_scales": [ "Các thang đo cho các chiều này đã được phát triển và kiểm định trong nhiều nghiên cứu (ví dụ: VSM - Values Survey Module)." ],
    "related_theories": ["Glocalization Strategy"],
    "limitations": "Lý thuyết này đã bị chỉ trích vì có thể đơn giản hóa quá mức và tạo ra các khuôn mẫu văn hóa. Dữ liệu ban đầu hiện đã cũ và có thể không phản ánh những thay đổi văn hóa gần đây. Sự khác biệt văn hóa trong một quốc gia cũng rất lớn."
  },
  {
    "id": 139,
    "theory": "Theory of Reasoned Action (TRA)",
    "constructs_full": "Attitude; Subjective Norms; Behavioral Intention",
    "constructs_code": "ATT; SN; BI",
    "note_vi": "Tiền thân của TPB, giải thích ý định hành vi.",
    "group": "Hành vi",
    "domain": "Consumer Behavior",
    "dependent_variable": "Behavioral Intention (BI)",
    "reference": "Fishbein & Ajzen (1975)",
    "application_vi": "Tiền thân của TPB, giải thích ý định của một người dựa trên thái độ cá nhân và ảnh hưởng của những người xung quanh họ.",
    "definition_long": "Lý thuyết Hành động Hợp lý (TRA) là tiền thân của Lý thuyết Hành vi có Kế hoạch (TPB). Nó cho rằng ý định hành vi của một người là yếu tố quyết định chính đến hành vi của họ. Ý định này được xác định bởi hai yếu tố: thái độ của người đó đối với hành vi và các chuẩn mực chủ quan của họ.",
    "constructs_detailed": [
      { "name": "Attitude (Thái độ)", "desc": "Đánh giá tích cực hay tiêu cực của cá nhân về việc thực hiện hành vi." },
      { "name": "Subjective Norms (Chuẩn chủ quan)", "desc": "Nhận thức của cá nhân về áp lực xã hội để thực hiện hoặc không thực hiện hành vi." }
    ],
    "sample_scales": [
      "Đối với tôi, việc thực hiện hành vi X là tốt/xấu.",
      "Hầu hết những người quan trọng đối với tôi nghĩ rằng tôi nên/không nên thực hiện hành vi X."
    ],
    "related_theories": ["Theory of Planned Behavior (TPB)"],
    "limitations": "TRA hoạt động tốt nhất khi hành vi nằm trong tầm kiểm soát hoàn toàn của ý chí cá nhân. Nó đã được mở rộng thành TPB để bao gồm các hành vi không hoàn toàn tự nguyện bằng cách thêm vào yếu tố 'Nhận thức kiểm soát hành vi'."
  },
  {
    "id": 140,
    "theory": "Information Processing Theory",
    "constructs_full": "Exposure; Attention; Comprehension; Acceptance; Retention",
    "constructs_code": "EXP; ATT; COMP; ACC; RET",
    "note_vi": "Các giai đoạn xử lý thông tin của người tiêu dùng.",
    "group": "Psychology",
    "domain": "Advertising, Communication",
    "dependent_variable": "Attitude Change (AC)",
    "reference": "McGuire (1976)",
    "application_vi": "Một quảng cáo phải được thiết kế để người xem tiếp xúc, chú ý, hiểu, chấp nhận và ghi nhớ thông điệp mà nó truyền tải.",
    "definition_long": "Lý thuyết Xử lý Thông tin là một nhóm các mô hình tâm lý nhận thức tập trung vào cách con người xử lý thông tin mà họ nhận được. Trong bối cảnh marketing, nó mô tả một chuỗi các giai đoạn mà người tiêu dùng phải trải qua để một thông điệp quảng cáo có thể có hiệu quả.",
    "constructs_detailed": [
      { "name": "Exposure (Tiếp xúc)", "desc": "Người tiêu dùng phải tiếp xúc với thông điệp." },
      { "name": "Attention (Chú ý)", "desc": "Họ phải chú ý đến thông điệp." },
      { "name": "Comprehension (Thấu hiểu)", "desc": "Họ phải hiểu thông điệp." },
      { "name": "Acceptance (Chấp nhận)", "desc": "Họ phải chấp nhận và bị thuyết phục bởi thông điệp." },
      { "name": "Retention (Lưu giữ)", "desc": "Thông điệp phải được ghi nhớ trong một khoảng thời gian." }
    ],
    "sample_scales": [
      "Tôi nhớ đã xem quảng cáo cho thương hiệu X.",
      "Tôi hiểu rõ thông điệp mà quảng cáo muốn truyền tải."
    ],
    "related_theories": ["Elaboration Likelihood Model (ELM)", "Mere Exposure Effect"],
    "limitations": "Giống như các mô hình giai đoạn khác, nó giả định một quy trình tuyến tính và tuần tự, trong khi thực tế việc xử lý thông tin có thể phức tạp hơn nhiều."
  },
  {
    "id": 141,
    "theory": "Hedonic vs. Utilitarian Consumption",
    "constructs_full": "Hedonic Value; Utilitarian Value; Purchase Motivation",
    "constructs_code": "HV; UV; PM",
    "note_vi": "Phân biệt tiêu dùng vì trải nghiệm (hưởng thụ) và vì chức năng (vị lợi).",
    "group": "Tiêu dùng",
    "domain": "Consumer Behavior",
    "dependent_variable": "Product Choice (PC)",
    "reference": "Batra & Ahtola (1991)",
    "application_vi": "Mua một chiếc máy tính để làm việc là tiêu dùng vị lợi (utilitarian), trong khi đi xem một buổi hòa nhạc là tiêu dùng hưởng thụ (hedonic).",
    "definition_long": "Khung khái niệm này phân biệt hai loại động cơ tiêu dùng chính. Tiêu dùng Vị lợi (Utilitarian) tập trung vào các khía cạnh chức năng, công cụ và thực tế của việc mua sắm; nó được thúc đẩy bởi một nhu cầu cần được giải quyết. Tiêu dùng Hưởng thụ (Hedonic) tập trung vào các khía cạnh trải nghiệm, cảm xúc, và giác quan của việc mua sắm; nó được thúc đẩy bởi mong muốn tìm kiếm niềm vui và sự hứng thú.",
    "constructs_detailed": [
      { "name": "Hedonic Value (Giá trị hưởng thụ)", "desc": "Giá trị liên quan đến sự giải trí, trải nghiệm thẩm mỹ và niềm vui cảm giác." },
      { "name": "Utilitarian Value (Giá trị vị lợi)", "desc": "Giá trị liên quan đến việc một sản phẩm giúp người tiêu dùng hoàn thành một nhiệm vụ hoặc giải quyết một vấn đề." }
    ],
    "sample_scales": [
      "Việc mua sắm tại cửa hàng này là một trải nghiệm thú vị.",
      "Tôi mua sản phẩm này vì nó giúp tôi hoàn thành công việc một cách hiệu quả."
    ],
    "related_theories": ["Customer Perceived Value"],
    "limitations": "Nhiều sản phẩm và trải nghiệm mua sắm có cả hai khía cạnh vị lợi và hưởng thụ, và việc tách bạch chúng có thể khó khăn."
  },
  {
    "id": 142,
    "theory": "Brand Personality Framework",
    "constructs_full": "Sincerity; Excitement; Competence; Sophistication; Ruggedness",
    "constructs_code": "SINC; EXC; COMP; SOPH; RUGG",
    "note_vi": "Năm chiều tính cách thương hiệu.",
    "group": "Thương hiệu",
    "domain": "Branding",
    "dependent_variable": "Brand Attitude (BA)",
    "reference": "Aaker (1997)",
    "application_vi": "Thương hiệu Dove có tính cách Chân thành, Red Bull là Phấn khích, IBM là Năng lực, Chanel là Tinh tế, và Jeep là Phong trần.",
    "definition_long": "Khung Tính cách Thương hiệu của Aaker đề xuất rằng các thương hiệu có thể được mô tả bằng cách sử dụng các đặc điểm tính cách tương tự như con người. Khung này xác định năm chiều cốt lõi của tính cách thương hiệu, giúp các nhà tiếp thị định hình và truyền thông hình ảnh thương hiệu một cách nhất quán.",
    "constructs_detailed": [
      { "name": "Sincerity (Chân thành)", "desc": "Thân thiện, trung thực, lành mạnh và vui vẻ (ví dụ: Coca-Cola, Dove)." },
      { "name": "Excitement (Phấn khích)", "desc": "Táo bạo, sôi nổi, giàu trí tưởng tượng và cập nhật (ví dụ: Nike, Red Bull)." },
      { "name": "Competence (Năng lực)", "desc": "Đáng tin cậy, thông minh và thành công (ví dụ: IBM, Microsoft)." },
      { "name": "Sophistication (Tinh tế)", "desc": "Quyến rũ, thượng lưu và sang trọng (ví dụ: Rolex, Mercedes-Benz)." },
      { "name": "Ruggedness (Phong trần)", "desc": "Mạnh mẽ, nam tính và yêu thích hoạt động ngoài trời (ví dụ: Harley-Davidson, Jeep)." }
    ],
    "sample_scales": [ "Thương hiệu này có vẻ rất đáng tin cậy.", "Tôi nghĩ thương hiệu này rất năng động và trẻ trung." ],
    "related_theories": ["Brand Equity (Keller)", "Self-Congruity Theory"],
    "limitations": "Năm chiều này được phát triển trong bối cảnh văn hóa Mỹ và có thể không hoàn toàn áp dụng được cho tất cả các nền văn hóa khác."
  },
  {
    "id": 143,
    "theory": "Marketing Mix (4Ps/7Ps)",
    "constructs_full": "Product; Price; Place; Promotion; People; Process; Physical Evidence",
    "constructs_code": "P1; P2; P3; P4; P5; P6; P7",
    "note_vi": "Các công cụ marketing cốt lõi để đạt mục tiêu thị trường.",
    "group": "Marketing",
    "domain": "Marketing Management",
    "dependent_variable": "Sales (S)",
    "reference": "McCarthy (4Ps); Booms & Bitner (7Ps)",
    "application_vi": "Một công ty phải phối hợp các yếu tố: sản phẩm tốt, giá cả hợp lý, phân phối đúng nơi, quảng bá hiệu quả, con người chuyên nghiệp, quy trình thuận tiện và cơ sở vật chất đẹp.",
    "definition_long": "Marketing Mix là một tập hợp các công cụ marketing chiến thuật, có thể kiểm soát được mà một công ty kết hợp để tạo ra phản ứng mong muốn từ thị trường mục tiêu. Mô hình 4P truyền thống (cho sản phẩm hữu hình) đã được mở rộng thành 7P để bao gồm các khía cạnh của marketing dịch vụ.",
    "constructs_detailed": [
      { "name": "Product (Sản phẩm)", "desc": "Sản phẩm hoặc dịch vụ được cung cấp." },
      { "name": "Price (Giá cả)", "desc": "Số tiền khách hàng phải trả." },
      { "name": "Place (Phân phối)", "desc": "Cách sản phẩm đến tay khách hàng." },
      { "name": "Promotion (Xúc tiến)", "desc": "Các hoạt động truyền thông về sản phẩm." },
      { "name": "People (Con người)", "desc": "Tất cả những người liên quan đến việc cung cấp dịch vụ." },
      { "name": "Process (Quy trình)", "desc": "Các quy trình và luồng hoạt động cung cấp dịch vụ." },
      { "name": "Physical Evidence (Bằng chứng hữu hình)", "desc": "Môi trường nơi dịch vụ được cung cấp và bất kỳ yếu tố hữu hình nào." }
    ],
    "sample_scales": [ "Đây là một khung lập kế hoạch, không phải là một mô hình đo lường thái độ." ],
    "related_theories": [],
    "limitations": "Mô hình 4P/7P có thể bị coi là quá tập trung vào công ty thay vì khách hàng. Các mô hình hiện đại hơn như 4C (Customer, Cost, Convenience, Communication) được đề xuất để có góc nhìn hướng về khách hàng hơn."
  },
  {
    "id": 144,
    "theory": "Value-Attitude-Behavior (VAB) Hierarchy",
    "constructs_full": "Values; Attitudes; Behavior",
    "constructs_code": "VAL; ATT; BEH",
    "note_vi": "Giá trị ảnh hưởng đến thái độ, từ đó định hình hành vi.",
    "group": "Hành vi",
    "domain": "Environmental Psychology",
    "dependent_variable": "Pro-environmental Behavior (PEB)",
    "reference": "Homer & Kahle (1988)",
    "application_vi": "Một người coi trọng giá trị bảo vệ môi trường (value) sẽ có thái độ tích cực với các sản phẩm tái chế (attitude) và có hành vi mua chúng (behavior).",
    "definition_long": "Hệ thống phân cấp Giá trị-Thái độ-Hành vi đề xuất một chuỗi nhân quả trong đó các giá trị cơ bản và trừu tượng của một cá nhân ảnh hưởng đến các thái độ cụ thể hơn của họ, và những thái độ này, đến lượt nó, sẽ định hướng cho hành vi. Lý thuyết này thường được áp dụng trong bối cảnh hành vi ủng hộ môi trường.",
    "constructs_detailed": [
      { "name": "Values (Giá trị)", "desc": "Các niềm tin trừu tượng, bền vững về những gì là quan trọng và đáng mong muốn." },
      { "name": "Attitudes (Thái độ)", "desc": "Các đánh giá tích cực hoặc tiêu cực về các đối tượng hoặc hành vi cụ thể." },
      { "name": "Behavior (Hành vi)", "desc": "Các hành động thực tế được thực hiện." }
    ],
    "sample_scales": [
      "Việc bảo vệ môi trường là một nguyên tắc chỉ đạo quan trọng trong cuộc sống của tôi.",
      "Tôi có thái độ rất tích cực đối với việc tái chế."
    ],
    "related_theories": ["Theory of Planned Behavior (TPB)"],
    "limitations": "Mối quan hệ giữa các thành phần không phải lúc nào cũng mạnh mẽ và đơn giản. Nhiều yếu tố khác có thể can thiệp vào mối liên hệ giữa thái độ và hành vi (khoảng cách thái độ-hành vi)."
  },
  {
    "id": 145,
    "theory": "Conservation of Resources (COR) Theory",
    "constructs_full": "Resource Loss; Resource Gain; Stress; Coping",
    "constructs_code": "RL; RG; STR; COP",
    "note_vi": "Con người nỗ lực bảo tồn nguồn lực, mất mát nguồn lực gây stress.",
    "group": "Psychology",
    "domain": "Organizational Behavior",
    "dependent_variable": "Burnout (BO)",
    "reference": "Hobfoll (1989)",
    "application_vi": "Sự kiệt sức (burnout) ở nhân viên thường xảy ra khi họ phải đối mặt với việc mất mát các nguồn lực (thời gian, năng lượng, sự hỗ trợ) liên tục.",
    "definition_long": "Lý thuyết Bảo tồn Nguồn lực là một lý thuyết về căng thẳng, cho rằng các cá nhân có động lực để có được, duy trì và bảo vệ những thứ mà họ coi trọng (nguồn lực). Căng thẳng xảy ra khi có một mối đe dọa mất mát nguồn lực, mất mát nguồn lực thực sự, hoặc không có được nguồn lực sau khi đã đầu tư đáng kể.",
    "constructs_detailed": [
      { "name": "Resources (Nguồn lực)", "desc": "Các đối tượng, trạng thái cá nhân, điều kiện, hoặc năng lượng mà một cá nhân coi trọng (ví dụ: lòng tự trọng, thời gian, tiền bạc, các mối quan hệ xã hội)." },
      { "name": "Resource Loss (Mất mát nguồn lực)", "desc": "Yếu tố dự báo căng thẳng mạnh mẽ nhất." },
      { "name": "Resource Gain (Có được nguồn lực)", "desc": "Việc có được nguồn lực trở nên quan trọng hơn trong bối cảnh mất mát nguồn lực." }
    ],
    "sample_scales": [
      "Gần đây, khối lượng công việc của tôi đã tăng lên đáng kể.",
      "Tôi cảm thấy cạn kiệt năng lượng sau một ngày làm việc."
    ],
    "related_theories": ["Job Demands-Resources (JD-R) Model"],
    "limitations": "Việc định nghĩa và đo lường 'nguồn lực' có thể rất rộng và chủ quan, vì những gì một người coi là nguồn lực có giá trị có thể không giống với người khác."
  },
  {
    "id": 146,
    "theory": "Person-Environment (P-E) Fit",
    "constructs_full": "Person-Job Fit; Person-Organization Fit; Needs-Supplies Fit; Demands-Abilities Fit",
    "constructs_code": "PJ; PO; NS; DA",
    "note_vi": "Sự tương hợp giữa cá nhân và môi trường ảnh hưởng đến kết quả công việc.",
    "group": "HR",
    "domain": "Organizational Behavior",
    "dependent_variable": "Satisfaction (SAT)",
    "reference": "P-E Fit literature",
    "application_vi": "Sự phù hợp giữa cá tính của nhân viên và văn hóa của tổ chức là một yếu tố quan trọng quyết định sự hài lòng và ý định ở lại.",
    "definition_long": "Sự phù hợp giữa Cá nhân và Môi trường (P-E Fit) là một khung lý thuyết rộng lớn cho rằng thái độ và hành vi của con người là kết quả của sự tương tác giữa các đặc điểm của cá nhân và môi trường. Sự phù hợp cao dẫn đến các kết quả tích cực (ví dụ: hài lòng, hiệu suất cao), trong khi sự không phù hợp dẫn đến căng thẳng và các kết quả tiêu cực.",
    "constructs_detailed": [
      { "name": "Person-Job Fit (P-J Fit)", "desc": "Sự phù hợp giữa khả năng của một cá nhân và yêu cầu của công việc, hoặc giữa nhu cầu của cá nhân và những gì công việc cung cấp." },
      { "name": "Person-Organization Fit (P-O Fit)", "desc": "Sự tương thích giữa các giá trị của cá nhân và các giá trị, văn hóa của tổ chức." },
      { "name": "Needs-Supplies Fit (Sự phù hợp Nhu cầu-Cung cấp)", "desc": "Môi trường đáp ứng được nhu cầu và sở thích của cá nhân." },
      { "name": "Demands-Abilities Fit (Sự phù hợp Yêu cầu-Khả năng)", "desc": "Cá nhân có đủ khả năng để đáp ứng các yêu cầu của môi trường." }
    ],
    "sample_scales": [
      "Các giá trị cá nhân của tôi rất phù hợp với các giá trị của tổ chức này.",
      "Công việc này tận dụng tốt các kỹ năng và khả năng của tôi."
    ],
    "related_theories": ["Job Characteristics Model"],
    "limitations": "Sự phù hợp quá mức có thể dẫn đến sự đồng nhất và thiếu đa dạng trong suy nghĩ, cản trở sự đổi mới. Mọi người cũng có thể thay đổi và thích nghi với môi trường theo thời gian."
  },
  {
    "id": 147,
    "theory": "Social Learning Theory",
    "constructs_full": "Observational Learning; Modeling; Reinforcement; Self-Efficacy",
    "constructs_code": "OL; MOD; REIN; SE",
    "note_vi": "Học tập thông qua quan sát và bắt chước người khác.",
    "group": "Hành vi",
    "domain": "Psychology, Training",
    "dependent_variable": "Skill Acquisition (SA)",
    "reference": "Bandura (1977)",
    "application_vi": "Nhân viên mới học hỏi các kỹ năng và quy tắc ứng xử bằng cách quan sát và bắt chước các đồng nghiệp có kinh nghiệm.",
    "definition_long": "Lý thuyết Học tập Xã hội, tiền thân của Lý thuyết Nhận thức Xã hội, cho rằng con người học hỏi từ nhau thông qua quan sát, bắt chước và mô hình hóa. Nó đóng vai trò là cầu nối giữa các lý thuyết hành vi và nhận thức vì nó bao gồm cả sự chú ý, trí nhớ và động lực.",
    "constructs_detailed": [
      { "name": "Observational Learning (Học tập qua quan sát)", "desc": "Học hỏi bằng cách xem người khác (mô hình) hành động." },
      { "name": "Modeling (Mô hình hóa)", "desc": "Quá trình quan sát và bắt chước một hành vi cụ thể." },
      { "name": "Reinforcement (Củng cố)", "desc": "Các hậu quả (khen thưởng hoặc trừng phạt) của hành vi được quan sát có thể ảnh hưởng đến việc liệu người quan sát có bắt chước hay không." }
    ],
    "sample_scales": [ "Lý thuyết này thường được nghiên cứu trong các môi trường giáo dục và đào tạo, đo lường sự cải thiện về kỹ năng hoặc thay đổi hành vi." ],
    "related_theories": ["Social Cognitive Theory"],
    "limitations": "Lý thuyết này không giải thích đầy đủ về trách nhiệm cá nhân. Một người có thể quan sát hành vi tiêu cực nhưng vẫn có khả năng lựa chọn không bắt chước nó."
  },
  {
    "id": 148,
    "theory": "Emotional Contagion",
    "constructs_full": "Emotional Expression; Mimicry; Feedback; Contagion",
    "constructs_code": "EE; MIM; FB; EC",
    "note_vi": "Sự lan truyền cảm xúc từ người này sang người khác.",
    "group": "Cảm xúc",
    "domain": "Service Encounters, Teams",
    "dependent_variable": "Customer Satisfaction (CS)",
    "reference": "Hatfield et al. (1994)",
    "application_vi": "Sự nhiệt tình và tích cực của một nhân viên phục vụ có thể 'lây lan' sang khách hàng, làm tăng sự hài lòng của họ.",
    "definition_long": "Lây lan Cảm xúc là một quá trình mà một người hoặc một nhóm ảnh hưởng đến cảm xúc hoặc hành vi của một người hoặc nhóm khác thông qua việc lan truyền có ý thức hoặc vô thức các trạng thái cảm xúc. Quá trình này được cho là xảy ra thông qua sự bắt chước tự động và đồng bộ hóa các biểu cảm giọng nói, nét mặt và tư thế.",
    "constructs_detailed": [
      { "name": "Mimicry (Sự bắt chước)", "desc": "Sự bắt chước vô thức các biểu hiện cảm xúc của người khác." },
      { "name": "Feedback (Phản hồi)", "desc": "Sự bắt chước tạo ra các phản hồi từ cơ mặt, giọng nói, v.v., góp phần tạo ra trải nghiệm cảm xúc tương ứng." },
      { "name": "Contagion (Sự lây lan)", "desc": "Kết quả là cá nhân 'bắt' được cảm xúc của người khác." }
    ],
    "sample_scales": [
      "Khi tôi tương tác với một nhân viên vui vẻ, tôi cũng cảm thấy vui vẻ hơn.",
      "Tâm trạng của nhóm ảnh hưởng lớn đến tâm trạng của cá nhân tôi."
    ],
    "related_theories": ["Affective Events Theory"],
    "limitations": "Mức độ dễ bị lây lan cảm xúc khác nhau ở mỗi người. Một số người có khả năng 'miễn dịch' tốt hơn với cảm xúc của người khác."
  },
  {
    "id": 149,
    "theory": "Servant Leadership",
    "constructs_full": "Empowering; Humility; Stewardship; Helping Subordinates Grow",
    "constructs_code": "EMP; HUM; STEW; HSG",
    "note_vi": "Lãnh đạo phục vụ, đặt lợi ích của nhân viên lên hàng đầu.",
    "group": "Leadership",
    "domain": "Management",
    "dependent_variable": "Follower Performance (FP)",
    "reference": "Greenleaf (1970)",
    "application_vi": "Nhà lãnh đạo đặt nhu cầu và sự phát triển của nhân viên lên hàng đầu, phục vụ thay vì ra lệnh, từ đó xây dựng lòng tin và sự tận tụy.",
    "definition_long": "Lãnh đạo Phục vụ là một triết lý và tập hợp các thực hành lãnh đạo đảo ngược mô hình quyền lực truyền thống. Thay vì các nhân viên làm việc để phục vụ lãnh đạo, nhà lãnh đạo tồn tại để phục vụ nhân viên. Nhà lãnh đạo phục vụ tập trung vào sự phát triển và hạnh phúc của mọi người và cộng đồng mà họ thuộc về.",
    "constructs_detailed": [
      { "name": "Empowering (Trao quyền)", "desc": "Trao quyền và khuyến khích sự phát triển cá nhân của nhân viên." },
      { "name": "Humility (Khiêm tốn)", "desc": "Thừa nhận những sai lầm và giới hạn của bản thân, đặt lợi ích của người khác lên trước." },
      { "name": "Stewardship (Quản gia)", "desc": "Hành động vì lợi ích lớn hơn của xã hội và tổ chức, chứ không phải vì lợi ích cá nhân." },
      { "name": "Helping Subordinates Grow (Giúp nhân viên phát triển)", "desc": "Cam kết với sự phát triển cá nhân và chuyên môn của mỗi cá nhân trong nhóm." }
    ],
    "sample_scales": [
      "Lãnh đạo của tôi đặt nhu cầu của tôi lên trên nhu cầu của chính anh/cô ấy.",
      "Lãnh đạo của tôi làm mọi thứ có thể để giúp tôi phát triển sự nghiệp.",
      "Lãnh đạo của tôi thừa nhận khi anh/cô ấy mắc lỗi."
    ],
    "related_theories": ["Transformational Leadership", "Authentic Leadership"],
    "limitations": "Khái niệm này có thể bị coi là quá lý tưởng và khó áp dụng trong các môi trường cạnh tranh cao hoặc đòi hỏi cấu trúc phân cấp rõ ràng. Nó cũng có thể xung đột với kỳ vọng truyền thống về một nhà lãnh đạo 'mạnh mẽ'."
  },
  {
    "id": 150,
    "theory": "Authentic Leadership",
    "constructs_full": "Self-Awareness; Relational Transparency; Balanced Processing; Internalized Moral Perspective",
    "constructs_code": "SAW; RT; BP; IMP",
    "note_vi": "Lãnh đạo chân thực, nhất quán với giá trị bản thân.",
    "group": "Leadership",
    "domain": "Management",
    "dependent_variable": "Follower Trust (FT)",
    "reference": "Walumbwa et al. (2008)",
    "application_vi": "Lãnh đạo hành động nhất quán với giá trị của bản thân, minh bạch và chân thành, từ đó xây dựng được sự tin tưởng sâu sắc từ nhân viên.",
    "definition_long": "Lãnh đạo Chân thực là một cách tiếp cận lãnh đạo nhấn mạnh việc xây dựng tính hợp pháp của nhà lãnh đạo thông qua các mối quan hệ trung thực với nhân viên, coi trọng ý kiến của họ. Nhà lãnh đạo chân thực được cho là những người tự nhận thức sâu sắc về suy nghĩ và hành vi của mình và được người khác coi là nhận thức được bản thân, cũng như nhận thức được bối cảnh mà họ hoạt động.",
    "constructs_detailed": [
      { "name": "Self-Awareness (Tự nhận thức)", "desc": "Hiểu rõ điểm mạnh, điểm yếu và tác động của mình đối với người khác." },
      { "name": "Relational Transparency (Sự minh bạch trong quan hệ)", "desc": "Thể hiện con người thật của mình một cách cởi mở và trung thực." },
      { "name": "Balanced Processing (Xử lý cân bằng)", "desc": "Phân tích khách quan tất cả các dữ liệu liên quan trước khi đưa ra quyết định." },
      { "name": "Internalized Moral Perspective (Quan điểm đạo đức nội tâm hóa)", "desc": "Hành vi được điều chỉnh bởi các tiêu chuẩn và giá trị đạo đức nội tại, thay vì áp lực từ bên ngoài." }
    ],
    "sample_scales": [
      "Lãnh đạo của tôi thể hiện những niềm tin nhất quán với hành động.",
      "Lãnh đạo của tôi lắng nghe cẩn thận các quan điểm khác nhau trước khi đưa ra kết luận.",
      "Lãnh đạo của tôi thừa nhận sai lầm khi họ mắc phải."
    ],
    "related_theories": ["Transformational Leadership", "Servant Leadership"],
    "limitations": "Định nghĩa về 'con người thật' có thể phức tạp. Việc quá minh bạch đôi khi có thể không phù hợp trong mọi tình huống kinh doanh. Ngoài ra, việc đo lường các trạng thái nội tâm như 'tự nhận thức' là một thách thức."
  } 
]